{
  "metadata": {
    "title": "PTS tillsynsregler för granskning av webbplatser",
    "description": "Strukturerad JSON-representation av kraven ur EN 301 549 version 3.2.1 kompletterade med WCAG 2.2 nivå A och AA.",
    "version": "2025.9.r19",
    "language": "sv",
    "publisher": {
      "name": "PTS - Post och telesryrelsen",
      "contactPoint": "tillganglighetslagen@pts.se"
    },
    "source": {
      "url": "https://www.pts.se/Tillgänglighetslagen",
      "title": "Tillgänglighetslagen | PTS",
      "retrievedDate": "2025-05-13",
      "format": "text/html"
    },
    "dateCreated": "2025-05-13",
    "dateModified": "2025-09-19",
    "license": "Creative Commons Attribution 4.0 International (CC BY 4.0)",
    "keywords": [
      "tillgänglighet",
      "wcag",
      "en301549",
      "digg",
      "tillsyn",
      "checklista",
      "webb",
      "sverige",
      "accessibility",
      "checklist",
      "sweden",
      "a11y",
      "t12t",
      "tillgänglighetsregler",
      "testdata"
    ],
    "contentTypes": [
      {
        "id": "teknisk-grundstruktur",
        "text": "Teknisk grundstruktur",
        "types": [
          {
            "id": "teknisk-grundstruktur-roller-och-egenskaper-i-koden",
            "text": "Roller och egenskaper i koden",
            "description": "Detta handlar om de interaktiva delar som finns på en webbsida, till exempel knappar, menyer eller rullgardinslistor. När du använder en webbplats kan du klicka på sådana element för att göra saker, som att skicka ett formulär eller öppna en meny. För att alla användare, även de som använder hjälpmedel som skärmläsare, ska förstå vad varje del gör behöver dessa komponenter vara tydligt beskrivna i bakgrunden i koden."
          },
          {
            "id": "teknisk-grundstruktur-sidtitel",
            "text": "Sidtitel",
            "description": "Varje webbsida har en titel som syns längst upp i webbläsarens flik. Titeln är en kort text som beskriver vad sidan handlar om, ungefär som en rubrik. Den hjälper både användare och hjälpmedel att snabbt förstå sidans syfte."
          },
          {
            "id": "teknisk-grundstruktur-sidans-sprak",
            "text": "Sidans språk",
            "description": "En webbsida kan innehålla text på olika språk. Därför behöver det anges vilket språk som är huvudspråk för hela sidan. På så sätt kan till exempel en skärmläsare läsa upp texten med rätt uttal och språkstöd."
          }
        ]
      },
      {
        "id": "text-och-struktur",
        "text": "Text och struktur",
        "types": [
          {
            "id": "text-och-struktur-text",
            "text": "Text",
            "description": "Med text menas allt det skrivna innehållet på en sida. Texten behöver vara lätt att läsa och kunna förstoras vid behov utan att innehåll eller funktion går förlorad. Det handlar både om själva orden och om hur de presenteras på skärmen, till exempel avståndet mellan rader, ord och tecken."
          },
          {
            "id": "text-och-struktur-rubriker",
            "text": "Rubriker",
            "description": "Rubriker används för att dela upp innehållet i tydliga delar. De hjälper dig att snabbt få en överblick och hitta det du söker. På en webbsida är rubriker inte bara en fråga om utseende, utan de ska också vara korrekt markerade i koden så att hjälpmedel kan känna igen och presentera dem i rätt ordning."
          },
          {
            "id": "text-och-struktur-listor",
            "text": "Listor",
            "description": "Listor används när information ska räknas upp i punktform eller numreras. Exempel är inköpslistor eller steg i en instruktion. Listor ska markeras som listor i koden så att både människor och hjälpmedel kan förstå ordningen och sammanhanget."
          },
          {
            "id": "text-och-struktur-tabeller",
            "text": "Tabeller",
            "description": "Tabeller används för att visa information som hör ihop i rader och kolumner, till exempel ett schema eller en prislista. För att tabeller ska vara begripliga behöver rubrikerna för rader och kolumner vara korrekt angivna så att det går att se vilken uppgift som hör till vilken rubrik."
          },
          {
            "id": "text-och-struktur-landmarken",
            "text": "Landmärken",
            "description": "Landmärken är olika delar av en webbsida som hjälper användaren att förstå sidans struktur. Exempel är huvudområde, navigering, huvudinnehåll och sidfot. Dessa delar ska vara tydligt markerade i koden så att man enkelt kan hoppa mellan dem, särskilt när man använder hjälpmedel som skärmläsare."
          }
        ]
      },
      {
        "id": "navigering",
        "text": "Navigering",
        "types": [
          {
            "id": "navigering-lankar",
            "text": "Länkar",
            "description": "Länkar är klickbara element som leder dig vidare till en annan sida eller en annan plats på samma sida. De är en av de vanligaste sätten att röra sig runt på webben. För att länkar ska vara användbara behöver det framgå tydligt vart de leder, både för den som ser texten och för den som använder hjälpmedel."
          },
          {
            "id": "navigering-navigeringsmenyer",
            "text": "Navigeringsmenyer",
            "description": "Navigeringsmenyer är de samlade menyer som hjälper dig att hitta rätt på en webbplats. Exempel är huvudmenyn som ofta ligger högst upp på sidan, en lokal meny som visar innehållet i en viss del av webbplatsen, eller brödsmulor som visar var du befinner dig. Menyerna gör det möjligt att snabbt byta mellan olika delar av webbplatsen."
          }
        ]
      },
      {
        "id": "formular",
        "text": "Formulär",
        "types": [
          {
            "id": "formular-inmatningsfalt",
            "text": "Inmatningsfält",
            "description": "Inmatningsfält är de rutor där du kan skriva in eller välja information, till exempel namn, e-postadress eller ett val från en rullgardinslista. De används ofta i kontaktformulär, beställningar och inloggningar."
          },
          {
            "id": "formular-knappar",
            "text": "Knappar",
            "description": "Knappar är element som du klickar på för att genomföra en åtgärd, till exempel skicka ett formulär eller starta en sökning. Knapparna kan ha olika utseende men de ska alltid vara tydliga med vad som händer när du trycker på dem."
          },
          {
            "id": "formular-formular-helhet",
            "text": "Formulär (helhet)",
            "description": "Ett formulär är en samling av inmatningsfält, knappar och eventuella andra delar som hör ihop. Det kan vara ett kontaktformulär, en beställning eller en ansökan. Ett bra formulär är logiskt uppbyggt så att det är enkelt att fylla i och förstå, även när något går fel."
          }
        ]
      },
      {
        "id": "interaktiva-komponenter",
        "text": "Interaktiva komponenter",
        "types": [
          {
            "id": "interaktiva-komponenter-dialoger-och-modaler",
            "text": "Dialoger och modaler",
            "description": "Dialoger och modaler är fönster som öppnas ovanpå den vanliga sidan. De används ofta för att visa viktig information eller för att be dig bekräfta något, till exempel om du vill ta bort ett konto. En dialog ska alltid vara enkel att stänga och det ska vara tydligt vad den handlar om."
          },
          {
            "id": "interaktiva-komponenter-komplexa-interaktiva-komponenter",
            "text": "Komplexa interaktiva komponenter",
            "description": "Här ingår mer avancerade delar som flikar, reglage, bildkaruseller eller funktioner där du kan dra och släppa objekt. De gör det möjligt att interagera med innehållet på fler sätt än bara genom att klicka på en länk eller knapp."
          },
          {
            "id": "interaktiva-komponenter-tabellkomponenter-med-interaktion",
            "text": "Tabellkomponenter med interaktion",
            "description": "Detta är tabeller som inte bara visar information utan som också går att använda aktivt, till exempel genom att sortera, filtrera eller låsa rubrikerna. De gör det enklare att hantera och förstå större mängder data."
          }
        ]
      },
      {
        "id": "bilder-och-ikoner",
        "text": "Bilder och ikoner",
        "types": [
          {
            "id": "bilder-och-ikoner-bilder",
            "text": "Bilder",
            "description": "Bilder kan antingen förmedla viktig information, till exempel en karta eller en illustration, eller vara dekorativa inslag som bara är till för utseendet. När en bild bär på information behöver det finnas en text som beskriver den, så att alla användare kan förstå innehållet."
          },
          {
            "id": "bilder-och-ikoner-ikoner",
            "text": "Ikoner",
            "description": "Ikoner är små symboler som ofta används i knappar, länkar eller som markörer. De kan till exempel visa en papperskorg för att ta bort något eller ett kuvert för e-post. Eftersom ikoner är bilder behöver deras betydelse förklaras med text, så att de går att förstå även utan att se symbolen."
          },
          {
            "id": "bilder-och-ikoner-kartor-diagram-och-datavisualisering",
            "text": "Kartor, diagram och datavisualisering",
            "description": "Detta är grafiska framställningar som används för att visa information på ett överskådligt sätt, till exempel en geografisk karta, ett stapeldiagram eller en graf. Eftersom den typen av innehåll kan vara svårt att tolka enbart visuellt behöver det alltid finnas en alternativ beskrivning."
          }
        ]
      },
      {
        "id": "ljud-och-video",
        "text": "Ljud och video",
        "types": [
          {
            "id": "ljud-och-video-video-eller-filmklipp",
            "text": "Video eller filmklipp",
            "description": "Video används för att visa både bild och ljud. Det kan vara allt från informationsfilmer till instruktionsklipp. För att alla ska kunna ta del av innehållet behöver det finnas undertexter för det som sägs och ibland också en beskrivning av vad som syns på skärmen."
          },
          {
            "id": "ljud-och-video-ljudklipp",
            "text": "Ljudklipp",
            "description": "Ljudklipp innehåller bara ljud, till exempel en podcast eller en ljudfil med information. Eftersom det inte finns någon bild är det viktigt att det finns en textversion, till exempel ett transkript, så att innehållet går att förstå även utan att lyssna."
          },
          {
            "id": "ljud-och-video-animeringar-utan-ljud",
            "text": "Animeringar utan ljud",
            "description": "Detta är rörliga inslag på en sida som inte har ljud, till exempel animerade reklambanners eller grafiska effekter. Eftersom rörligt innehåll kan störa eller göra det svårt att fokusera behöver användaren kunna pausa, stoppa eller dölja det."
          }
        ]
      },
      {
        "id": "mediespelare",
        "text": "Mediespelare",
        "types": [
          {
            "id": "mediespelare-mediespelare-for-video",
            "text": "Mediespelare för video",
            "description": "En mediespelare för video är den del av en webbsida som gör det möjligt att spela upp filmklipp. Den innehåller knappar för att starta och pausa filmen, reglage för ljudnivå och en tidslinje där du kan spola framåt eller bakåt."
          },
          {
            "id": "mediespelare-mediespelare-for-ljud",
            "text": "Mediespelare för ljud",
            "description": "En mediespelare för ljud används för att spela upp ljudklipp, till exempel musik eller en podcast. Den har ofta samma typer av kontroller som en videospelare, men utan bild. Exempel är knappar för att starta och pausa, justera volymen eller spola."
          }
        ]
      },
      {
        "id": "dynamiskt-innehall",
        "text": "Dynamiskt innehåll",
        "types": [
          {
            "id": "dynamiskt-innehall-rorliga-element",
            "text": "Rörliga element",
            "description": "Rörliga element är innehåll som rör sig på en webbsida, till exempel animationer, rullande text eller effekter där bakgrunden förflyttas när du skrollar. Sådant innehåll kan vara dekorativt eller användas för att framhäva information, men det kan också störa om det inte går att stänga av eller pausa."
          },
          {
            "id": "dynamiskt-innehall-uppdaterande-innehall",
            "text": "Uppdaterande innehåll",
            "description": "Uppdaterande innehåll är information som ändras automatiskt utan att du själv gör något. Exempel är livedata, nyhetsflöden eller sidor som laddas om efter en viss tid. För att detta ska vara hanterbart behöver användaren ha kontroll över när och hur innehållet ändras."
          }
        ]
      },
      {
        "id": "sarskilda-hinder",
        "text": "Särskilda hinder",
        "types": [
          {
            "id": "sarskilda-hinder-captcha",
            "text": "CAPTCHA",
            "description": "En CAPTCHA är ett test som används för att skilja mellan människa och dator. Du har säkert stött på det i form av bilder där du ska klicka på trafikljus eller skriva in bokstäver från en suddig bild. Syftet är att förhindra automatiserade program från att missbruka tjänster, men det kan också bli ett hinder för användare som har svårt att se eller tolka testet."
          }
        ]
      },
      {
        "id": "enhetsspecifikt-och-avancerat",
        "text": "Enhetsspecifikt och avancerat",
        "types": [
          {
            "id": "enhetsspecifikt-och-avancerat-touchfunktioner",
            "text": "Touchfunktioner",
            "description": "Touchfunktioner används på pekskärmar, till exempel på mobiltelefoner eller surfplattor. Det kan handla om att svepa, nypa eller dra med fingrarna för att utföra en åtgärd. För att undvika misstag behöver ytorna vara tillräckligt stora och det ska finnas enklare alternativ för den som inte kan göra avancerade rörelser."
          },
          {
            "id": "enhetsspecifikt-och-avancerat-rost-och-videokommunikation",
            "text": "Röst- och videokommunikation",
            "description": "Detta är funktioner som gör det möjligt att prata eller ha videosamtal direkt på en webbplats eller i en webbtjänst. Exempel är kundtjänst via video eller röstchatt. Sådana funktioner behöver fungera på ett sätt som alla kan använda, även personer som förlitar sig på hjälpmedel."
          },
          {
            "id": "enhetsspecifikt-och-avancerat-biometri",
            "text": "Biometri",
            "description": "Biometri innebär att man identifierar sig med kroppsliga kännetecken, till exempel fingeravtryck eller ansiktsigenkänning. På webbplatser kan detta användas som inloggningsmetod. Eftersom inte alla kan använda biometriska lösningar behöver det alltid finnas ett alternativ, till exempel inloggning med lösenord."
          }
        ]
      },
      {
        "id": "sprak",
        "text": "Språk",
        "types": [
          {
            "id": "sprak-sprak-i-delar-av-sidan",
            "text": "Språk i delar av sidan",
            "description": "En webbsida kan ibland innehålla text på andra språk än sidans huvudspråk. Det kan till exempel vara en engelsk term i en svensk text eller ett helt stycke på ett annat språk. När detta händer behöver det markeras i koden vilket språk den delen har, så att hjälpmedel som skärmläsare kan läsa upp texten med rätt uttal."
          }
        ]
      }
    ],
    "monitoringType": {
      "type": "web",
      "text": "Webbplats"
    },
    "samples": {
      "sampleCategories": [
        {
          "id": "webbsida",
          "text": "Webbsida",
          "hasUrl": true,
          "categories": [
            {
              "id": "startsida",
              "text": "Startsida"
            },
            {
              "id": "produktinformation",
              "text": "Produktinformation"
            },
            {
              "id": "sokresultat",
              "text": "Sökresultat"
            },
            {
              "id": "om-oss",
              "text": "Om oss"
            },
            {
              "id": "kop-process",
              "text": "Köp-process"
            },
            {
              "id": "kundinfo-och-kopvillkor",
              "text": "Kundinformation och köpvillkor"
            },
            {
              "id": "informationssida",
              "text": "Informationssida"
            },
            {
              "id": "navigeringssida",
              "text": "Navigeringssida"
            },
            {
              "id": "funktionssida",
              "text": "Funktionssida"
            },
            {
              "id": "formular-allmannt",
              "text": "Formulär (allmänt)"
            },
            {
              "id": "kontakt",
              "text": "Kontakt"
            },
            {
              "id": "inloggningssida",
              "text": "Inloggningssida"
            },
            {
              "id": "sokresultatsida",
              "text": "Sökresultatsida"
            },
            {
              "id": "tabellsida",
              "text": "Tabellsida"
            },
            {
              "id": "dokument-for-nedladdning",
              "text": "Dokument för nedladdning"
            },
            {
              "id": "media-ljud",
              "text": "Media (endast ljud)"
            },
            {
              "id": "media-video",
              "text": "Media (video)"
            },
            {
              "id": "sida-med-karta",
              "text": "Sida med karta"
            }
          ]
        },
        {
          "id": "aterkommande-innehall",
          "text": "Återkommande innehåll",
          "hasUrl": false,
          "categories": [
            {
              "id": "sidhuvud",
              "text": "Sidhuvud"
            },
            {
              "id": "meny",
              "text": "Meny"
            },
            {
              "id": "sidfot",
              "text": "Sidfot"
            },
            {
              "id": "sokfunktion",
              "text": "Sökfunktion"
            },
            {
              "id": "brodsmulor",
              "text": "Brödsmulor"
            },
            {
              "id": "sprakval",
              "text": "Språkval"
            },
            {
              "id": "kontakt-hjalp",
              "text": "Kontakt-/hjälpfunktion"
            },
            {
              "id": "snabbatkomst",
              "text": "Snabbåtkomst/skip links"
            },
            {
              "id": "topp-bottenknappar",
              "text": "Sidans topp-/bottenknappar"
            },
            {
              "id": "cookie-banner",
              "text": "Cookie-/integritetsbanner"
            },
            {
              "id": "sociala-medier",
              "text": "Sociala medielänkar"
            },
            {
              "id": "annat-aterkommande-innehall",
              "text": "Annat återkommande innehåll"
            }
          ]
        }
      ],
      "sampleTypes": [
        "Återkommande innehåll",
        "Startsida",
        "Produktinformation",
        "Sökresultat",
        "Om oss",
        "Köp-process",
        "Kundinformation och köpvillkor",
        "Informationssida",
        "Navigeringssida",
        "Funktionssida",
        "formulär allmännt",
        "Kontakt",
        "Inloggningssida",
        "Sökresultatsida",
        "Tabellsida",
        "Dokument för nedladdning",
        "Media (endast ljud)",
        "Media (video)",
        "Sida med karta"
      ]
    },
    "taxonomies": [
      {
        "id": "wcag22-pour",
        "label": "WCAG 2.2 – Principer (POUR)",
        "version": "2.2",
        "uri": "https://www.w3.org/TR/WCAG22/",
        "concepts": [
          {
            "id": "perceivable",
            "label": "Möjligt att uppfatta"
          },
          {
            "id": "operable",
            "label": "Hanterbart"
          },
          {
            "id": "understandable",
            "label": "Begripligt"
          },
          {
            "id": "robust",
            "label": "Robust"
          }
        ]
      }
    ],
    "pageTypes": [
      "Webbsida",
      "Återkommande innehåll"
    ]
  },
  "requirements": {
    "krav_farganvandning": {
      "id": "krav_farganvandning",
      "key": "krav_farganvandning",
      "title": "Användning av färg generellt",
      "metadata": {
        "mainCategory": {
          "text": "Innehåll",
          "key": "innehall"
        },
        "subCategory": "",
        "impact": {
          "isCritical": false,
          "primaryScore": 3,
          "secondaryScore": 1,
          "assumedCompliance": false
        }
      },
      "standardReference": {
        "text": "9.1.4.1 Use of Color",
        "url": "https://www.w3.org/WAI/WCAG22/quickref/#use-of-color"
      },
      "exceptions": "Inaktiva komponenter kan indikeras enbart med färg, t.ex. en inaktiv knapp som bara får en ljusare färg jämfört med andra knappar (även om det är dåligt).",
      "examples": "Status som indikerar pågående eller avslutad aktivitet.\nEn varning som bara indikeras med gul bakgrundsfärg. \nStatusbanner: \"Våra tjänster är avstängda idag mellan kl...\"\nVMA-banner som informerar om en brand som påverkar allmänheten.",
      "tips": "",
      "commonErrors": "",
      "expectedObservation": "Färg används inte som det enda visuella sättet att särskilja ett visuellt element.",
      "instructions": "Leta efter visuella sätt att förmedla information, status, tillstånd, indikera åtgärd eller särskilja element. Om detta indikeras med färg, ska det finnas ytterligare ett sätt att förmedla informationen på.",
      "checks": [
        {
          "id": "1",
          "condition": "Det finns innehåll som är informationsbärande, och som indikeras med färg.",
          "logic": "AND",
          "passCriteria": [
            {
              "id": "1.1",
              "requirement": "Färg används inte som det enda visuella sättet att särskilja ett visuellt element.",
              "failureStatementTemplate": "Färg används som det enda visuella sättet att särskilja ett visuellt element. [ange var och hur det brister]"
            }
          ],
          "ifNo": []
        }
      ],
      "contentType": [
        "navigering-navigeringsmenyer",
        "teknisk-grundstruktur-roller-och-egenskaper-i-koden",
        "text-och-struktur-landmarken"
      ],
      "classifications": [
        {
          "taxonomyId": "wcag22-pour",
          "conceptId": "perceivable"
        }
      ]
    },
    "krav_synlig_fokusmarkering": {
      "id": "krav_synlig_fokusmarkering",
      "key": "krav_synlig_fokusmarkering",
      "title": "Synlig fokusmarkering",
      "metadata": {
        "mainCategory": {
          "text": "Tangentbord",
          "key": "tangentbord"
        },
        "subCategory": {
          "text": "Fokus",
          "key": "fokus"
        },
        "impact": {
          "isCritical": false,
          "primaryScore": 4,
          "secondaryScore": 1,
          "assumedCompliance": false
        }
      },
      "standardReference": {
        "text": "9.2.4.7 Focus Visible",
        "url": "https://www.w3.org/WAI/WCAG22/quickref/#focus-visible"
      },
      "exceptions": "",
      "examples": "En länk får tangentbordsfokus och har då en synlig ram runt sig som indikerar fokus.",
      "tips": "",
      "commonErrors": "Komponenten är skräddarsydd och inte ett standardelement och saknar automatisk fokusmarkering.",
      "expectedObservation": "Alla fokuserbara element har en synlig fokusmarkering. Denna fokusmarkering ska heller inte försvinna efter en viss tid. Har den uppstått, ska den finnas där tills användaren lämnar elementet.",
      "instructions": "Navigera genom alla fokuserbara element på sidan med tangentbordet. \nAktivera (med tangentbordet) eventuella funktioner som öppnar en meny, dialogruta eller liknande.",
      "checks": [
        {
          "id": "1",
          "condition": "Det finns fokuserbara element på sidan",
          "logic": "AND",
          "passCriteria": [
            {
              "id": "1.1",
              "requirement": "Alla fokuserbara element har en synlig fokusmarkering.",
              "failureStatementTemplate": "Någon eller några fokuserbara element har inte en synlig fokusmarkering.. [ange var och hur det brister]"
            },
            {
              "id": "1.2",
              "requirement": "Fokusmarkeringen försvinner inte förrän fokus lämnar elementet.",
              "failureStatementTemplate": "Fokusmarkeringen försvinner medan elementet fortfarande har fokus. [ange var och hur det brister]"
            }
          ],
          "ifNo": []
        }
      ],
      "contentType": [
        "formular-inmatningsfalt",
        "formular-knappar",
        "interaktiva-komponenter-komplexa-interaktiva-komponenter",
        "mediespelare-mediespelare-for-ljud",
        "mediespelare-mediespelare-for-video",
        "navigering-lankar",
        "navigering-navigeringsmenyer",
        "text-och-struktur-tabeller",
        "interaktiva-komponenter-dialoger-och-modaler",
        "interaktiva-komponenter-tabellkomponenter-med-interaktion"
      ],
      "classifications": [
        {
          "taxonomyId": "wcag22-pour",
          "conceptId": "operable"
        }
      ]
    },
    "krav_utoka_textavstand": {
      "id": "krav_utoka_textavstand",
      "key": "krav_utoka_textavstand",
      "title": "Textavstånd",
      "metadata": {
        "mainCategory": {
          "text": "Layout",
          "key": "layout"
        },
        "subCategory": "",
        "impact": {
          "isCritical": false,
          "primaryScore": 2,
          "secondaryScore": 0,
          "assumedCompliance": false
        }
      },
      "standardReference": {
        "text": "9.1.4.12 Text Spacing",
        "url": "https://www.w3.org/WAI/WCAG22/quickref/#text-spacing"
      },
      "exceptions": "Innehåll på språk eller skriftsystem där något av textavstånden inte är tillämpligt. Att ändra ordmellanrum förväntas exempelvis inte ha någon effekt på japansk text, som inte har ”ord” på samma sätt som till exempel svenska.\nInbrända undertexter i filmer (\"open captions\").\nBilder av text.",
      "examples": "",
      "tips": "",
      "commonErrors": "",
      "expectedObservation": "Styckemellanrummet går att öka till minst 2 gånger graden.\nRadavståndet går att öka till minst 1,5 gånger graden.\nOrdmellanrummet går att öka till minst 0,16 gånger graden.\nTeckenavståndet går att öka till minst 0,12 gånger graden.\nInget innehåll försvinner (klipps av) vid utökade textavstånd.\nInget innehåll överlappar eller skymmer annat innehåll vid utökade textavstånd.",
      "instructions": "Använd bookmarklet för att kontrollera att inget innehåll försvinner eller överlappar annat innehåll vid ökat textavstånd.",
      "checks": [
        {
          "id": "1",
          "condition": "Sidan innehåller text.",
          "logic": "AND",
          "passCriteria": [
            {
              "id": "1.1",
              "requirement": "Styckemellanrummet går att öka till minst 2 gånger graden.",
              "failureStatementTemplate": "Styckemellanrummet går inte att öka till minst 2 gånger graden. [ange var och hur det brister]"
            },
            {
              "id": "1.2",
              "requirement": "Radavståndet går att öka till minst 1,5 gånger graden.",
              "failureStatementTemplate": "Radavståndet går inte att öka till minst 1,5 gånger graden. [ange var och hur det brister]"
            },
            {
              "id": "1.3",
              "requirement": "Ordmellanrummet går att öka till minst 0,16 gånger graden.",
              "failureStatementTemplate": "Ordmellanrummet går inte att öka till minst 0,16 gånger graden. [ange var och hur det brister]"
            },
            {
              "id": "1.4",
              "requirement": "Teckenavståndet går att öka till minst 0,12 gånger graden.",
              "failureStatementTemplate": "Teckenavståndet går inte att öka till minst 0,12 gånger graden. [ange var och hur det brister]"
            },
            {
              "id": "1.5",
              "requirement": "Inget innehåll försvinner (klipps av) vid utökade textavstånd.",
              "failureStatementTemplate": "Ett eller flera innehåll försvinner (klipps av) vid utökade textavstånd. [ange var och hur det brister]"
            },
            {
              "id": "1.6",
              "requirement": "Inget innehåll överlappar eller skymmer annat innehåll vid utökade textavstånd.",
              "failureStatementTemplate": "Ett eller flera innehåll överlappar eller skymmer annat innehåll vid utökade textavstånd. [ange var och hur det brister]"
            }
          ],
          "ifNo": []
        }
      ],
      "contentType": [
        "formular-inmatningsfalt",
        "formular-knappar",
        "interaktiva-komponenter-komplexa-interaktiva-komponenter",
        "mediespelare-mediespelare-for-ljud",
        "mediespelare-mediespelare-for-video",
        "navigering-lankar",
        "text-och-struktur-listor",
        "text-och-struktur-rubriker",
        "text-och-struktur-tabeller",
        "text-och-struktur-text"
      ],
      "classifications": [
        {
          "taxonomyId": "wcag22-pour",
          "conceptId": "perceivable"
        }
      ]
    },
    "krav_forhindra_allvarliga_konsekvenser": {
      "id": "krav_forhindra_allvarliga_konsekvenser",
      "key": "krav_forhindra_allvarliga_konsekvenser",
      "title": "Förebyggande av fel (juridiskt, ekonomiskt, data)",
      "metadata": {
        "mainCategory": {
          "text": "Avvikande sidor",
          "key": "avvikande-sidor"
        },
        "subCategory": "",
        "impact": {
          "isCritical": false,
          "primaryScore": 3,
          "secondaryScore": 1,
          "assumedCompliance": false
        }
      },
      "standardReference": {
        "text": "9.3.3.4 Error Prevention (Legal, Financial, Data)",
        "url": "https://www.w3.org/WAI/WCAG22/quickref/#error-prevention-legal-financial-data"
      },
      "exceptions": "",
      "examples": "Exempel på hur de kan förekomma:\n- dialogruta för att bekräfta borttagning av konto.\n- summeringar efter ifylld information i formulär innan data skickas iväg (förhandsgranskning).\n\nExempel på var det kan förekomma:\n- Webbsida för att skrivas under avtal eller godkänna villkor, ex. en sida där användaren godkänner ett avtal digitalt. \n- Webbsida för köp eller överföring av pengar, ex. kassasidan i en e-handel.\n- Webbsida som ändrar eller raderar data användaren styr över, ex. inställningssida där man tar bort kontot.\n- Webbsida där användaren skickar in test- eller provsvar, ex. en inlämningsportal för kursuppgifter.",
      "tips": "",
      "commonErrors": "",
      "expectedObservation": "Säkerställ att minst ett av följande gäller för åtgärder med juridiska eller finansiella konsekvenser, eller som ändrar/raderar användardata:\n- Ångra: Användaren ska kunna ångra sig.\n- Kontroll: Användarens inmatade data kontrolleras för fel, och användaren får möjlighet att rätta till dem. \n- Bekräftelse: Det finns ett sätt för användaren att granska, bekräfta och rätta informationen innan inlämningen slutförs.",
      "instructions": "Där en användare kan göra följande: juridiska åtaganden, ekonomiska transaktioner, skicka in testsvar eller ändra/radera användarkontrollerad data i lagringssystem: \nKontrollera att det går att antingen \n- ångra åtgärd, \n- granska, bekräfta och ändra information innan den skickas in.",
      "checks": [
        {
          "id": "1",
          "condition": "Sidan har åtgärder som rör juridiska eller finansiella konsekvenser, eller som ändrar/raderar användardata",
          "logic": "OR",
          "passCriteria": [
            {
              "id": "1.1",
              "requirement": "Åtgärden går att avbryta eller ångra.",
              "failureStatementTemplate": "Åtgärden går inte att avbryta eller ångra. [ange var och hur det brister]"
            },
            {
              "id": "1.2",
              "requirement": "Användaren ges möjlighet att rätta upptäckta inmatningsfel.",
              "failureStatementTemplate": "Användaren saknar möjlighet att rätta upptäckta inmatningsfel. [ange var och hur det brister]"
            },
            {
              "id": "1.3",
              "requirement": "Användaren får förhandsgranska och bekräfta inmatade uppgifter innan åtgärden slutförs.",
              "failureStatementTemplate": "Användaren får förhandsgranska och bekräfta inmatade uppgifter innan åtgärden slutförs gäller inte. [ange var och hur det brister]"
            }
          ],
          "ifNo": []
        }
      ],
      "contentType": [
        "formular-formular-helhet",
        "formular-inmatningsfalt",
        "formular-knappar",
        "interaktiva-komponenter-komplexa-interaktiva-komponenter",
        "navigering-lankar",
        "interaktiva-komponenter-dialoger-och-modaler"
      ],
      "classifications": [
        {
          "taxonomyId": "wcag22-pour",
          "conceptId": "understandable"
        }
      ]
    },
    "krav_rubriker": {
      "id": "krav_rubriker",
      "key": "krav_rubriker",
      "title": "Information och relationer för rubriker",
      "metadata": {
        "mainCategory": {
          "text": "Innehåll",
          "key": "innehall"
        },
        "subCategory": {
          "text": "Semantik",
          "key": "semantik"
        },
        "impact": {
          "isCritical": true,
          "primaryScore": 1,
          "secondaryScore": 2,
          "assumedCompliance": false
        }
      },
      "standardReference": {
        "text": "9.1.3.1 Info and Relationships",
        "url": "https://www.w3.org/WAI/WCAG22/quickref/#info-and-relationships"
      },
      "exceptions": "",
      "examples": "Alla rubriker på sidan som ser ut som rubriker är korrekt markerade med <h1>–<h6> i rätt ordning i HTML-koden.",
      "tips": "Om du är osäker på om något är en rubrik: utgå ifrån om det hjälper användaren att förstå sidans struktur eller hitta information.\nAnvänd HeadingsMap eller Axe för att snabbt få en överblick av sidans rubrikstruktur.",
      "commonErrors": "- Visuella rubriker utan motsvarande h1–h6 i koden.\n- Hoppar över rubriknivåer, t.ex. h1 direkt till h3.\n- Flera rubriker i följd utan innehåll mellan.\n- Använder rubriktaggar enbart för utseende, inte struktur.",
      "expectedObservation": "Allt som är visuellt formgivet som en rubrik är uppmärkt med`<h1>`…`<h6>`. \nAlla rubriker med nivå 2 eller lägre är innehållsmässigt underordnade närmaste rubrik med högre nivå.\nInga rubriknivåer är utelämnade.\nDet finns innehåll mellan en rubrik och nästa på samma eller högre nivå.",
      "instructions": "Leta efter innehåll som visuellt ser ut som rubriker.\nLeta efter innehåll som är uppmärkt som rubriker med h-element.\n \nAnvänd något av dessa verktyg för att identifiera rubriker i koden: \n- web developer toolbar \n- Headingsmap \n- Bookmarklet\n- Axe\n- Wave\n\nAtt hitta ouppmärkta rubriker går bara att göra visuellt genom att titta på sidan och själv bedöma vad som borde vara en rubrik. \nSe över strukturen för de uppmärkta rubrikerna så att ingen rubriknivå hoppas över.",
      "checks": [
        {
          "id": "1",
          "condition": "Det finns rubriker på sidan",
          "logic": "AND",
          "passCriteria": [
            {
              "id": "1.1",
              "requirement": "Allt som är visuellt formgivet som en rubrik är uppmärkt med <h1>…<h6>.",
              "failureStatementTemplate": "Allt som är inte visuellt formgivet som en rubrik är uppmärkt med <h1>…<h6>. [ange var och hur det brister]"
            },
            {
              "id": "1.2",
              "requirement": "Alla rubriker med nivå 2 eller lägre är innehållsmässigt underordnade närmaste rubrik med högre nivå.",
              "failureStatementTemplate": "Någon eller några rubriker med nivå 2 eller lägre är innehållsmässigt underordnade närmaste rubrik med högre nivå.. [ange var och hur det brister]"
            },
            {
              "id": "1.3",
              "requirement": "Rubrikerna kommer i hierarkisk ordning.",
              "failureStatementTemplate": "Rubrikerna förekommer i icke‑hierarkisk ordning. [ange var och hur det brister]"
            },
            {
              "id": "1.4",
              "requirement": "Det finns innehåll mellan en rubrik och nästa rubrik på samma eller högre nivå.",
              "failureStatementTemplate": "Innehåll mellan en rubrik och nästa rubrik på samma eller högre nivå saknas. [ange var och hur det brister]"
            }
          ],
          "ifNo": []
        }
      ],
      "contentType": [
        "teknisk-grundstruktur-roller-och-egenskaper-i-koden",
        "text-och-struktur-landmarken",
        "text-och-struktur-rubriker"
      ],
      "classifications": [
        {
          "taxonomyId": "wcag22-pour",
          "conceptId": "perceivable"
        }
      ]
    },
    "krav_sensoriska_hanvisningar": {
      "id": "krav_sensoriska_hanvisningar",
      "key": "krav_sensoriska_hanvisningar",
      "title": "Sensoriska hänvisningar",
      "metadata": {
        "mainCategory": {
          "text": "Innehåll",
          "key": "innehall"
        },
        "subCategory": {
          "text": "Text",
          "key": "text"
        },
        "impact": {
          "isCritical": false,
          "primaryScore": 5,
          "secondaryScore": 1,
          "assumedCompliance": false
        }
      },
      "standardReference": {
        "text": "9.1.3.3 Sensory Characteristics",
        "url": "https://www.w3.org/WAI/WCAG22/quickref/#sensory-characteristics"
      },
      "exceptions": "",
      "examples": "",
      "tips": "",
      "commonErrors": "",
      "expectedObservation": "Om det finns hänvisning till sensoriska kännetecken, ska det finnas minst ett ytterligare sätt att kunna identifiera innehållet. Exempelvis information i text eller uppmärkning i kod.\nInstruktioner hänvisar inte*enbart*till komponenters sensoriska kännetecken såsom färg, storlek, placering, orientering eller ljud.",
      "instructions": "Titta igenom innehållet på sidan och se om det finns några hänvisningar som enbart rör sensoriska kännetecken.",
      "checks": [
        {
          "id": "1",
          "condition": "Det finns instruktioner eller hänvisningar på sidan som behövs för att förstå eller hantera innehållet.",
          "logic": "AND",
          "passCriteria": [
            {
              "id": "1.1",
              "requirement": "Instruktioner hänvisar inte*enbart*till komponenters sensoriska kännetecken (såsom färg, storlek, placering, orientering eller ljud).",
              "failureStatementTemplate": "Instruktioner hänvisar inte*enbart*till komponenters sensoriska kännetecken (såsom färg, storlek, placering, orientering eller ljud) gäller inte. [ange var och hur det brister]"
            }
          ],
          "ifNo": []
        }
      ],
      "contentType": [
        "text-och-struktur-text"
      ],
      "classifications": [
        {
          "taxonomyId": "wcag22-pour",
          "conceptId": "perceivable"
        }
      ]
    },
    "krav_flera_satt_att_hitta_sidan": {
      "id": "krav_flera_satt_att_hitta_sidan",
      "key": "krav_flera_satt_att_hitta_sidan",
      "title": "Flera sätt att navigera",
      "metadata": {
        "mainCategory": {
          "text": "Generella krav",
          "key": "generella-krav"
        },
        "subCategory": "",
        "impact": {
          "isCritical": false,
          "primaryScore": 4,
          "secondaryScore": 1,
          "assumedCompliance": false
        }
      },
      "standardReference": {
        "text": "9.2.4.5 Multiple Ways",
        "url": "https://www.w3.org/WAI/WCAG22/quickref/#multiple-ways"
      },
      "exceptions": "Sidor som utgör steg i eller resultat av en process. \nExempel: En betalningsprocess där de olika stegen kräver viss information eller interaktion från de tidigare stegen för att kunna fortsätta.\nSökresultat är undantag för att det anses vara del i en process.",
      "examples": "Det finns en meny med länkar till webbplatsens sidor. Det finns också en sökfunktion där användaren kan söka efter en webbsida inom webbplatsen.",
      "tips": "",
      "commonErrors": "",
      "expectedObservation": "Det finns fler än ett sätt att hitta en webbsida på en webbplats. \n\nMinst två av följande sätt skulle kunna användas:\n- Navigationsmeny - sidan finns länkad i en meny.\n- Sökfunktion - det går att hitta sidan via en fungerande sökfunktion.\n- Filtreringsfunktion – det går att hitta sidan genom att använda filtrerings- eller urvalsfunktioner som begränsar visningen av innehåll utifrån valda kriterier.\n- Index- eller A-Ö-lista - det finns en alfabetisk eller kategoribaserad lista där sidan är upptagen/aktiv.\n- Länkar från relaterat innehåll - sidan finns länkad från andra sidor med relevant innehåll.\n- Webbplatskarta - sidan är listad i en sitemap.",
      "instructions": "Om du granskar återkommande innehåll, så kan du godkänna det här kravet.\nSökresultat är undantag för att det anses vara del i en process.\n\n1. Öppna en ny flik.\n2. Gå till valfri sida på webbplatsen.\n3. Ta reda på hur många sätt du kan navigera till och hitta sidan du håller på att granska.",
      "checks": [
        {
          "id": "1",
          "condition": "Webbplatsen har flera sidor.",
          "logic": "OR",
          "passCriteria": [
            {
              "id": "1.1",
              "requirement": "Det finns mer än ett sätt att hitta sidan på webbplatsen",
              "failureStatementTemplate": "Mer än ett sätt att hitta sidan på webbplatsen saknas. [ange var och hur det brister]"
            },
            {
              "id": "1.2",
              "requirement": "Sidan utgör ett steg i eller är ett resultat av en process.",
              "failureStatementTemplate": "Sidan varken utgör ett steg i eller är ett resultat av en process. [ange var och hur det brister]"
            }
          ],
          "ifNo": []
        }
      ],
      "contentType": [
        "navigering-navigeringsmenyer"
      ],
      "classifications": [
        {
          "taxonomyId": "wcag22-pour",
          "conceptId": "operable"
        }
      ]
    },
    "krav_konsekvent_navigering": {
      "id": "krav_konsekvent_navigering",
      "key": "krav_konsekvent_navigering",
      "title": "Konsekvent navigering",
      "metadata": {
        "mainCategory": {
          "text": "Generella krav",
          "key": "generella-krav"
        },
        "subCategory": "",
        "impact": {
          "isCritical": false,
          "primaryScore": 3,
          "secondaryScore": 0,
          "assumedCompliance": false
        }
      },
      "standardReference": {
        "text": "9.3.2.3 Consistent Navigation",
        "url": "https://www.w3.org/WAI/WCAG22/quickref/#consistent-navigation"
      },
      "exceptions": "Om användaren själv kan påverka navigeringsfunktionernas ordning är det godkänt att den förändras.",
      "examples": "Huvudmenyn ser likadan ut oberoende vilken del av webbplatsen användaren befinner sig på. \nLänkar inom varje navigeringsfunktion ska komma i samma inbördes ordning.",
      "tips": "",
      "commonErrors": "",
      "expectedObservation": "Det finns navigeringsfunktioner som förekommer på flera sidor på webbplatsen. \nNavigeringsfunktioner kommer i samma inbördes ordning på de sidor där de förkommer. \nLänkar etc. inom varje navigeringsfunktion kommer i samma inbördes ordning.",
      "instructions": "Jämför ordningen och placeringen av olika navigeringsfunktioner mellan sidorna som ingår i granskningsurvalet.",
      "checks": [
        {
          "id": "1",
          "condition": "Det finns navigeringsfunktioner som återkommer på flera sidor på webbplatsen.",
          "logic": "AND",
          "passCriteria": [
            {
              "id": "1.1",
              "requirement": "Navigeringsfunktioner kommer i samma inbördes ordning på de sidor där de förekommer.",
              "failureStatementTemplate": "Navigeringsfunktioner kommer i olika inbördes ordning på de sidor där de förekommer. [ange var och hur det brister]"
            },
            {
              "id": "1.2",
              "requirement": "Länkar etc. inom varje navigeringsfunktion kommer i samma inbördes ordning.",
              "failureStatementTemplate": "Länkar etc. inom varje navigeringsfunktion kommer i samma inbördes ordning gäller inte. [ange var och hur det brister]"
            }
          ],
          "ifNo": []
        }
      ],
      "contentType": [
        "interaktiva-komponenter-komplexa-interaktiva-komponenter",
        "navigering-lankar",
        "navigering-navigeringsmenyer",
        "text-och-struktur-listor",
        "interaktiva-komponenter-tabellkomponenter-med-interaktion"
      ],
      "classifications": [
        {
          "taxonomyId": "wcag22-pour",
          "conceptId": "understandable"
        }
      ]
    },
    "krav_semantik_html": {
      "id": "krav_semantik_html",
      "key": "krav_semantik_html",
      "title": "Information och relationer för roller",
      "metadata": {
        "mainCategory": {
          "text": "Innehåll",
          "key": "innehall"
        },
        "subCategory": {
          "text": "Semantik",
          "key": "semantik"
        },
        "impact": {
          "isCritical": true,
          "primaryScore": 1,
          "secondaryScore": 2,
          "assumedCompliance": false
        }
      },
      "standardReference": {
        "text": "9.1.3.1 Info and Relationships",
        "url": "https://www.w3.org/WAI/WCAG22/quickref/#info-and-relationships"
      },
      "exceptions": "",
      "examples": "Alla listor, rubriker och knappar på sidan är markerade med rätt HTML-element. Roller används endast när det inte finns något lämpligt semantiskt HTML-element.",
      "tips": "Använd alltid det mest specifika HTML-elementet som passar för innehållet, till exempel <nav> för navigation, <main> för huvudinnehåll.\nUndvik onödiga roll-attribut.\nLåt utvecklaren förklara varför roll-attribut används om det inte är uppenbart.",
      "commonErrors": "- Använder <div> eller <span> i stället för semantiska element som <button>, <ul>, <header> etc.\n- Lägger till roll-attribut på element som redan har den semantiken (t.ex. <button role=\"button\">).\n- Använder olämpliga taggar för att styra utseende, t.ex. <br>, <strong>, <b>, <i> utan semantisk betydelse.\n- Glömmer att ange roll-attribut på egna komponenter som inte har någon fördefinierad HTML-roll.",
      "expectedObservation": "När det finns ett passande HTML-element med en särskild betydelse ska det användas för att märka upp innehållet.\nHTML-koden ska beskriva innehållet (t.ex. en rubrik, en lista, en knapp), inte bara hur det ska se ut.",
      "instructions": "### Instruktion 1\n\nSidans HTML-struktur är uppbyggd av korrekta semantiska element eller blockelement med korrekta roller angivna med attributet \"role\".\nAnvänd PTS bookmarklet för att identifiera vilka element som har ett roll-attribut.\nKontrollera därefter att rollen används på ett korrekt sätt.\n\n### Instruktion 2\n\nKontrollera i HTML-koden att olämpliga taggar som tex: <br> och <strong> inte används för att styra utseendet på element på sidan.\nAnvänd PTS bookmarklet för att identifiera olämpliga taggar.",
      "checks": [
        {
          "id": "1",
          "condition": "HTML används på ett sätt som tydligt återspeglar innehållets struktur och funktion.",
          "logic": "AND",
          "passCriteria": [
            {
              "id": "1.1",
              "requirement": "Innehållets olika delar är markerade utifrån sin betydelse och roll på sidan.",
              "failureStatementTemplate": "Innehållets olika delar är inte markerade utifrån sin betydelse och roll på sidan. [ange var och hur det brister]"
            },
            {
              "id": "1.2",
              "requirement": "Sidan använder inte HTML-element som bara styr visuell presentation: <b>, <i>, <u>,<font>, <center>, <big>, <small>,<br>",
              "failureStatementTemplate": "Sidan använder inte HTML-element som bara styr visuell presentation: <b>, <i>, <u>,<font>, <center>, <big>, <small>,<br> gäller inte. [ange var och hur det brister]"
            }
          ],
          "ifNo": []
        }
      ],
      "contentType": [
        "teknisk-grundstruktur-roller-och-egenskaper-i-koden",
        "text-och-struktur-landmarken",
        "text-och-struktur-rubriker"
      ],
      "classifications": [
        {
          "taxonomyId": "wcag22-pour",
          "conceptId": "perceivable"
        }
      ]
    },
    "krav_syfte_for_inmatningsfalt": {
      "id": "krav_syfte_for_inmatningsfalt",
      "key": "krav_syfte_for_inmatningsfalt",
      "title": "Identifiera syfte med inmatningsfält",
      "metadata": {
        "mainCategory": {
          "text": "Användargränssnitt",
          "key": "anvandargranssnitt"
        },
        "subCategory": {
          "text": "Interaktiva komponenter",
          "key": "interaktiva-komponenter"
        },
        "impact": {
          "isCritical": false,
          "primaryScore": 1,
          "secondaryScore": 0,
          "assumedCompliance": false
        }
      },
      "standardReference": {
        "text": "9.1.3.5 Identify Input Purpose",
        "url": "https://www.w3.org/WAI/WCAG22/quickref/#identify-input-purpose"
      },
      "exceptions": "",
      "examples": "- Fältet för e-postadress har attributet autocomplete=\"email\".\n- Fältet för telefonnummer har attributet autocomplete=\"tel\".\n- Fältet för användarens förnamn har attributet autocomplete=\"given-name\".",
      "tips": "Kontrollera gärna att webbläsaren föreslår automatiskt ifyllnad i fält för personuppgifter.",
      "commonErrors": "Personliga fält saknar autocomplete-attribut, eller använder fel värde.",
      "expectedObservation": "Inmatningsfält som inhämtar information om användaren ska ha ett autocomplete-värde som motsvarar den typen av information som efterfrågas.",
      "instructions": "Hitta alla fält där du ska ange personlig information om användaren. \nFör varje fält ska användaren kunna få information som denna har fyllt i tidigare automatiskt ifyllt igen, t.ex. genom autocomplete.",
      "checks": [
        {
          "id": "1",
          "condition": "Sidan använder HTML 5 och innehåller inmatningsfält som inhämtar information om användaren.",
          "logic": "AND",
          "passCriteria": [
            {
              "id": "1.1",
              "requirement": "Inmatningsfält som inhämtar information om användaren har ett autocomplete-värde som motsvarar den typen av information som efterfrågas.",
              "failureStatementTemplate": "Inmatningsfält som inhämtar information om användaren saknar ett autocomplete-värde som motsvarar den typen av information som efterfrågas. [ange var och hur det brister]"
            }
          ],
          "ifNo": []
        }
      ],
      "contentType": [
        "formular-inmatningsfalt"
      ],
      "classifications": [
        {
          "taxonomyId": "wcag22-pour",
          "conceptId": "perceivable"
        }
      ]
    },
    "krav_automatisk_omladdning": {
      "id": "krav_automatisk_omladdning",
      "key": "krav_automatisk_omladdning",
      "title": "Automatisk omladdning",
      "metadata": {
        "mainCategory": {
          "text": "Innehåll",
          "key": "innehall"
        },
        "subCategory": "",
        "impact": {
          "isCritical": false,
          "primaryScore": 6,
          "secondaryScore": 0,
          "assumedCompliance": false
        }
      },
      "standardReference": {
        "text": "9.2.2.1 Timing Adjustable",
        "url": "https://www.w3.org/WAI/WCAG22/quickref/#timing-adjustable"
      },
      "exceptions": "",
      "examples": "",
      "tips": "",
      "commonErrors": "",
      "expectedObservation": "Sidan uppdateras inte automatiskt efter en stund.\nDu skickas inte automatiskt vidare till en annan sida efter en stund.\nOm sidan ändå uppdateras automatiskt eller om man skickas vidare så blir man förvarnad i minst 20 sekunder innan detta sker så man kan välja att undvika att sidan laddas om och får möjligheten att stänga av dessa uppdateringar. Man ska även få möjlighet att förlänga tiden innan man skickas vidare.",
      "instructions": "Kontakta aktören och ta reda på om det förekommer tillfällen där något innehåll laddas om automatiskt efter en viss tid.\nOm automatiska omladdningar förekommer, ta reda på vilket innehåll/vilka sidor och när och hur ofta dessa automatiska omladdningar sker.",
      "checks": [
        {
          "id": "1",
          "condition": "Hela sidan eller endast delar av innehållet på sidan laddas om automatiskt efter en viss tid.",
          "logic": "AND",
          "passCriteria": [
            {
              "id": "1.1",
              "requirement": "Sidan laddar inte om automatiskt efter en viss tid.",
              "failureStatementTemplate": "Sidan laddar om automatiskt efter en viss tid. [ange var och hur det brister]"
            },
            {
              "id": "1.2",
              "requirement": "Sidan omdirigeras inte automatiskt med fördröjning.",
              "failureStatementTemplate": "Sidan omdirigeras automatiskt med fördröjning. [ange var och hur det brister]"
            }
          ],
          "ifNo": []
        }
      ],
      "contentType": [
        "dynamiskt-innehall-uppdaterande-innehall",
        "interaktiva-komponenter-komplexa-interaktiva-komponenter",
        "interaktiva-komponenter-tabellkomponenter-med-interaktion"
      ],
      "classifications": [
        {
          "taxonomyId": "wcag22-pour",
          "conceptId": "operable"
        }
      ]
    },
    "krav_sprakandringar": {
      "id": "krav_sprakandringar",
      "key": "krav_sprakandringar",
      "title": "Språkförändringar",
      "metadata": {
        "mainCategory": {
          "text": "Innehåll",
          "key": "innehall"
        },
        "subCategory": {
          "text": "Text",
          "key": "text"
        },
        "impact": {
          "isCritical": false,
          "primaryScore": 1,
          "secondaryScore": 4,
          "assumedCompliance": false
        }
      },
      "standardReference": {
        "text": "9.3.1.2 Language of Parts",
        "url": "https://www.w3.org/WAI/WCAG22/quickref/#language-of-parts"
      },
      "exceptions": "egennamn\ntekniska termer\nord på obestämt språk (kan ha lang=\"\")\nlånord och fraser som tagits upp i den omgivande textens språk.",
      "examples": "En engelsk text på en svensk sida är uppmärkt med attributet lang=\"en\".",
      "tips": "",
      "commonErrors": "Det finns texter på annat språk än huvudinnehållet som inte är uppmärkta med rätt språk i koden.",
      "expectedObservation": "Det finns ord, fraser eller andra innehållsdelar med ett annat språk än omgivande text.\nAlla språkändringar är maskinläsbart angivna.\nSpråkkoderna är giltiga.\nSpråkkoden matchar det uppmärkta innehållets språk.\nInnehåll med annat språk än huvudinnehållet på sidan är uppmärkt med det aktuella språket i koden.",
      "instructions": "Leta efter innehållsdelar som har annat språk än huvudinnehållet på sidan.\nInspektera koden för innehållsdelarna som inte har det huvudsakliga språket på sidan.",
      "checks": [
        {
          "id": "1",
          "condition": "Det finns ord, fraser eller andra innehållsdelar med ett annat språk än omgivande text.",
          "logic": "AND",
          "passCriteria": [
            {
              "id": "1.1",
              "requirement": "Alla språkändringar är maskinläsbart angivna.",
              "failureStatementTemplate": "Någon eller några språkändringar är maskinläsbart angivna.. [ange var och hur det brister]"
            },
            {
              "id": "1.2",
              "requirement": "Språkkoderna är giltiga.",
              "failureStatementTemplate": "Språkkoderna är inte giltiga. [ange var och hur det brister]"
            },
            {
              "id": "1.3",
              "requirement": "Språkkoden matchar det uppmärkta innehållets språk.",
              "failureStatementTemplate": "Språkkoden matchar det uppmärkta innehållets språk gäller inte. [ange var och hur det brister]"
            }
          ],
          "ifNo": []
        }
      ],
      "contentType": [
        "formular-knappar",
        "interaktiva-komponenter-komplexa-interaktiva-komponenter",
        "mediespelare-mediespelare-for-ljud",
        "mediespelare-mediespelare-for-video",
        "navigering-lankar",
        "sarskilda-hinder-captcha",
        "text-och-struktur-listor",
        "text-och-struktur-rubriker",
        "text-och-struktur-tabeller",
        "text-och-struktur-text",
        "sprak-sprak-i-delar-av-sidan"
      ],
      "classifications": [
        {
          "taxonomyId": "wcag22-pour",
          "conceptId": "understandable"
        }
      ]
    },
    "krav_kontextforandring_vid_fokus": {
      "id": "krav_kontextforandring_vid_fokus",
      "key": "krav_kontextforandring_vid_fokus",
      "title": "Kontextförändring vid fokus",
      "metadata": {
        "mainCategory": {
          "text": "Tangentbord",
          "key": "tangentbord"
        },
        "subCategory": {
          "text": "Fokus",
          "key": "fokus"
        },
        "impact": {
          "isCritical": false,
          "primaryScore": 4,
          "secondaryScore": 0,
          "assumedCompliance": false
        }
      },
      "standardReference": {
        "text": "9.3.2.1 On Focus",
        "url": "https://www.w3.org/WAI/WCAG22/quickref/#on-focus"
      },
      "exceptions": "Klickbara element som förväntas ändra kontext vid fokus med muspekare, som t.ex. länkar och knappar.",
      "examples": "Vid navigation med tangentbord till ett inputfält flyttas fokus till ett annat ställe på sidan.\n\nExempel på fokuserbara element som går att testa med muspekaren är ett inmatningsfält.",
      "tips": "",
      "commonErrors": "Select-listor (Väljare, utfällbara listor med flera val) som vid fokusering av ett val i listan gör en kontextförändring.",
      "expectedObservation": "Ingen kontextförändring inträffar till följd av att ett element får fokus.",
      "instructions": "1. Navigera genom alla fokuserbara element på sidan med tangentbordet.\n2. Sätt fokus genom att klicka med musen på fokuserbara element, utom sådana som förväntas ändra kontexten (till exempel länkar och knappar).",
      "checks": [
        {
          "id": "1",
          "condition": "Det finns fokuserbara element på sidan",
          "logic": "AND",
          "passCriteria": [
            {
              "id": "1.1",
              "requirement": "Ingen kontextförändring inträffar till följd av att ett element får tangentbordsfokus.",
              "failureStatementTemplate": "En eller flera kontextförändring inträffar till följd av att ett element får tangentbordsfokus. [ange var och hur det brister]"
            },
            {
              "id": "1.2",
              "requirement": "Ingen kontextförändring inträffar till följd av att ett element får fokus med muspekare.",
              "failureStatementTemplate": "En eller flera kontextförändring inträffar till följd av att ett element får fokus med muspekare. [ange var och hur det brister]"
            }
          ],
          "ifNo": []
        }
      ],
      "contentType": [
        "dynamiskt-innehall-rorliga-element",
        "dynamiskt-innehall-uppdaterande-innehall",
        "formular-inmatningsfalt",
        "formular-knappar",
        "interaktiva-komponenter-komplexa-interaktiva-komponenter",
        "ljud-och-video-animeringar-utan-ljud",
        "mediespelare-mediespelare-for-ljud",
        "mediespelare-mediespelare-for-video",
        "navigering-lankar",
        "navigering-navigeringsmenyer",
        "sarskilda-hinder-captcha",
        "text-och-struktur-tabeller",
        "interaktiva-komponenter-dialoger-och-modaler",
        "interaktiva-komponenter-tabellkomponenter-med-interaktion",
        "enhetsspecifikt-och-avancerat-rost-och-videokommunikation"
      ],
      "classifications": [
        {
          "taxonomyId": "wcag22-pour",
          "conceptId": "understandable"
        }
      ]
    },
    "krav_avbryta_klick": {
      "id": "krav_avbryta_klick",
      "key": "krav_avbryta_klick",
      "title": "Ångra klick",
      "metadata": {
        "mainCategory": {
          "text": "Generella krav",
          "key": "generella-krav"
        },
        "subCategory": "",
        "impact": {
          "isCritical": false,
          "primaryScore": 4,
          "secondaryScore": 0,
          "assumedCompliance": false
        }
      },
      "standardReference": {
        "text": "9.2.5.2 Pointer Cancellation",
        "url": "https://www.w3.org/WAI/WCAG22/quickref/#pointer-cancellation"
      },
      "exceptions": "",
      "examples": "Det går att trycka ner musknappen för att posta ett formulär, och sedan föra bort musen från knappen och släppa upp musknappen utan att formuläret postas.",
      "tips": "",
      "commonErrors": "",
      "expectedObservation": "Tjänsten tillhandahåller funktioner som utförs med ett finger eller en musknapp.\nIngen del av funktionen utförs när man trycker ned ett finger eller en musknapp.\nFunktionen slutförs när man släpper upp musknappen eller lyfter fingret och går att avbryta eller ångra.\nAtt lyfta fingret eller släppa upp musknappen innebär en återställning av den förändring som gjordes vid nedtryckning.\nDet är en förutsättning att funktionen utförs vid nedtryckning.",
      "instructions": "1. Tryck ned musknappen med pekaren över interaktiva element och flytta pekaren utanför elementet innan du släpper upp musknappen.\n2. Tryck ned fingret över interaktiva element och flytta fingret utanför elementet innan du släpper upp det.\n\n### För dra-och-släpp–funktioner\n\n1. Markera och börja dra element, men flytta tillbaka pekaren till startläget (eller utanför målzonen) innan du släpper upp knappen.\n2. Markera med fingret och börja dra element, men flytta tillbaka fingret till startläget (eller utanför målzonen) innan du släpper upp det.",
      "checks": [
        {
          "id": "1",
          "condition": "Det finns interaktiva element på sidan som kan styras med en pekare (musknapp, finger etc).",
          "logic": "OR",
          "passCriteria": [
            {
              "id": "1.1",
              "requirement": "Funktionen aktiveras inte när användaren trycker ner pekaren (musknappen, fingret etc).",
              "failureStatementTemplate": "Funktionen aktiveras inte när användaren trycker ner pekaren (musknappen, fingret etc) gäller inte. [ange var och hur det brister]"
            },
            {
              "id": "1.2",
              "requirement": "Funktionen slutförs vid uppsläpp av pekaren (musknappen, fingret etc) och kan avbrytas eller ångras.",
              "failureStatementTemplate": "Funktionen slutförs vid uppsläpp av pekaren (musknappen, fingret etc) och kan inte avbrytas eller ångras. [ange var och hur det brister]"
            },
            {
              "id": "1.3",
              "requirement": "Ett uppsläpp av pekaren (musknappen, fingret etc) återställer helt den handling som påbörjades vid nedtryckningen.",
              "failureStatementTemplate": "Ett uppsläpp av pekaren (musknappen, fingret etc) återställer helt den handling som påbörjades vid nedtryckningen gäller inte. [ange var och hur det brister]"
            },
            {
              "id": "1.4",
              "requirement": "Funktionen skulle inte fungera som tänkt om den reagerade först när pekaren (musknappen, fingret etc) släpps, eftersom syftet är att något ska hända direkt och pågå så länge man trycker ner pekaren (t.ex. när man ritar eller drar ett objekt).",
              "failureStatementTemplate": "Funktionen skulle inte fungera som tänkt om den reagerade först när pekaren (musknappen, fingret etc) släpps, eftersom syftet är inte att något ska hända direkt och pågå så länge man trycker ner pekaren (t.ex. när man ritar eller drar ett objekt). [ange var och hur det brister]"
            }
          ],
          "ifNo": []
        }
      ],
      "contentType": [
        "enhetsspecifikt-och-avancerat-touchfunktioner",
        "formular-inmatningsfalt",
        "formular-knappar",
        "interaktiva-komponenter-komplexa-interaktiva-komponenter",
        "mediespelare-mediespelare-for-ljud",
        "mediespelare-mediespelare-for-video",
        "navigering-lankar",
        "sarskilda-hinder-captcha",
        "text-och-struktur-tabeller",
        "interaktiva-komponenter-dialoger-och-modaler",
        "interaktiva-komponenter-tabellkomponenter-med-interaktion",
        "enhetsspecifikt-och-avancerat-rost-och-videokommunikation"
      ],
      "classifications": [
        {
          "taxonomyId": "wcag22-pour",
          "conceptId": "operable"
        }
      ]
    },
    "krav_rorelsestyrning": {
      "id": "krav_rorelsestyrning",
      "key": "krav_rorelsestyrning",
      "title": "Rörelsestyrning",
      "metadata": {
        "mainCategory": {
          "text": "Touchskärmar, mobila enheter och pekare",
          "key": "touchskarmar-mobila-enheter-och-pekare"
        },
        "subCategory": "",
        "impact": {
          "isCritical": false,
          "primaryScore": 2,
          "secondaryScore": 3,
          "assumedCompliance": false
        }
      },
      "standardReference": {
        "text": "9.2.5.4 Motion Actuation",
        "url": "https://www.w3.org/WAI/WCAG22/quickref/#motion-actuation"
      },
      "exceptions": "Rörelsen styr funktioner genom ett gränssnitt med stöd för hjälpmedel.\nRörelsen är nödvändig för funktionen, till exempel en stegräknare.",
      "examples": "Om det går att skaka en enhet så att den ångrar något, går funktionen att stänga av och det finns en knapp som har samma funktionalitet som rörelsestyrningen.",
      "tips": "",
      "commonErrors": "",
      "expectedObservation": "Funktionalitet som erbjuds genom rörelse måste också vara tillgänglig via en annan mekanism.\nAnvändaren måste ha möjlighet att stänga av rörelsestyrning för att förhindra oavsiktlig aktivering av funktioner.",
      "instructions": "Leta efter funktioner på sidan som styrs med rörelser. \nOm det finns någon, så ska följande krav uppfyllas:\n- Det ska gå att stänga av funktionen.\n- Det ska gå att utföra samma funktionalitet via en annan mekanism på sidan.",
      "checks": [
        {
          "id": "1",
          "condition": "Det finns rörelsestyrda funktioner på sidan",
          "logic": "AND",
          "passCriteria": [
            {
              "id": "1.1",
              "requirement": "Funktionaliteten som erbjuds genom rörelse finns också tillgänglig via en annan mekanism.",
              "failureStatementTemplate": "Funktionaliteten som erbjuds genom rörelse finns också tillgänglig via en annan mekanism gäller inte. [ange var och hur det brister]"
            },
            {
              "id": "1.2",
              "requirement": "Rörelsestyrningen går att stänga av.",
              "failureStatementTemplate": "Rörelsestyrningen går inte att stänga av. [ange var och hur det brister]"
            }
          ],
          "ifNo": []
        }
      ],
      "contentType": [
        "enhetsspecifikt-och-avancerat-touchfunktioner",
        "interaktiva-komponenter-komplexa-interaktiva-komponenter"
      ],
      "classifications": [
        {
          "taxonomyId": "wcag22-pour",
          "conceptId": "operable"
        }
      ]
    },
    "krav_konsekvent_benamning": {
      "id": "krav_konsekvent_benamning",
      "key": "krav_konsekvent_benamning",
      "title": "Konsekvent identifiering",
      "metadata": {
        "mainCategory": {
          "text": "Generella krav",
          "key": "generella-krav"
        },
        "subCategory": "",
        "impact": {
          "isCritical": false,
          "primaryScore": 2,
          "secondaryScore": 1,
          "assumedCompliance": false
        }
      },
      "standardReference": {
        "text": "9.3.2.4 Consistent Identification",
        "url": "https://www.w3.org/WAI/WCAG22/quickref/#consistent-identification"
      },
      "exceptions": "Komponenter som är konsekventa vad gäller identifiering i sitt sammanhang. Pagineringslänkar kan t.ex. vara konsekventa när de heter \"sida 2\" på flera ställen även om de laddar olika innehåll, länkarna är ändå konsekventa i sin betydelse.",
      "examples": "En skicka-knapp för ett formulär ska inte ha texten \"Skicka\" på en sida och \"Sänd\" på en annan sida.\nEn knapp som fäller ut innehåll på samma sätt överallt bör inte ha en pil som växlar läge på ett ställe och ett plustecken på ett annat ställen.",
      "tips": "Detta kriterium behöver kontrolleras över flera sidor för att kunna verifieras korrekt.\n\nVid ett stort antal sidor, välj ut ett representativt antal sidor för webbplatsen och kontrollera valda komponenter på dessa sidor.",
      "commonErrors": "",
      "expectedObservation": "Om det finns ikoner eller symboler i indikatorer, knappar eller länkar som förekommer på flera sidor på webbplatsen: \n- Varje ikon eller symbol har samma betydelse när sammanhanget är identiskt på alla sidor.\n- Varje ikon eller symbol har samma maskinläsbara namn när sammanhanget är identiskt på alla sidor.\n- Varje ikon eller symbol som är en bild har samma textalternativ när sammanhanget är identiskt på alla sidor.\n- Varje funktion etc. indikeras med samma ikon eller symbol på alla sidor.\n\nOm det finns länkar som förekommer på flera sidor på webbplatsen (med samma länktext eller URL):\n- Länkar med samma länktext leder till samma mål.\n- Länkar med samma mål har samma länktext.\n\nOm det finns knappar med text i, där knappen eller funktionen förekommer på flera sidor på webbplatsen:\n- Knappar med samma text utför samma funktion på alla sidor där de förekommer.\n- Knappar med samma funktion har samma text på alla sidor där de förekommer.\n\nOm det finns inmatningsfält, vallistor, kryssrutor, radiogrupper eller liknande som förekommer på flera sidor på webbplatsen: \n- Samma ledtext används för fält med samma syfte på alla sidor där det förekommer.",
      "instructions": "Leta upp alla interaktiva element och komponenter som förekommer på flera sidor. \nJämför hur elementen används och hur de namnges där de förekommer.",
      "checks": [
        {
          "id": "1",
          "condition": "Det finns länkar som förekommer på flera ställen eller sidor på webbplatsen. (med samma länktext eller URL)",
          "logic": "AND",
          "passCriteria": [
            {
              "id": "1.1",
              "requirement": "Länkar med samma länktext leder till samma mål.",
              "failureStatementTemplate": "Länkar med samma länktext leder till olika mål. [ange var och hur det brister]"
            },
            {
              "id": "1.2",
              "requirement": "Länkar med samma mål har samma länktext.",
              "failureStatementTemplate": "Länkar med samma mål saknar samma länktext. [ange var och hur det brister]"
            }
          ],
          "ifNo": []
        },
        {
          "id": "2",
          "condition": "Det finns ikoner eller symboler i knappar, länkar och andra element som förekommer på flera ställen eller sidor på webbplatsen.",
          "logic": "AND",
          "passCriteria": [
            {
              "id": "2.1",
              "requirement": "Varje ikon eller symbol har samma betydelse i samma typ av sammanhang på alla ställen eller sidor.",
              "failureStatementTemplate": "Någon eller några ikon eller symbol har inte samma betydelse i samma typ av sammanhang på alla ställen eller sidor. [ange var och hur det brister]"
            },
            {
              "id": "2.2",
              "requirement": "Varje ikon eller symbol har ett konsekvent maskinläsbart namn i samma typ av sammanhang på alla ställen eller sidor.",
              "failureStatementTemplate": "Någon eller några ikoner eller symboler har inte ett konsekvent maskinläsbart namn i samma typ av sammanhang på alla ställen eller sidor. [ange var och hur det brister]"
            },
            {
              "id": "2.3",
              "requirement": "Varje ikon eller symbol som är en bild har samma textalternativ i samma typ av sammanhang på alla ställen eller sidor.",
              "failureStatementTemplate": "Någon eller några ikoner eller symboler som är en bild har inte samma textalternativ i samma typ av sammanhang på alla ställen eller sidor. [ange var och hur det brister]"
            },
            {
              "id": "2.4",
              "requirement": "Funktioner indikeras med samma typ av ikon eller symbol i samma typ av sammanhang på alla ställen eller sidor.",
              "failureStatementTemplate": "Funktioner indikeras inte med samma typ av ikon eller symbol i samma typ av sammanhang på alla ställen eller sidor gäller. [ange var och hur det brister]"
            }
          ],
          "ifNo": []
        },
        {
          "id": "3",
          "condition": "Det finns inmatningsfält, vallistor, kryssrutor, radiogrupper eller liknande som förekommer på flera sidor eller ställen på webbplatsen.",
          "logic": "AND",
          "passCriteria": [
            {
              "id": "3.1",
              "requirement": "Samma ledtext används för fält med samma syfte på alla ställen eller sidor där det förekommer.",
              "failureStatementTemplate": "Samma ledtext används inte för fält med samma syfte på alla ställen eller sidor där det förekommer. [ange var och hur det brister]"
            }
          ],
          "ifNo": []
        },
        {
          "id": "4",
          "condition": "Det finns knappar med text i, där knappen eller funktionen förekommer på flera ställen eller sidor på webbplatsen.",
          "logic": "AND",
          "passCriteria": [
            {
              "id": "4.1",
              "requirement": "Knappar med samma text utför samma funktion på alla ställen eller sidor där de förekommer.",
              "failureStatementTemplate": "Knappar med samma text utför inte samma funktion på alla ställen eller sidor där de förekommer. [ange var och hur det brister]"
            },
            {
              "id": "4.2",
              "requirement": "Knappar med samma funktion har samma text på alla ställen eller sidor där de förekommer.",
              "failureStatementTemplate": "Knappar med samma funktion har inte samma text på alla ställen eller sidor där de förekommer. [ange var och hur det brister]"
            }
          ],
          "ifNo": []
        }
      ],
      "contentType": [
        "bilder-och-ikoner-bilder",
        "bilder-och-ikoner-ikoner",
        "bilder-och-ikoner-kartor-diagram-och-datavisualisering",
        "formular-inmatningsfalt",
        "formular-knappar",
        "interaktiva-komponenter-komplexa-interaktiva-komponenter",
        "mediespelare-mediespelare-for-ljud",
        "mediespelare-mediespelare-for-video",
        "navigering-lankar",
        "sarskilda-hinder-captcha",
        "text-och-struktur-listor",
        "text-och-struktur-tabeller"
      ],
      "classifications": [
        {
          "taxonomyId": "wcag22-pour",
          "conceptId": "understandable"
        }
      ]
    },
    "krav_kontrast_for_textalternativ": {
      "id": "krav_kontrast_for_textalternativ",
      "key": "krav_kontrast_for_textalternativ",
      "title": "Kontrast (minimum) när bilden visuellt ersätts av ALT-texten",
      "metadata": {
        "mainCategory": {
          "text": "Bilder",
          "key": "bilder"
        },
        "subCategory": {
          "text": "Textalternativ",
          "key": "textalternativ"
        },
        "impact": {
          "isCritical": true,
          "primaryScore": 2,
          "secondaryScore": 1,
          "assumedCompliance": false
        }
      },
      "standardReference": {
        "text": "9.1.4.3 Contrast (Minimum)",
        "url": "https://www.w3.org/WAI/WCAG22/quickref/#contrast-minimum"
      },
      "exceptions": "",
      "examples": "",
      "tips": "Detta krav omfattar enbart kontrasten på ALT-texten.",
      "commonErrors": "",
      "expectedObservation": "Kontroll av textalternativs kontrast – Alla textalternativ har ett kontrastförhållande på minst 4,5:1 (3:1 för stor text) mot bakgrunden.",
      "instructions": "- Granska sidans kod och ta bort ett tecken ur bildens URL. Detta gör att webbläsaren inte hittar bilden och visar då ALT-texten istället, om det finns en ALT-text. \n- Använd PTS bookmarklet för att ersätta alla bilder på sidan med ALT-texten",
      "checks": [
        {
          "id": "1",
          "condition": "Det finns bilder på sidan.",
          "logic": "AND",
          "passCriteria": [
            {
              "id": "1.1",
              "requirement": "När bilden inte visas: Alla textalternativ har ett kontrastförhållande på minst 4,5:1 (3:1 för stor text) mot bakgrunden.",
              "failureStatementTemplate": "När bilden inte visas: Alla textalternativ saknar ett kontrastförhållande på minst 4,5:1 (3:1 för stor text) mot bakgrunden. [ange var och hur det brister]"
            }
          ],
          "ifNo": []
        }
      ],
      "contentType": [
        "bilder-och-ikoner-bilder",
        "bilder-och-ikoner-ikoner",
        "bilder-och-ikoner-kartor-diagram-och-datavisualisering"
      ],
      "classifications": [
        {
          "taxonomyId": "wcag22-pour",
          "conceptId": "perceivable"
        }
      ]
    },
    "krav_kopplade_falt": {
      "id": "krav_kopplade_falt",
      "key": "krav_kopplade_falt",
      "title": "Information och relationer för interaktiva komponenter",
      "metadata": {
        "mainCategory": {
          "text": "Användargränssnitt",
          "key": "anvandargranssnitt"
        },
        "subCategory": {
          "text": "Interaktiva komponenter",
          "key": "interaktiva-komponenter"
        },
        "impact": {
          "isCritical": true,
          "primaryScore": 1,
          "secondaryScore": 2,
          "assumedCompliance": false
        }
      },
      "standardReference": {
        "text": "9.1.3.1 Info and Relationships",
        "url": "https://www.w3.org/WAI/WCAG22/quickref/#info-and-relationships"
      },
      "exceptions": "",
      "examples": "Ett formulär där ett fält för “Ort” bara visas när användaren valt “Sverige” i en landsväljare, och relationen är korrekt angiven i koden.",
      "tips": "Om det är svårt att avgöra relationen i koden – testa att navigera i formuläret med tangentbord och skärmläsare.",
      "commonErrors": "Styrda fält saknar koppling till det kontrollerande fältet i koden.",
      "expectedObservation": "Det kontrollerande objektet och det objekt som blir kontrollerat, ska vara maskinläsbart sammankopplade. \nDet finns komponenter som styr andra komponenter. \nRelationen framgår strukturellt (det styrda fältet är underordnat det kontrollerande). \nRelationen är maskinläsbart angiven. \nRelationen framgår genom att det styrda fältet kommer i anslutning till det kontrollerande i källkoden.",
      "instructions": "Kontrollera om det finns formulärelement som styr andra formulärelement (visar eller förändrar formulärelement). \nDetta gör du genom att fylla i olika variationer av ett formulär i sin helhet och se om något innehåll i formuläret ändras.",
      "checks": [
        {
          "id": "1",
          "condition": "Det finns komponenter som styr andra komponenter.",
          "logic": "OR",
          "passCriteria": [
            {
              "id": "1.1",
              "requirement": "Relationen framgår strukturell/korrekt grupperade (det styrda fältet är underordnat det kontrollerande).",
              "failureStatementTemplate": "Relationen är oklar strukturell/korrekt grupperade (det styrda fältet är underordnat det kontrollerande). [ange var och hur det brister]"
            },
            {
              "id": "1.2",
              "requirement": "Relationen är maskinläsbart angiven.",
              "failureStatementTemplate": "Relationen är inte maskinläsbart angiven. [ange var och hur det brister]"
            },
            {
              "id": "1.3",
              "requirement": "Relationen framgår genom att det styrda fältet kommer i anslutning till det kontrollerande i källkoden.",
              "failureStatementTemplate": "Relationen är oklar genom att det styrda fältet kommer i anslutning till det kontrollerande i källkoden. [ange var och hur det brister]"
            }
          ],
          "ifNo": []
        }
      ],
      "contentType": [
        "formular-inmatningsfalt",
        "interaktiva-komponenter-komplexa-interaktiva-komponenter",
        "navigering-navigeringsmenyer",
        "teknisk-grundstruktur-roller-och-egenskaper-i-koden",
        "text-och-struktur-landmarken"
      ],
      "classifications": [
        {
          "taxonomyId": "wcag22-pour",
          "conceptId": "perceivable"
        }
      ]
    },
    "krav_kontrast_for_fokusmarkering": {
      "id": "krav_kontrast_for_fokusmarkering",
      "key": "krav_kontrast_for_fokusmarkering",
      "title": "Kontrast för fokusmarkering",
      "metadata": {
        "mainCategory": {
          "text": "Tangentbord",
          "key": "tangentbord"
        },
        "subCategory": {
          "text": "Fokus",
          "key": "fokus"
        },
        "impact": {
          "isCritical": false,
          "primaryScore": 2,
          "secondaryScore": 1,
          "assumedCompliance": false
        }
      },
      "standardReference": {
        "text": "9.1.4.11 Non-text Contrast",
        "url": "https://www.w3.org/WAI/WCAG22/quickref/#non-text-contrast"
      },
      "exceptions": "Komponenter där såväl komponentens som fokusmarkeringens utseende bestäms av webbläsaren och inte påverkas med CSS.",
      "examples": "",
      "tips": "",
      "commonErrors": "",
      "expectedObservation": "Kontroll av kontrast för fokusmarkering: Alla fokusmarkeringar har ett kontrastförhållande på minst 3:1 mot intilliggande färger.",
      "instructions": "Navigera genom alla fokuserbara element på sidan med tangentbordet. \nAktivera (med tangentbordet) eventuella funktioner som öppnar en meny, dialogruta eller liknande. \nOm du hittar ett objekt med misstänkt låg konstrast, ta en skärmdump och mät kontrasten med hjälp av ett bildredigeringsprogram. \nKontrasten ska vara minst 3:1 mellan markering och intilliggande färger.",
      "checks": [
        {
          "id": "1",
          "condition": "Fokusmarkeringens utseende styrs av webbplatsens egna stilmall/CSS.",
          "logic": "AND",
          "passCriteria": [
            {
              "id": "1.1",
              "requirement": "Alla fokusmarkeringar har ett kontrastförhållande på minst 3:1 mot intilliggande färger.",
              "failureStatementTemplate": "Någon eller några fokusmarkeringar har inte ett kontrastförhållande på minst 3:1 mot intilliggande färger.. [ange var och hur det brister]"
            }
          ],
          "ifNo": []
        }
      ],
      "contentType": [
        "formular-inmatningsfalt",
        "formular-knappar",
        "interaktiva-komponenter-komplexa-interaktiva-komponenter",
        "mediespelare-mediespelare-for-ljud",
        "mediespelare-mediespelare-for-video",
        "navigering-lankar",
        "navigering-navigeringsmenyer"
      ],
      "classifications": [
        {
          "taxonomyId": "wcag22-pour",
          "conceptId": "perceivable"
        }
      ]
    },
    "krav_tabeller": {
      "id": "krav_tabeller",
      "key": "krav_tabeller",
      "title": "Information och relationer för tabeller",
      "metadata": {
        "mainCategory": {
          "text": "Innehåll",
          "key": "innehall"
        },
        "subCategory": {
          "text": "Semantik",
          "key": "semantik"
        },
        "impact": {
          "isCritical": true,
          "primaryScore": 1,
          "secondaryScore": 2,
          "assumedCompliance": false
        }
      },
      "standardReference": {
        "text": "9.1.3.1 Info and Relationships",
        "url": "https://www.w3.org/WAI/WCAG22/quickref/#info-and-relationships"
      },
      "exceptions": "Om tabellen endast används för layout och inte presenterar data, behöver den inte ha rubrikceller eller caption.",
      "examples": "En datatabell är uppmärkt med <table>, rubrikceller med <th>, dataceller med <td> och tabellen har en <caption> som beskriver innehållet.",
      "tips": "Om det är svårt att avgöra om tabellen är för data eller layout – kontrollera om det finns logiska rubriker och om tabellen går att förstå utan visuell presentation.",
      "commonErrors": "Tabeller används för layout saknar role=\"presentation\"",
      "expectedObservation": "Kontroll av datatabeller – Datatabeller är uppmärkta med <table>, rader med <tr>, dataceller med <td>.\nRubrikceller i tabeller är uppmärkta med <th>.\nRubrikceller som spänner över flera rader, är uppmärkta med scope row. \nAlla rubrikceller i tabeller har innehåll.\nTabellrubriker är uppmärkta med <caption> och är första underelementet i sin <table>.\n\nTabeller används för layoutändamål. \nLayouttabeller har rollen presentation (eller none).\nLayouttabeller innehåller inte rubrikceller.",
      "instructions": "Använd PTS bookmarklet för att identifiera tabeller på sidan. \nLeta efter saker som är uppmärkta som tabeller, saker som är tabeller, saker som inte är uppmärkt som tabeller men borde vara det.\n\nLeta efter tabeller som används för layout. Använd PTS bookmarklet för detta.",
      "checks": [
        {
          "id": "1",
          "condition": "Det finns minst en tabell för strukturerad data på sidan.",
          "logic": "AND",
          "passCriteria": [
            {
              "id": "1.1",
              "requirement": "Tabellen är kodad med table eller role=\"table\".",
              "failureStatementTemplate": "Tabellen är inte kodad med table eller role=\"table\". [ange var och hur det brister]"
            },
            {
              "id": "1.2",
              "requirement": "Varje tabellrad är taggad med en <tr> eller role=\"row\".",
              "failureStatementTemplate": "Någon eller några tabellrad är inte taggade med en <tr> eller role=\"row\". [ange var och hur det brister]"
            },
            {
              "id": "1.3",
              "requirement": "Varje rubrikcell är taggad med <th> eller role=\"columnheader\" eller role=\"rowheader\".",
              "failureStatementTemplate": "Någon eller några rubrikcell saknar uppmärkning med <th>, eller role=\"columnheader\" eller role=\"rowheader\". [ange var och hur det brister]"
            },
            {
              "id": "1.4",
              "requirement": "Varje tabellcell är taggad med <td> eller role=\"cell\".",
              "failureStatementTemplate": "Någon eller några tabellceller är inte taggade med <td> eller role=\"cell\". [ange var och hur det brister]"
            },
            {
              "id": "1.5",
              "requirement": "Varje tabell innehåller ett caption-element (eller motsvarande maskinläsbar information).",
              "failureStatementTemplate": "Någon eller några tabell saknar ett caption-element (eller motsvarande maskinläsbar information). [ange var och hur det brister]"
            },
            {
              "id": "1.6",
              "requirement": "Caption-elementet (eller motsvarande maskinläsbar information) beskriver väl tabellens innehåll.",
              "failureStatementTemplate": "Caption-elementet (eller motsvarande maskinläsbar information) beskriver inte tabellens innehåll. [ange var och hur det brister]"
            },
            {
              "id": "1.7",
              "requirement": "Alla rubrikceller i tabeller har innehåll.",
              "failureStatementTemplate": "Någon eller några rubrikceller i tabeller saknar innehåll. [ange var och hur det brister]"
            }
          ],
          "ifNo": []
        },
        {
          "id": "2",
          "condition": "Tabeller används för layoutändamål.",
          "logic": "AND",
          "passCriteria": [
            {
              "id": "2.1",
              "requirement": "Layouttabeller har rollen presentation (eller none).",
              "failureStatementTemplate": "Layouttabeller saknar rollen presentation (eller none). [ange var och hur det brister]"
            },
            {
              "id": "2.2",
              "requirement": "Layouttabeller innehåller inga rubrikceller.",
              "failureStatementTemplate": "Layouttabeller innehåller inga rubrikceller gäller inte. [ange var och hur det brister]"
            }
          ],
          "ifNo": []
        }
      ],
      "contentType": [
        "teknisk-grundstruktur-roller-och-egenskaper-i-koden",
        "text-och-struktur-landmarken",
        "text-och-struktur-tabeller"
      ],
      "classifications": [
        {
          "taxonomyId": "wcag22-pour",
          "conceptId": "perceivable"
        }
      ]
    },
    "krav_statusmeddelanden": {
      "id": "krav_statusmeddelanden",
      "key": "krav_statusmeddelanden",
      "title": "Statusmeddelanden",
      "metadata": {
        "mainCategory": {
          "text": "Generella krav",
          "key": "generella-krav"
        },
        "subCategory": "",
        "impact": {
          "isCritical": false,
          "primaryScore": 9,
          "secondaryScore": 1,
          "assumedCompliance": false
        }
      },
      "standardReference": {
        "text": "9.4.1.3 Status Messages",
        "url": "https://www.w3.org/WAI/WCAG22/quickref/#status-messages"
      },
      "exceptions": "Felmeddelanden i formulär räknas vanligtvis inte som statusmeddelanden. Undantag kan dock förekomma.",
      "examples": "Ett inskickat formulär möts av en popup-notis som förmedlar att postningen av formuläret var lyckat. Texten i popup-notisen läses upp av skärmläsare utan att fokus flyttas.",
      "tips": "Det finns två kriterier för att avgöra om något räknas som ett statusmeddelande: \n\n1: Meddelandet ger användaren information om:\n- en pågående eller slutförd åtgärd, \n- en applikation laddar, \n- förloppet i en process, \n- ett fel har uppstått.\n- realtidsformatering\n\n2: Meddelandet visas utanför användarens fokus.",
      "commonErrors": "- Innehållet i en kundvagn uppdateras utan att användare med skärmläsare informeras om det.\n- Vid filtrering av ett sökresultat uppdateras innehållet utan att användare med skärmläsare informeras om det.\n- Generell information som \"Ett fel har uppstått, försök igen\" eller \"Information laddas. Var god vänta\" förmedlas inte maskinläsbart.",
      "expectedObservation": "Statusmeddelanden informerar användaren om att någon information på sidan har tillkommit eller har uppdaterats. Denna nya/uppdaterade information ska användaren kunna ta del av utan att användarens fokus flyttas till denna information.",
      "instructions": "Leta efter information eller innehåll på sidan som visas och/eller uppdateras vid vissa händelser eller med vissa intervaller.\nOm sådan information eller innehåll identifieras, använd skärmläsare och kontrollera att den läser upp statusmeddelandet under dessa förutsättningar.",
      "checks": [
        {
          "id": "1",
          "condition": "Det finns innehåll på sidan som dyker upp eller uppdateras vid vissa händelser eller med vissa intervaller.",
          "logic": "AND",
          "passCriteria": [
            {
              "id": "1.1",
              "requirement": "Statusmeddelandet informerar användaren om vad som händer utan att fokus flyttas.",
              "failureStatementTemplate": "Statusmeddelandet informerar användaren om vad som händer utan att fokus flyttas. [ange var och hur det brister]"
            }
          ],
          "ifNo": []
        }
      ],
      "contentType": [
        "dynamiskt-innehall-uppdaterande-innehall",
        "formular-inmatningsfalt",
        "formular-knappar",
        "interaktiva-komponenter-komplexa-interaktiva-komponenter",
        "mediespelare-mediespelare-for-ljud",
        "mediespelare-mediespelare-for-video",
        "sarskilda-hinder-captcha",
        "text-och-struktur-tabeller",
        "text-och-struktur-text"
      ],
      "classifications": [
        {
          "taxonomyId": "wcag22-pour",
          "conceptId": "robust"
        }
      ]
    },
    "krav_bilder_av_text": {
      "id": "krav_bilder_av_text",
      "key": "krav_bilder_av_text",
      "title": "Bilder av text",
      "metadata": {
        "mainCategory": {
          "text": "Bilder",
          "key": "bilder"
        },
        "subCategory": "",
        "impact": {
          "isCritical": false,
          "primaryScore": 2,
          "secondaryScore": 1,
          "assumedCompliance": false
        }
      },
      "standardReference": {
        "text": "9.1.4.5 Images of Text",
        "url": "https://www.w3.org/WAI/WCAG22/quickref/#images-of-text"
      },
      "exceptions": "Bilder av text som går att anpassa visuellt efter användarens behov.\nEn specifik presentation är en förutsättning, till exempel i logotyper och varumärken, eller skärmavbildningar.",
      "examples": "",
      "tips": "",
      "commonErrors": "När all text på sidan är markerad så är texten i en bild fortfarande omarkerad.",
      "expectedObservation": "Text, inte bilder av text, används för att förmedla information.",
      "instructions": "- Markera innehåll med musen. Text markeras vanligen på ett tydligt sätt som skiljer sig från markering av bilder.\n- Använd Web Developer för att markera eller dölja alla bilder.\n- Markera all text på sidan med CTRL + A. Kontrollera att all text på sidan blir markerad.",
      "checks": [
        {
          "id": "1",
          "condition": "Det finns bilder som innehåller text.",
          "logic": "OR",
          "passCriteria": [
            {
              "id": "1.1",
              "requirement": "Text, inte bilder av text, används för att förmedla information.",
              "failureStatementTemplate": "Text, inte bilder av text, används för att förmedla information gäller inte. [ange var och hur det brister]"
            },
            {
              "id": "1.2",
              "requirement": "Texten som finns i bilden återfinns som ren text i direkt anslutning till bilden.",
              "failureStatementTemplate": "Texten som finns i bilden återfinns som ren text i direkt anslutning till bilden gäller inte. [ange var och hur det brister]"
            }
          ],
          "ifNo": []
        }
      ],
      "contentType": [
        "bilder-och-ikoner-bilder",
        "bilder-och-ikoner-ikoner",
        "bilder-och-ikoner-kartor-diagram-och-datavisualisering"
      ],
      "classifications": [
        {
          "taxonomyId": "wcag22-pour",
          "conceptId": "perceivable"
        }
      ]
    },
    "krav_namn_roll_varde": {
      "id": "krav_namn_roll_varde",
      "key": "krav_namn_roll_varde",
      "title": "Namn, Roll, Värde",
      "metadata": {
        "mainCategory": {
          "text": "Användargränssnitt",
          "key": "anvandargranssnitt"
        },
        "subCategory": {
          "text": "Interaktiva komponenter",
          "key": "interaktiva-komponenter"
        },
        "impact": {
          "isCritical": false,
          "primaryScore": 2,
          "secondaryScore": 1,
          "assumedCompliance": false
        }
      },
      "standardReference": {
        "text": "9.4.1.2 Name, Role, Value",
        "url": "https://www.w3.org/WAI/WCAG22/quickref/#name-role-value"
      },
      "exceptions": "",
      "examples": "- En`<div>`-tagg med en bakgrundsbild har`role=\"image\"`satt på sig för att definiera elementet som en bild.\n- En växlingsknapp har ARIA-attributet`aria-pressed=\"true\"`för att förmedla till hjälpmedel att knappen är aktiverad. Värdet för`aria-pressed`förändras när tillståndet för knappen ändras.",
      "tips": "- Detta kriterium berör**skräddarsytt innehåll**med generisk eller semantisk HTML-kod som kräver HTML-attribut, ARIA-attribut och roller för att förmedla egenskaper, tillstånd eller värden.\n- Semantisk HTML är taggar som förmedlar en roll och betydelse, t.ex.`<button>`,`<nav>`,`<a>`,`<input>`m.m.\n- Generisk HTML är taggar som inte har någon specifik roll eller betydelse, t.ex.`<div>`,`<span>`m.m.",
      "commonErrors": "- Webbsidan använder aria-attribut felaktigt, antingen där stöd för aria saknas eller så att information blir felaktig. \n- Ett utfällbart innehåll expanderas av användare med skärmläsare, men användaren får ingen information om att innehållet har expanderats.\n- En fliklösning är skräddarsydd med`<button>`-taggar som inte förmedlar något tillstånd. Så användare med skärmläsare vet inte att det är en flik-lösning de kommer till.",
      "expectedObservation": "- Egenskaper, tillstånd eller värden hos komponenter ska vara maskinläsbara, både i ursprungstillstånd och vid eventuella förändringar.\n- Alla skräddarsydda komponenter ska ha ett maskinläsbart namn, en roll och attribut som beskriver komponentens syfte och/eller funktion.",
      "instructions": "Kontrollera att alla skräddarsydda komponenter på sidan har relevanta maskinläsbara namn, roller och attribut. \nDetta kan t.ex. göras med skärmläsare påslaget när du navigerar genom gränssnittet, eller genom att inspektera koden i webbläsaren.\nEgenskaper, tillstånd och värden kan förmedlas med både HTML-attribut och ARIA-attribut.",
      "checks": [
        {
          "id": "1",
          "condition": "Webbsidan innehåller skräddarsydda komponenter.",
          "logic": "AND",
          "passCriteria": [
            {
              "id": "1.1",
              "requirement": "Komponenterna har en maskinläsbar roll.",
              "failureStatementTemplate": "Komponenterna saknar en maskinläsbar roll. [ange var och hur det brister]"
            },
            {
              "id": "1.2",
              "requirement": "Komponenternas roller beskriver dess syften och/eller funktioner.",
              "failureStatementTemplate": "Komponenternas roller beskriver inte dess syften och/eller funktioner. [ange var och hur det brister]"
            },
            {
              "id": "1.3",
              "requirement": "Komponenterna har ett maskinläsbart namn.",
              "failureStatementTemplate": "Komponenterna saknar ett maskinläsbart namn. [ange var och hur det brister]"
            },
            {
              "id": "1.4",
              "requirement": "De HTML- och aria-attribut som förekommer i den skräddarsydda komponenten används på ett korrekt sätt.",
              "failureStatementTemplate": "De HTML- och aria-attribut som förekommer i den skräddarsydda komponenten används på ett felaktigt sätt.  [ange var och hur det brister]"
            }
          ],
          "ifNo": []
        },
        {
          "id": "2",
          "condition": "Det finns skräddarsydda komponenter med egenskaper, tillstånd eller värden som användaren kan påverka/förändra.",
          "logic": "AND",
          "passCriteria": [
            {
              "id": "2.1",
              "requirement": "Komponenternas egenskaper, tillstånd eller värden är maskinläsbara, både i ursprungstillstånd och vid eventuella förändringar.",
              "failureStatementTemplate": "Komponenternas egenskaper, tillstånd eller värden är inte maskinläsbara, varken i ursprungstillståndet eller vid eventuella förändringar. [ange var och hur det brister]"
            },
            {
              "id": "2.2",
              "requirement": "De HTML- och aria-attribut som förekommer i den skräddarsydda komponenten används på ett korrekt sätt.",
              "failureStatementTemplate": "De HTML- och aria-attribut som förekommer i den skräddarsydda komponenten används på ett felaktigt sätt.  [ange var och hur det brister]"
            }
          ],
          "ifNo": []
        }
      ],
      "contentType": [
        "bilder-och-ikoner-bilder",
        "bilder-och-ikoner-ikoner",
        "bilder-och-ikoner-kartor-diagram-och-datavisualisering",
        "enhetsspecifikt-och-avancerat-touchfunktioner",
        "formular-inmatningsfalt",
        "formular-knappar",
        "interaktiva-komponenter-komplexa-interaktiva-komponenter",
        "mediespelare-mediespelare-for-ljud",
        "mediespelare-mediespelare-for-video",
        "navigering-lankar",
        "navigering-navigeringsmenyer",
        "sarskilda-hinder-captcha",
        "teknisk-grundstruktur-roller-och-egenskaper-i-koden",
        "text-och-struktur-landmarken",
        "text-och-struktur-listor",
        "text-och-struktur-rubriker",
        "text-och-struktur-tabeller",
        "text-och-struktur-text"
      ],
      "classifications": [
        {
          "taxonomyId": "wcag22-pour",
          "conceptId": "robust"
        }
      ]
    },
    "krav_kontrast_for_text": {
      "id": "krav_kontrast_for_text",
      "key": "krav_kontrast_for_text",
      "title": "Kontrast (minimum) mellan text och bakgrund",
      "metadata": {
        "mainCategory": {
          "text": "Innehåll",
          "key": "innehall"
        },
        "subCategory": {
          "text": "Text",
          "key": "text"
        },
        "impact": {
          "isCritical": true,
          "primaryScore": 2,
          "secondaryScore": 1,
          "assumedCompliance": false
        }
      },
      "standardReference": {
        "text": "9.1.4.3 Contrast (Minimum)",
        "url": "https://www.w3.org/WAI/WCAG22/quickref/#contrast-minimum"
      },
      "exceptions": "",
      "examples": "",
      "tips": "När texten ligger mot flerfärgad bakgrund, till exempel ett fotografi med många färger, så mäts kontrastvärdet på de ställen där kontrasten är som lägst.",
      "commonErrors": "",
      "expectedObservation": "Kontrast mellan text och bakgrund \n- Alla länkar som är minst 18 punkter (24 px) eller 14 punkter och fet (19 px) har ett kontrastförhållande på minst 3:1 mot bakgrunden.\n- Alla övriga länkar med en annan storlek har ett kontrastförhållande på minst 4,5:1 mot bakgrunden.\n- Text som är minst 18 punkter (24 px) eller 14 punkter och fet (19 px) har ett kontrastförhållande på minst 3:1 mot bakgrunden.\n- All övrig text med annan storlek har ett kontrastförhållande på minst 4,5:1 mot bakgrunden.\n- Eventuell text i diagram har ett kontrastförhållande på minst 4,5:1 (3:1 för stor text) mot intilliggande färger.",
      "instructions": "- Kontrollera om WAVE eller liknande halvautomatiskt verktyg varnar för bristande kontraster och kontrollera så att bristerna stämmer.\n- Utför även manuell kontroll av färgvärden och kontraster med ett manuellt verktyg som t.ex. Color Contrast Checker (TPGi).",
      "checks": [
        {
          "id": "1",
          "condition": "Sidan innehåller text.",
          "logic": "AND",
          "passCriteria": [
            {
              "id": "1.1",
              "requirement": "Alla länkar som är minst 18 punkter (24 px) eller 14 punkter och fet (19 px) har ett kontrastförhållande på minst 3:1 mot bakgrunden.",
              "failureStatementTemplate": "Någon eller några länkar som är minst 18 punkter (24 px) eller 14 punkter och fet (19 px) har ett kontrastförhållande på mindre än 3:1 mot bakgrunden. [ange var och hur det brister]"
            },
            {
              "id": "1.2",
              "requirement": "Alla övriga länkar har ett kontrastförhållande på minst 4,5:1 mot bakgrunden.",
              "failureStatementTemplate": "Någon eller några av de övriga länkarna har ett kontrastförhållande på under 4,5:1 mot bakgrunden. [ange var och hur det brister]"
            },
            {
              "id": "1.3",
              "requirement": "Text som är minst 18 punkter (24 px) eller 14 punkter och fet (19 px) har ett kontrastförhållande på minst 3:1 mot bakgrunden.",
              "failureStatementTemplate": "Text som är minst 18 punkter (24 px) eller 14 punkter och fet (19 px) har ett kontrastförhållande på under 3:1 mot bakgrunden. [ange var och hur det brister]"
            },
            {
              "id": "1.4",
              "requirement": "All övrig text har ett kontrastförhållande på minst 4,5:1 mot bakgrunden.",
              "failureStatementTemplate": "En del av den övriga texten har ett kontrastförhållande på under 4,5:1 mot bakgrunden. [ange var och hur det brister]"
            },
            {
              "id": "1.5",
              "requirement": "Eventuell text i diagram har ett kontrastförhållande på minst 4,5:1 (3:1 för stor text) mot intilliggande färger.",
              "failureStatementTemplate": "Eventuell text i diagram saknar ett kontrastförhållande på minst 4,5:1 (3:1 för stor text) mot intilliggande färger. [ange var och hur det brister]"
            }
          ],
          "ifNo": []
        }
      ],
      "contentType": [
        "navigering-navigeringsmenyer",
        "text-och-struktur-text"
      ],
      "classifications": [
        {
          "taxonomyId": "wcag22-pour",
          "conceptId": "perceivable"
        }
      ]
    },
    "krav_forstora_text": {
      "id": "krav_forstora_text",
      "key": "krav_forstora_text",
      "title": "Ändra textstorlek",
      "metadata": {
        "mainCategory": {
          "text": "Layout",
          "key": "layout"
        },
        "subCategory": {
          "text": "Förstoring",
          "key": "forstoring"
        },
        "impact": {
          "isCritical": false,
          "primaryScore": 1,
          "secondaryScore": 0,
          "assumedCompliance": false
        }
      },
      "standardReference": {
        "text": "9.1.4.4 Resize Text",
        "url": "https://www.w3.org/WAI/WCAG22/quickref/#resize-text"
      },
      "exceptions": "",
      "examples": "",
      "tips": "",
      "commonErrors": "",
      "expectedObservation": "Om sidan*saknar*en egen funktion för att öka eller minska textstorleken: \n\n- All text går att förstora till åtminstone 200 % med webbläsarens zoomfunktion.\n- Inget innehåll och ingen funktion går förlorad vid textstorleken 200 %.\n- Kontroll av inmatningsfält: Text i inmatningsfält går att förstora till åtminstone 200 %.\n- Det går att zooma (till åtminstone 200 %) i mobilen.",
      "instructions": "### Metod 1\n\n1. Öppna den granskade sidan i ett nytt fönster (Ctrl+N).\n2. Använd funktionen Resize i tillägget Web Developer och sätt storleken för båda fönstren till 1280×1024.\n3. Förstora (zooma) innehållet i det ena fönstret till 400 % (Ctrl++).\n4. Jämför innehållet i de två fönstren och leta efter text som inte ser ut att vara större i det zoomade fönstret. I misstänkta fall, använd Inspektören och jämför de beräknade värdena för egenskapen font-size.\n5. Minska gradvis förstoringen ned till 100 % (Ctrl+-). För varje följsamt läge (när andra ändringar än bara förstoringsgraden inträffar), upprepa kontrollen i steg 4.\n\n### Metod 2\n\nKontrollera om sidan har en egen funktion för att öka eller minska textstorleken.\n\n### Metod 3\n\nKontrollera att det går att använda nyp-för-att-zooma i mobilen. Denna funktion kan ibland vara blockerad av webbsidan.",
      "checks": [
        {
          "id": "1",
          "condition": "Sidan saknar en egen funktion för att ändra textstorleken.",
          "logic": "AND",
          "passCriteria": [
            {
              "id": "1.1",
              "requirement": "All text går att förstora till åtminstone 200 % med webbläsarens zoomfunktion (CTRL++)",
              "failureStatementTemplate": "All text går inte att förstora till åtminstone 200 % med webbläsarens zoomfunktion (CTRL++). [ange var och hur det brister]"
            },
            {
              "id": "1.2",
              "requirement": "Det går att zooma (till åtminstone 200 %) i mobilen genom att nypa-för-att-zooma.",
              "failureStatementTemplate": "Det är svårt eller omöjligt att zooma (till åtminstone 200 %) i mobilen genom att nypa-för-att-zooma. [ange var och hur det brister]"
            },
            {
              "id": "1.3",
              "requirement": "Inget innehåll och ingen funktion går förlorad vid textstorleken 200 %.",
              "failureStatementTemplate": "Ett eller flera innehåll och ingen funktion går förlorad vid textstorleken 200 %. [ange var och hur det brister]"
            }
          ],
          "ifNo": []
        },
        {
          "id": "2",
          "condition": "Sidan har en egen funktion för att ändra textstorleken.",
          "logic": "AND",
          "passCriteria": [
            {
              "id": "2.1",
              "requirement": "All text går att förstora till åtminstone 200 % med förstoringsfunktionen.",
              "failureStatementTemplate": "All text går inte att förstora till åtminstone 200 % med förstoringsfunktionen. [ange var och hur det brister]"
            }
          ],
          "ifNo": []
        },
        {
          "id": "3",
          "condition": "Sidan innehåller minst ett inmatningsfält",
          "logic": "AND",
          "passCriteria": [
            {
              "id": "3.1",
              "requirement": "Text i inmatningsfält går att förstora till åtminstone 200 %.",
              "failureStatementTemplate": "Text i inmatningsfält går inte att förstora till åtminstone 200 %. [ange var och hur det brister]"
            }
          ],
          "ifNo": []
        }
      ],
      "contentType": [
        "formular-inmatningsfalt",
        "formular-knappar",
        "interaktiva-komponenter-komplexa-interaktiva-komponenter",
        "navigering-lankar",
        "teknisk-grundstruktur-roller-och-egenskaper-i-koden",
        "text-och-struktur-landmarken",
        "text-och-struktur-listor",
        "text-och-struktur-rubriker",
        "text-och-struktur-tabeller",
        "text-och-struktur-text"
      ],
      "classifications": [
        {
          "taxonomyId": "wcag22-pour",
          "conceptId": "perceivable"
        }
      ]
    },
    "krav_beskrivande_rubriker": {
      "id": "krav_beskrivande_rubriker",
      "key": "krav_beskrivande_rubriker",
      "title": "Beskrivande rubriker",
      "metadata": {
        "mainCategory": {
          "text": "Innehåll",
          "key": "innehall"
        },
        "subCategory": {
          "text": "Text",
          "key": "text"
        },
        "impact": {
          "isCritical": false,
          "primaryScore": 4,
          "secondaryScore": 2,
          "assumedCompliance": false
        }
      },
      "standardReference": {
        "text": "9.2.4.6 Headings and Labels",
        "url": "https://www.w3.org/WAI/WCAG22/quickref/#headings-and-labels"
      },
      "exceptions": "",
      "examples": "",
      "tips": "",
      "commonErrors": "",
      "expectedObservation": "Om det finns rubriker, så är dessa beskrivande för innehållet som följer direkt efter rubriken.",
      "instructions": "- Använd tillägget HeadingsMap för att lista alla rubriker på sidan.\n- Leta visuellt efter innehåll som är formgivet som rubriker.",
      "checks": [
        {
          "id": "1",
          "condition": "Det finns rubriker på sidan.",
          "logic": "AND",
          "passCriteria": [
            {
              "id": "1.1",
              "requirement": "Det går att förstå vilken information som finns under varje rubrik enbart genom att ta del av rubriken.",
              "failureStatementTemplate": "Det är svårt eller omöjligt att förstå vilken information som finns under varje rubrik enbart genom att ta del av rubriken. [ange var och hur det brister]"
            }
          ],
          "ifNo": []
        }
      ],
      "contentType": [
        "text-och-struktur-rubriker"
      ],
      "classifications": [
        {
          "taxonomyId": "wcag22-pour",
          "conceptId": "operable"
        }
      ]
    },
    "krav_beskrivande_ledtexter": {
      "id": "krav_beskrivande_ledtexter",
      "key": "krav_beskrivande_ledtexter",
      "title": "Beskrivande ledtexter",
      "metadata": {
        "mainCategory": {
          "text": "Innehåll",
          "key": "innehall"
        },
        "subCategory": {
          "text": "Text",
          "key": "text"
        },
        "impact": {
          "isCritical": false,
          "primaryScore": 4,
          "secondaryScore": 2,
          "assumedCompliance": false
        }
      },
      "standardReference": {
        "text": "9.2.4.6 Headings and Labels",
        "url": "https://www.w3.org/WAI/WCAG22/quickref/#headings-and-labels"
      },
      "exceptions": "",
      "examples": "",
      "tips": "",
      "commonErrors": "",
      "expectedObservation": "Om det finns etiketter (labels), så är dessa beskrivande för tillhörande formulärelement.",
      "instructions": "- Leta efter formulärelement och deras tillhörande etiketter.\n- Kontrollera att samtliga rubriker och etiketter är beskrivande för tillhörande innehåll.",
      "checks": [
        {
          "id": "1",
          "condition": "Det finns interaktiva element på sidan.",
          "logic": "AND",
          "passCriteria": [
            {
              "id": "1.1",
              "requirement": "Det går att förstå syftet med varje interaktivt element genom att ta del av dess etikett (label).",
              "failureStatementTemplate": "Det är svårt eller omöjligt att förstå syftet med varje interaktivt element genom att ta del av dess etikett (label). [ange var och hur det brister]"
            }
          ],
          "ifNo": []
        }
      ],
      "contentType": [
        "formular-inmatningsfalt",
        "formular-knappar",
        "interaktiva-komponenter-komplexa-interaktiva-komponenter"
      ],
      "classifications": [
        {
          "taxonomyId": "wcag22-pour",
          "conceptId": "operable"
        }
      ]
    },
    "krav_kopplade_ledtexter": {
      "id": "krav_kopplade_ledtexter",
      "key": "krav_kopplade_ledtexter",
      "title": "Information och relationer för etiketter och ledtexter",
      "metadata": {
        "mainCategory": {
          "text": "Användargränssnitt",
          "key": "anvandargranssnitt"
        },
        "subCategory": {
          "text": "Ledtexter",
          "key": "ledtexter"
        },
        "impact": {
          "isCritical": true,
          "primaryScore": 1,
          "secondaryScore": 2,
          "assumedCompliance": false
        }
      },
      "standardReference": {
        "text": "9.1.3.1 Info and Relationships",
        "url": "https://www.w3.org/WAI/WCAG22/quickref/#info-and-relationships"
      },
      "exceptions": "Sökrutor i sidhuvudet utan visuell textetikett kan godkännas om de har en annan tydlig visuell indikation på att de är sökfält, som t.ex. ett förstoringsglas.",
      "examples": "-Inmatningsfält är omslutna av sin tillhörande etikett.\n-Alla inmatningsfält i ett formulär har en etikett som är kopplad till fältet med <label for=\"...\">.",
      "tips": "- Testa att klicka på etiketten – om markören inte hamnar i fältet finns det sannolikt ingen maskinläsbar koppling.\n- Om maskinläsbart namn för formulärfält saknas, ska detta lyftas under 9.4.1.2.",
      "commonErrors": "-Inmatningsfält saknar koppling till etiketten, eller etiketten ligger inte i anslutning till fältet i koden.\n-Sökruta som saknar maskinläsbar etikett.",
      "expectedObservation": "-Det finns formulärelement med tillhörande ledtexter.\n-Ledtexter är uppmärkta med <label>.\n-Ledtexter är maskinläsbart kopplade till det tillhörande formulärelementet.",
      "instructions": "-Leta upp ett formulär på sidan.\n-Kontrollera att samtliga formulärelement har en visuell etikett.\n-Klicka på texten intill radioknappar och kryssrutor så att dessa blir ifyllda.\n-Etikett (label) och inmatningsfält ligger i direkt anslutning till varandra i koden och relationen är maskinläsbar.\n-Klicka på etiketten (label) som tillhör ett inmatningsfält. Markören ska hamna i det tillhörande inmatningsfältet.\n-Om det finns text i anslutning till formulärelementet som är avgörande för att förstå syftet och användning, så ska relationen vara maskinläsbar.",
      "checks": [
        {
          "id": "1",
          "condition": "Det finns etiketter (labels) i anslutning till formulärsfält.",
          "logic": "AND",
          "passCriteria": [
            {
              "id": "1.1",
              "requirement": "Etiketten är maskinläsbart kopplad till det tillhörande formulärelementet.",
              "failureStatementTemplate": "Etiketten är inte maskinläsbart kopplad till det tillhörande formulärelementet. [ange var och hur det brister]"
            }
          ],
          "ifNo": []
        },
        {
          "id": "2",
          "condition": "Det finns ytterligare ledtext i anslutning till formulärelementet som är avgörande för att förstå syftet och användning.",
          "logic": "AND",
          "passCriteria": [
            {
              "id": "2.1",
              "requirement": "Ledtexten är maskinläsbart kopplad till det tillhörande formulärelementet.",
              "failureStatementTemplate": "Ledtexten är inte maskinläsbart kopplad till det tillhörande formulärelementet. [ange var och hur det brister]"
            }
          ],
          "ifNo": []
        },
        {
          "id": "3",
          "condition": "Det saknas visuella textetiketter (labels) i anslutning till formulärsfält.",
          "logic": "AND",
          "passCriteria": [
            {
              "id": "3.1",
              "requirement": "Formulärfältet är ett sökfält i sidhuvudet som har en annan tydlig visuell indikation på att det är ett sökfält.",
              "failureStatementTemplate": "Det saknas visuella textetiketter (labels) i anslutning till formulärsfält."
            }
          ],
          "ifNo": []
        }
      ],
      "contentType": [
        "formular-inmatningsfalt",
        "teknisk-grundstruktur-roller-och-egenskaper-i-koden",
        "text-och-struktur-landmarken"
      ],
      "classifications": [
        {
          "taxonomyId": "wcag22-pour",
          "conceptId": "perceivable"
        }
      ]
    },
    "krav_syfte_for_lankar": {
      "id": "krav_syfte_for_lankar",
      "key": "krav_syfte_for_lankar",
      "title": "Syfte för länkar",
      "metadata": {
        "mainCategory": {
          "text": "Innehåll",
          "key": "innehall"
        },
        "subCategory": {
          "text": "Länkar",
          "key": "lankar"
        },
        "impact": {
          "isCritical": false,
          "primaryScore": 4,
          "secondaryScore": 1,
          "assumedCompliance": false
        }
      },
      "standardReference": {
        "text": "9.2.4.4 Link Purpose (in Context)",
        "url": "https://www.w3.org/WAI/WCAG22/quickref/#link-purpose-in-context"
      },
      "exceptions": "- Syftet med länken är oklart även för personer utan funktionsnedsättning.\n- Länkar som ligger i löpande text är undantaget detta krav, även om det är rekommenderat att ha länk-texter som fungerar fristående även här.",
      "examples": "",
      "tips": "",
      "commonErrors": "- Länkar med både text och bild (puffar), är länkade i sin helhet och får då väldigt långa länktexter.\n- Det finns länkar på sidan med länk-texten \"Läs mer\" där alla länkar leder till olika ställen.",
      "expectedObservation": "- Syftet med varje länk framgår av länktexten utan omgivande sammanhang, eller tillsammans med texten som föregår länken (i samma stycke eller lista exempelvis).\n- Länkade bilder har ett textalternativ som beskriver syftet med länken. \n- Länkar som innehåller både bilder och text (till exempel \"puffar\"), har bara så lång maskinläsbar text, som behövs för att beskriva syftet.",
      "instructions": "1. Identifiera alla länkar på sidan (t.ex. med PTS bookmarklet).\n2. Kontrollera att varje länk har en beskrivande text utifrån länkens syfte.",
      "checks": [
        {
          "id": "1",
          "condition": "Sidan innehåller länkar.",
          "logic": "OR",
          "passCriteria": [
            {
              "id": "1.1",
              "requirement": "Länkens syfte framgår genom att endast läsa länktexten.",
              "failureStatementTemplate": "Länkens syfte framgår inte genom att endast läsa länktexten. [ange var och hur det brister]"
            },
            {
              "id": "1.2",
              "requirement": "Länkens syfte framgår genom att läsa länktexten tillsammans med omgivande text.",
              "failureStatementTemplate": "Länkens syfte framgår inte genom att läsa länktexten tillsammans med omgivande text. [ange var och hur det brister]"
            }
          ],
          "ifNo": []
        },
        {
          "id": "2",
          "condition": "Det finns länkade bilder.",
          "logic": "OR",
          "passCriteria": [
            {
              "id": "2.1",
              "requirement": "Länkens syfte framgår genom att endast läsa den maskinläsbara texten för bilden.",
              "failureStatementTemplate": "Länkens syfte framgår inte genom att endast läsa den maskinläsbara texten för bilden. [ange var och hur det brister]"
            }
          ],
          "ifNo": []
        },
        {
          "id": "3",
          "condition": "Det finns länkar som innehåller både bilder och text (exempelvis puffar).",
          "logic": "AND",
          "passCriteria": [
            {
              "id": "3.1",
              "requirement": "Länktexten, inklusive alternativtexter för bilder, är bara så lång som behövs för att beskriva syftet.",
              "failureStatementTemplate": "Länktexten, inklusive alternativtexter för bilder, är onödigt lång. [ange var och hur det brister]"
            },
            {
              "id": "3.2",
              "requirement": "Den maskinläsbara texten för varje länkat innehållsblock beskriver syftet med länken.",
              "failureStatementTemplate": "Den maskinläsbara texten för varje länkat innehållsblock beskriver inte syftet med länken. [ange var och hur det brister]"
            }
          ],
          "ifNo": []
        }
      ],
      "contentType": [
        "navigering-lankar",
        "navigering-navigeringsmenyer"
      ],
      "classifications": [
        {
          "taxonomyId": "wcag22-pour",
          "conceptId": "operable"
        }
      ]
    },
    "krav_pekargester": {
      "id": "krav_pekargester",
      "key": "krav_pekargester",
      "title": "Komplexa fingerrörelser",
      "metadata": {
        "mainCategory": {
          "text": "Touchskärmar, mobila enheter och pekare",
          "key": "touchskarmar-mobila-enheter-och-pekare"
        },
        "subCategory": "",
        "impact": {
          "isCritical": false,
          "primaryScore": 3,
          "secondaryScore": 0,
          "assumedCompliance": false
        }
      },
      "standardReference": {
        "text": "9.2.5.1 Pointer Gestures",
        "url": "https://www.w3.org/WAI/WCAG22/quickref/#pointer-gestures"
      },
      "exceptions": "Funktioner som styrs av webbläsare eller operativsystem, t.ex. horisontell svepning för att navigera i sidhistorik.",
      "examples": "Det går att zooma i ett innehåll med en nyp-rörelser med två fingrar. Ett alternativ behövs som inte kräver två fingrar för att kunna zooma.\nDet går att svepa med fingret till vänster på skärmen (i mobil) för att få fram mer innehåll. Ett alternativ behövs som inte kräver en svepande rörelse för att kunna se mer innehåll.\nEn volymkontroll i en video ska kunna justeras utan en specifik fingerrörelse som kräver en bana.",
      "tips": "",
      "commonErrors": "",
      "expectedObservation": "Alla funktioner ska kunna användas med bara ett finger.\nFunktioner som vanligtvis styrs med rörelser (gester) ska också kunna användas på andra sätt, som inte kräver att man ritar en viss bana med fingret.",
      "instructions": "Identifiera funktioner på sidan som kräver komplexa fingerrörelser, antingen flera fingrar samtidigt eller specifika rörelser.",
      "checks": [
        {
          "id": "1",
          "condition": "Det finns funktioner som styrs genom att flera fingrar används samtidigt på skärmen.",
          "logic": "AND",
          "passCriteria": [
            {
              "id": "1.1",
              "requirement": "Funktionerna går att utföra med ett enda finger (oberoende av rörelsebana).",
              "failureStatementTemplate": "Funktionerna går inte att utföra med ett enda finger (oberoende av rörelsebana). [ange var och hur det brister]"
            }
          ],
          "ifNo": []
        },
        {
          "id": "2",
          "condition": "Det finns funktioner som använder gester som beror på rörelsebanan.",
          "logic": "AND",
          "passCriteria": [
            {
              "id": "2.1",
              "requirement": "Funktionerna går att utföra oberoende av rörelsebanan (med en enda pekare).",
              "failureStatementTemplate": "Funktionerna går inte att utföra oberoende av rörelsebanan (med en enda pekare). [ange var och hur det brister]"
            }
          ],
          "ifNo": []
        }
      ],
      "contentType": [
        "enhetsspecifikt-och-avancerat-touchfunktioner",
        "formular-inmatningsfalt",
        "interaktiva-komponenter-komplexa-interaktiva-komponenter",
        "mediespelare-mediespelare-for-ljud",
        "mediespelare-mediespelare-for-video",
        "sarskilda-hinder-captcha"
      ],
      "classifications": [
        {
          "taxonomyId": "wcag22-pour",
          "conceptId": "operable"
        }
      ]
    },
    "krav_flexibel_layout": {
      "id": "krav_flexibel_layout",
      "key": "krav_flexibel_layout",
      "title": "Flexibel layout",
      "metadata": {
        "mainCategory": {
          "text": "Layout",
          "key": "layout"
        },
        "subCategory": "",
        "impact": {
          "isCritical": false,
          "primaryScore": 1,
          "secondaryScore": 0,
          "assumedCompliance": false
        }
      },
      "standardReference": {
        "text": "9.1.4.10 Reflow",
        "url": "https://www.w3.org/WAI/WCAG22/quickref/#reflow"
      },
      "exceptions": "Skrollning i två ledder är acceptabelt om sidan har innehåll som kräver tvådimensionell layout, till exempel bilder, diagram, datatabeller, kartor, spel och videofilmer.",
      "examples": "",
      "tips": "",
      "commonErrors": "",
      "expectedObservation": "När du har skärmstorleken 1280px*1024px och har zoomat in till 400 % så motsvarar detta en skärmstorlek på 320px*256px i normal förstoring.\n\nIngen information eller funktion går förlorad vid displaybredder ned till 320 CSS-pixlar.\n\nDet krävs inte skrollning i två ledder vid displaybredder ned till 320 CSS-pixlar.\nWebbsidan är*inte*byggd för vertikal skrollning.\nIngen information eller funktion går förlorad vid displayhöjder ned till 256 CSS-pixlar.\nDet krävs inte skrollning i två ledder vid displayhöjder ned till 256 CSS-pixlar.",
      "instructions": "- Använd funktionen Resize i tillägget Web Developer och sätt storleken på fönstret till 1280×1024. Förstora sidan successivt från 100 % till 400 % (Ctrl++) och kontrollera att inga layoutfel uppträder.\n- Använd inspektörläget i webbläsaren och sätt storleken på fönstret till 1280px bredd och 1024px höjd. Förstora sidan successivt från 100 % till 400 % (Ctrl++) och kontrollera att inga layoutfel uppträder.",
      "checks": [
        {
          "id": "1",
          "condition": "Webbsidan är byggd för vertikal skrollning.",
          "logic": "AND",
          "passCriteria": [
            {
              "id": "1.1",
              "requirement": "Ingen information eller funktion går förlorad vid displaybredder ned till 320 CSS-pixlar.",
              "failureStatementTemplate": "Information eller funktioner går förlorat vid displaybredder ned till 320 CSS-pixlar. [ange var och hur det brister]"
            },
            {
              "id": "1.2",
              "requirement": "Det krävs inte skrollning i två ledder vid displaybredder ned till 320 CSS-pixlar.",
              "failureStatementTemplate": "Det krävs skrollning i två ledder vid displaybredder ned till 320 CSS-pixlar. [ange var och hur det brister]"
            }
          ],
          "ifNo": []
        },
        {
          "id": "2",
          "condition": "Webbsidan är*inte*byggd för vertikal skrollning.",
          "logic": "AND",
          "passCriteria": [
            {
              "id": "2.1",
              "requirement": "Ingen information eller funktion går förlorad vid displayhöjder ned till 256 CSS-pixlar.",
              "failureStatementTemplate": "En eller flera information eller funktion går förlorad vid displayhöjder ned till 256 CSS-pixlar. [ange var och hur det brister]"
            },
            {
              "id": "2.2",
              "requirement": "Det krävs inte skrollning i två ledder vid displayhöjder ned till 256 CSS-pixlar.",
              "failureStatementTemplate": "Det krävs inte skrollning i två ledder vid displayhöjder ned till 256 CSS-pixlar gäller inte. [ange var och hur det brister]"
            }
          ],
          "ifNo": []
        }
      ],
      "contentType": [
        "bilder-och-ikoner-bilder",
        "bilder-och-ikoner-ikoner",
        "bilder-och-ikoner-kartor-diagram-och-datavisualisering",
        "formular-inmatningsfalt",
        "formular-knappar",
        "interaktiva-komponenter-komplexa-interaktiva-komponenter",
        "mediespelare-mediespelare-for-ljud",
        "mediespelare-mediespelare-for-video",
        "navigering-lankar",
        "text-och-struktur-listor",
        "text-och-struktur-rubriker",
        "text-och-struktur-tabeller",
        "text-och-struktur-text"
      ],
      "classifications": [
        {
          "taxonomyId": "wcag22-pour",
          "conceptId": "perceivable"
        }
      ]
    },
    "krav_kontrast_i_grafik": {
      "id": "krav_kontrast_i_grafik",
      "key": "krav_kontrast_i_grafik",
      "title": "Kontrast i grafik",
      "metadata": {
        "mainCategory": {
          "text": "Bilder",
          "key": "bilder"
        },
        "subCategory": "",
        "impact": {
          "isCritical": false,
          "primaryScore": 2,
          "secondaryScore": 1,
          "assumedCompliance": false
        }
      },
      "standardReference": {
        "text": "9.1.4.11 Non-text Contrast",
        "url": "https://www.w3.org/WAI/WCAG22/quickref/#non-text-contrast"
      },
      "exceptions": "En specifik presentation krävs för att inte helt förändra informationen eller funktionen och det finns inget tillgängligt sätt att åstadkomma samma funktion.\nInformationen är tillgänglig i ett alternativt format, till exempel som en datatabell nära (eller länkad i anslutning till) ett diagram.\nFotografier av människor eller miljöer.\nFärggradienter som representerar mätvärden (färgdiagram/heat maps)).\nGrafik som är rent dekorativ.\nLogotyper, varumärken, flaggor.",
      "examples": "Exempel kan vara en figurs yttre form eller symboler inuti en figur.\nEtt annat exempel kan vara infografik (t.ex. cirkeldiagram eller stapeldiagram).\n\nExempel på informationsbärande delar i ett diagram är tårtbitar i ett cirkeldiagram eller tätt liggande staplar i ett stapeldiagram. Linjer och kurvor ska ha tillräcklig kontrast mot bakgrunden, men behöver normalt inte uppfylla kontrastkraven mot andra linjer och kurvor.\n\nOm bakgrunden är en gradient, ett fotografi eller något annat som inte har en enhetlig färg, försök avgöra om den informationsbärande delen skulle vara urskiljbar om de färger som ger otillräcklig kontrast ersattes med förgrundsfärgen.",
      "tips": "",
      "commonErrors": "",
      "expectedObservation": "Grafiska element används för att förmedla information. \nDet finns diagram eller infografik. \nAlla informationsbärande delar har ett kontrastförhållande på minst 3:1 mot intilliggande färger.",
      "instructions": "Leta upp grafiska element som förmedlar information.\nAnvänd TPGi Color Contrast Analyzer för att kontrollera att kontrasten är minst 3:1 mot intilliggande färger.",
      "checks": [
        {
          "id": "1",
          "condition": "Grafiska element används för att förmedla information.",
          "logic": "AND",
          "passCriteria": [
            {
              "id": "1.1",
              "requirement": "Grafiska element har ett kontrastförhållande på minst 3:1 mot intilliggande färger.",
              "failureStatementTemplate": "Grafiska element saknar ett kontrastförhållande på minst 3:1 mot intilliggande färger. [ange var och hur det brister]"
            }
          ],
          "ifNo": []
        }
      ],
      "contentType": [
        "bilder-och-ikoner-bilder",
        "bilder-och-ikoner-ikoner",
        "bilder-och-ikoner-kartor-diagram-och-datavisualisering",
        "navigering-navigeringsmenyer"
      ],
      "classifications": [
        {
          "taxonomyId": "wcag22-pour",
          "conceptId": "perceivable"
        }
      ]
    },
    "krav_ikon_symbolknappar": {
      "id": "krav_ikon_symbolknappar",
      "key": "krav_ikon_symbolknappar",
      "title": "Ikon och symbol för knappar eller länkar",
      "metadata": {
        "mainCategory": {
          "text": "Användargränssnitt",
          "key": "anvandargranssnitt"
        },
        "subCategory": {
          "text": "Interaktiva komponenter",
          "key": "interaktiva-komponenter"
        },
        "impact": {
          "isCritical": false,
          "primaryScore": 5,
          "secondaryScore": 1,
          "assumedCompliance": false
        }
      },
      "standardReference": {
        "text": "9.1.3.3 Sensory Characteristics",
        "url": "https://www.w3.org/WAI/WCAG22/quickref/#sensory-characteristics"
      },
      "exceptions": "",
      "examples": "",
      "tips": "",
      "commonErrors": "",
      "expectedObservation": "Knappar eller länkar som bara innehåller symboltecken innehåller även kompletterande maskinläsbar text.\nSyftet med symbolknappar och -länkar går att uppfatta utan synförmåga.",
      "instructions": "- Leta efter knappar eller länkar som bara innehåller symboltecken, särskilt sådana som använder speciella glyf-teckensnitt för tecken som inte har någon definierad betydelse i Unicode.\n- Om du är osäker på om en lösning fungerar, testa med skärmläsare.",
      "checks": [
        {
          "id": "1",
          "condition": "Det finns knappar eller länkar som bara innehåller ikoner eller symboltecken.",
          "logic": "AND",
          "passCriteria": [
            {
              "id": "1.1",
              "requirement": "Syftet med symbolknappar eller -länkar går att uppfatta utan synförmåga.",
              "failureStatementTemplate": "Syftet med symbolknappar eller -länkar går inte att uppfatta utan synförmåga. [ange var och hur det brister]"
            }
          ],
          "ifNo": []
        }
      ],
      "contentType": [
        "formular-knappar",
        "interaktiva-komponenter-komplexa-interaktiva-komponenter",
        "navigering-lankar",
        "navigering-navigeringsmenyer"
      ],
      "classifications": [
        {
          "taxonomyId": "wcag22-pour",
          "conceptId": "perceivable"
        }
      ]
    },
    "krav_tidsgranser": {
      "id": "krav_tidsgranser",
      "key": "krav_tidsgranser",
      "title": "Justera tidsgränser",
      "metadata": {
        "mainCategory": {
          "text": "Generella krav",
          "key": "generella-krav"
        },
        "subCategory": "",
        "impact": {
          "isCritical": false,
          "primaryScore": 6,
          "secondaryScore": 0,
          "assumedCompliance": false
        }
      },
      "standardReference": {
        "text": "9.2.2.1 Timing Adjustable",
        "url": "https://www.w3.org/WAI/WCAG22/quickref/#timing-adjustable"
      },
      "exceptions": "Tidsgränsen behövs för att aktiviteten ska fungera, till exempel vid ett prov, i ett spel, en auktion eller när man köper biljetter till ett tåg som snart avgår. Det går inte att ge mer tid utan att det påverkar syftet.",
      "examples": "- Automatisk utloggning från inloggat läge, utan förvarning.\n- Timeout i varukorg.",
      "tips": "Kontakta aktören om detta krav innan granskningen påbörjas.",
      "commonErrors": "- QR-koden som visas vid inloggning försvinner helt efter 30 sekunder och man måste börja om från början för att kunna logga in.\n- I en e-handel väljer du att \"gå till kassan\". Du har då en begränsad tid på dig att slutföra köpet innan den tid du bokat för hemkörning försvinner.\n- Du får ingen information om hur lång tid du kan vara inaktiv innan du blir utloggad. \n- Du blir automatiskt utloggad utan att få en förvarning om att du blir utloggad eller får en fråga om du vill fortsätta att vara inloggad.",
      "expectedObservation": "Ett eller flera av dessa alternativ förväntas:\n- Det finns tidsbegränsningar, som är mindre än 20 timmar.\n- Det går att stänga av tidsbegränsningen.\n- Det går att justera tidsbegränsningen till minst tio gånger ursprungsvärdet.\n- Det går att förlänga tidsbegränsningen minst tio gånger, med en förvarning på minst 20 sekunder.",
      "instructions": "### Metod 1\n\n- Kontakta aktören och ta reda på om det finns tidsbegränsningar i gränssnittet.\n- Om tidsbegränsningar finns, fråga om längden på dessa och om det går att förlänga, utöka eller ta bort dem.\n- Aktören ska kunna visa hur man utför dessa justeringar.\n- Om aktören inte kan visa detta, underkänn samtliga kontroller för det här kravet.\n\n### Metod 2\n\n- Leta upp en sida där man kan logga in med e-id (t.ex. Freja eller Bank-ID).\n- Ta dig fram till sidan där en QR-kod visas.\n- Stanna kvar på sidan och kontrollera att QR-koden visas i minst fem minuter (QR-koden i sig kan uppdateras oftare).",
      "checks": [
        {
          "id": "1",
          "condition": "Det finns tidsbegränsningar som är kortare än 20 timmar.",
          "logic": "OR",
          "passCriteria": [
            {
              "id": "1.1",
              "requirement": "Det går att stänga av tidsbegränsningen helt.",
              "failureStatementTemplate": "Det är svårt eller omöjligt att stänga av tidsbegränsningen helt. [ange var och hur det brister]"
            },
            {
              "id": "1.2",
              "requirement": "Det går att justera tidsbegränsningen till minst tio gånger ursprungsvärdet.",
              "failureStatementTemplate": "Det är svårt eller omöjligt att justera tidsbegränsningen till minst tio gånger ursprungsvärdet. [ange var och hur det brister]"
            },
            {
              "id": "1.3",
              "requirement": "Det går att förlänga tidsbegränsningen minst tio gånger, med en förvarning på minst 20 sekunder.",
              "failureStatementTemplate": "Det är svårt eller omöjligt att förlänga tidsbegränsningen minst tio gånger, med en förvarning på minst 20 sekunder. [ange var och hur det brister]"
            }
          ],
          "ifNo": []
        }
      ],
      "contentType": [
        "dynamiskt-innehall-uppdaterande-innehall"
      ],
      "classifications": [
        {
          "taxonomyId": "wcag22-pour",
          "conceptId": "operable"
        }
      ]
    },
    "krav_info_och_relationer": {
      "id": "krav_info_och_relationer",
      "key": "krav_info_och_relationer",
      "title": "Information och relationer för visuell presentation",
      "metadata": {
        "mainCategory": {
          "text": "Innehåll",
          "key": "innehall"
        },
        "subCategory": {
          "text": "Semantik",
          "key": "semantik"
        },
        "impact": {
          "isCritical": true,
          "primaryScore": 1,
          "secondaryScore": 2,
          "assumedCompliance": false
        }
      },
      "standardReference": {
        "text": "9.1.3.1 Info and Relationships",
        "url": "https://www.w3.org/WAI/WCAG22/quickref/#info-and-relationships"
      },
      "exceptions": "",
      "examples": "- En grupp formulärelement som hör ihop är grupperade både visuellt och på ett maskinläsbart sätt.\n- Ett informationsblock innehåller bild, rubrik och länk. Innehållet är grupperat på ett maskinläsbart sätt.",
      "tips": "Stäng av CSS och kontrollera om struktur och relationer fortfarande framgår av kod och text.",
      "commonErrors": "- Information grupperas visuellt, men det saknas programmatisk gruppering eller beskrivning i text.\n- En rad med färgade ikoner visas tillsammans, men det finns inget kodmässigt som visar att de hör ihop, och ingen text som beskriver gruppen.\n- Tre stycken radioknappar som ska svara på en fråga har ingen maskinläsbar gruppering.",
      "expectedObservation": "All information, struktur och relationer som visas med visuella medel (position, gruppning eller färg) är också maskinläsbara eller tydligt beskrivna i text.\nDet som hör ihop visuellt hör också ihop i koden, och sammanhanget framgår oavsett visuell presentation.",
      "instructions": "- Kontrollera att information, struktur och relationer som presenteras visuellt, exempelvis med placering, färg, form eller teckensnitt, antingen är maskinläsbara eller finns beskrivna i text. \n- Kontrollera att element som hänger ihop visuellt även hänger ihop programmatiskt.",
      "checks": [
        {
          "id": "1",
          "condition": "Det finns innehåll på sidan som är visuellt strukturerad.",
          "logic": "OR",
          "passCriteria": [
            {
              "id": "1.1",
              "requirement": "Information, strukturer och relationer förmedlas maskinläsbart.",
              "failureStatementTemplate": "Information, strukturer och relationer förmedlas inte maskinläsbart. [ange var och hur det brister]"
            },
            {
              "id": "1.2",
              "requirement": "Information, strukturer och relationer som inte förmedlas maskinläsbart finns beskrivna i text.",
              "failureStatementTemplate": "Information, strukturer och relationer som inte förmedlas maskinläsbart, finns inte beskrivna i text. [ange var och hur det brister]"
            }
          ],
          "ifNo": []
        }
      ],
      "contentType": [
        "bilder-och-ikoner-bilder",
        "bilder-och-ikoner-ikoner",
        "bilder-och-ikoner-kartor-diagram-och-datavisualisering",
        "teknisk-grundstruktur-roller-och-egenskaper-i-koden",
        "text-och-struktur-landmarken",
        "text-och-struktur-text"
      ],
      "classifications": [
        {
          "taxonomyId": "wcag22-pour",
          "conceptId": "perceivable"
        }
      ]
    },
    "krav_farganvandning_for_lankar": {
      "id": "krav_farganvandning_for_lankar",
      "key": "krav_farganvandning_for_lankar",
      "title": "Färganvändning för länkar",
      "metadata": {
        "mainCategory": {
          "text": "Innehåll",
          "key": "innehall"
        },
        "subCategory": {
          "text": "Länkar",
          "key": "lankar"
        },
        "impact": {
          "isCritical": false,
          "primaryScore": 3,
          "secondaryScore": 1,
          "assumedCompliance": false
        }
      },
      "standardReference": {
        "text": "9.1.4.1 Use of Color",
        "url": "https://www.w3.org/WAI/WCAG22/quickref/#use-of-color"
      },
      "exceptions": "Länkar i menyer behöver inte vara visuellt markerade som länkar. Med meny avses en samling av länkar i sidans topp eller vänsterkant och som enbart används för navigation.",
      "examples": "Ett vanligt sätt är att låta länkar vara understrukna. \nEtt annat vanligt sätt är att placera en ikon i anslutning till länken istället för att använda understrykning.",
      "tips": "Gör om sidan till gråskala (i Wave -> Contrast -> Desaturate page) och se om du fortfarande kan identifiera länkarna rent visuellt.",
      "commonErrors": "",
      "expectedObservation": "Det går att identifiera länkar på annat sätt än att länkarna har en avvikande färg.",
      "instructions": "Leta efter länkar, fristående i löpande text, fraser eller i meningar. Där letar du efter länkar som saknar en visuell indikering utöver färg för att visa att de är länkar (exempelvis understrykning eller ikon).",
      "checks": [
        {
          "id": "1",
          "condition": "Sidan använder länkar i löpande text, fraser eller i meningar.",
          "logic": "AND",
          "passCriteria": [
            {
              "id": "1.1",
              "requirement": "Det går att identifiera länkar på annat sätt än att länkarna har en avvikande färg.",
              "failureStatementTemplate": "Det är svårt eller omöjligt att identifiera länkar på annat sätt än att länkarna har en avvikande färg. [ange var och hur det brister]"
            }
          ],
          "ifNo": []
        }
      ],
      "contentType": [
        "navigering-lankar",
        "navigering-navigeringsmenyer"
      ],
      "classifications": [
        {
          "taxonomyId": "wcag22-pour",
          "conceptId": "perceivable"
        }
      ]
    },
    "krav_en_knapps_snabbtangenter": {
      "id": "krav_en_knapps_snabbtangenter",
      "key": "krav_en_knapps_snabbtangenter",
      "title": "En-knapps snabbtangenter",
      "metadata": {
        "mainCategory": {
          "text": "Avvikande sidor",
          "key": "avvikande-sidor"
        },
        "subCategory": "",
        "impact": {
          "isCritical": false,
          "primaryScore": 2,
          "secondaryScore": 1,
          "assumedCompliance": false
        }
      },
      "standardReference": {
        "text": "9.2.1.4 Character Key Shortcuts",
        "url": "https://www.w3.org/WAI/WCAG22/quickref/#character-key-shortcuts"
      },
      "exceptions": "",
      "examples": "Tryck på \"D\" stänger ett dokument direkt.\nTryck på \"S\" skickar ett formulär.",
      "tips": "",
      "commonErrors": "",
      "expectedObservation": "Det går att stänga av snabbtangenten.\nDet går att byta ut snabbtangenten så att den använder en eller flera modifierartangenter.\nSnabbtangenten är bara aktiv när komponenten ifråga har fokus.",
      "instructions": "Tryck på alla tangenter som genererar ett tecken, en efter en.",
      "checks": [
        {
          "id": "1",
          "condition": "Det finns snabbtangenter som aktiveras med en enda tangent, t.ex. utan att man håller nere Ctrl, Alt eller liknande.",
          "logic": "OR",
          "passCriteria": [
            {
              "id": "1.1",
              "requirement": "Det går att stänga av snabbtangenten.",
              "failureStatementTemplate": "Det är svårt eller omöjligt att stänga av snabbtangenten. [ange var och hur det brister]"
            },
            {
              "id": "1.2",
              "requirement": "Det går att byta ut snabbtangenten så att den använder en eller flera modifierartangenter.",
              "failureStatementTemplate": "Det är svårt eller omöjligt att byta ut snabbtangenten så att den använder en eller flera modifierartangenter. [ange var och hur det brister]"
            },
            {
              "id": "1.3",
              "requirement": "Snabbtangenten är bara aktiv när komponenten ifråga har fokus.",
              "failureStatementTemplate": "Snabbtangenten är inte bara aktiv när komponenten ifråga har fokus. [ange var och hur det brister]"
            }
          ],
          "ifNo": []
        }
      ],
      "contentType": [
        "interaktiva-komponenter-komplexa-interaktiva-komponenter"
      ],
      "classifications": [
        {
          "taxonomyId": "wcag22-pour",
          "conceptId": "operable"
        }
      ]
    },
    "krav_orientering": {
      "id": "krav_orientering",
      "key": "krav_orientering",
      "title": "Orientering (stående eller liggande)",
      "metadata": {
        "mainCategory": {
          "text": "Touchskärmar, mobila enheter och pekare",
          "key": "touchskarmar-mobila-enheter-och-pekare"
        },
        "subCategory": "",
        "impact": {
          "isCritical": false,
          "primaryScore": 2,
          "secondaryScore": 1,
          "assumedCompliance": false
        }
      },
      "standardReference": {
        "text": "9.1.3.4 Orientation",
        "url": "https://www.w3.org/WAI/WCAG22/quickref/#orientation"
      },
      "exceptions": "Om gränssnittet är av en sådan karaktär att den mobila enheten måste hållas i ett visst läge (stående eller liggande) så gäller inte detta krav.",
      "examples": "",
      "tips": "",
      "commonErrors": "",
      "expectedObservation": "Kontroll av skärmorientering \n- Innehåll och funktion är**inte**begränsade till en viss orientering (stående eller liggande). Innehållet ska anpassa sig efter orienteringen. \n- Om det finns en föredragen orientering ska det inte öppnas en funktion som efterfrågar användaren att ändra orientering. Detta ska helt ske på användarens villkor.",
      "instructions": "Vrid den mobila enheten 90° och kontrollera att innehållet anpassar sig (eller går att anpassa) efter orienteringen, alltså att textriktningen ändras så att den följer orienteringen. Gränssnittet i sin helhet går att använda oavsett om enheten används i liggande eller stående läge.",
      "checks": [
        {
          "id": "1",
          "condition": "Webbsidan kan användas oberoende av enhetens orientering (stående eller liggande).",
          "logic": "AND",
          "passCriteria": [
            {
              "id": "1.1",
              "requirement": "Det går att ändra orientering på innehållet genom att vrida på enheten.",
              "failureStatementTemplate": "Det går inte att ändra orientering på innehållet genom att vrida på enheten. [ange var och hur det brister]"
            },
            {
              "id": "1.2",
              "requirement": "Användaren får ingen uppmaning om att ändra orientering.",
              "failureStatementTemplate": "Användaren får en uppmaning om att ändra orientering. [ange var och hur det brister]"
            }
          ],
          "ifNo": []
        },
        {
          "id": "2",
          "condition": "Webbsidan kan enbart användas/visas om enheten är i en viss orientering (stående eller liggande).",
          "logic": "AND",
          "passCriteria": [
            {
              "id": "2.1",
              "requirement": "Innehållet är av sådan karaktär att det kräver en viss orientering för att fungera.",
              "failureStatementTemplate": "Innehållet är inte av en sådan karaktär att det kräver en viss orientering för att fungera. [ange var och hur det brister]"
            }
          ],
          "ifNo": []
        }
      ],
      "contentType": [
        "enhetsspecifikt-och-avancerat-touchfunktioner"
      ],
      "classifications": [
        {
          "taxonomyId": "wcag22-pour",
          "conceptId": "perceivable"
        }
      ]
    },
    "krav_kontrast_for_bilder_av_text": {
      "id": "krav_kontrast_for_bilder_av_text",
      "key": "krav_kontrast_for_bilder_av_text",
      "title": "Kontrast (minimum) för text i bilder",
      "metadata": {
        "mainCategory": {
          "text": "Bilder",
          "key": "bilder"
        },
        "subCategory": "",
        "impact": {
          "isCritical": true,
          "primaryScore": 2,
          "secondaryScore": 1,
          "assumedCompliance": false
        }
      },
      "standardReference": {
        "text": "9.1.4.3 Contrast (Minimum)",
        "url": "https://www.w3.org/WAI/WCAG22/quickref/#contrast-minimum"
      },
      "exceptions": "",
      "examples": "",
      "tips": "",
      "commonErrors": "",
      "expectedObservation": "- Bilder av text som är minst 18 punkter (24 px) eller 14 punkter och fet (19 px) har ett kontrastförhållande på minst 3:1 mot bakgrunden.\n- Bilder av mindre text har ett kontrastförhållande på minst 4,5:1 mot bakgrunden.",
      "instructions": "- Identifiera alla bilder av text, dvs bilder som innehåller meningsbärande text.\n- Texten ska vara en del av bilden, inte lagt \"ovanpå\" bilden med CSS. \n- Mät kontrasten mellan text och bakgrund (i själva bilden) på det ställe där den är sämst.",
      "checks": [
        {
          "id": "1",
          "condition": "Det finns bilder som innehåller meningsbärande text",
          "logic": "AND",
          "passCriteria": [
            {
              "id": "1.1",
              "requirement": "Bilder av text som är minst 18 punkter (24 px) eller 14 punkter och fet (19 px) har ett kontrastförhållande på minst 3:1 mot bakgrunden.",
              "failureStatementTemplate": "Bilder av text som är lägre än 18 punkter (24 px) eller 14 punkter och fet (19 px) har ett kontrastförhållande på minst 3:1 mot bakgrunden. [ange var och hur det brister]"
            },
            {
              "id": "1.2",
              "requirement": "Bilder av mindre text har ett kontrastförhållande på minst 4,5:1 mot bakgrunden.",
              "failureStatementTemplate": "Bilder av mindre text saknar ett kontrastförhållande på minst 4,5:1 mot bakgrunden. [ange var och hur det brister]"
            }
          ],
          "ifNo": []
        }
      ],
      "contentType": [
        "bilder-och-ikoner-bilder"
      ],
      "classifications": [
        {
          "taxonomyId": "wcag22-pour",
          "conceptId": "perceivable"
        }
      ]
    },
    "krav_uppdykande_innehall_vid_fokus": {
      "id": "krav_uppdykande_innehall_vid_fokus",
      "key": "krav_uppdykande_innehall_vid_fokus",
      "title": "Uppdykande innehåll vid fokus",
      "metadata": {
        "mainCategory": {
          "text": "Tangentbord",
          "key": "tangentbord"
        },
        "subCategory": {
          "text": "Fokus",
          "key": "fokus"
        },
        "impact": {
          "isCritical": false,
          "primaryScore": 2,
          "secondaryScore": 0,
          "assumedCompliance": false
        }
      },
      "standardReference": {
        "text": "9.1.4.13 Content on Hover or Focus",
        "url": "https://www.w3.org/WAI/WCAG22/quickref/#content-on-hover-or-focus"
      },
      "exceptions": "Innehåll som enbart styrs av webbläsaren, t.ex. tooltips som visas när title-attributet används. \nDet kan även vara HTML-valideringsmeddelanden som webbläsaren visar, t.ex. om man glömt att fylla i ett obligatoriskt fält.",
      "examples": "Det innehåll som ändras kan t.ex. vara att bilden förändras när bilden får fokus. Det kan t.ex. röra sig om bilden på en e-handels produktsida.",
      "tips": "",
      "commonErrors": "När ett element får fokus så visas en tooltip, men dess innehåll sträcker sig utanför webbläsarens ytterkanter (viewport).",
      "expectedObservation": "När ett objekt på sidan får fokus så ändras innehållet. \nOm ett nytt innehåll visas vid fokus på ett objekt så ska du kunna få tillbaka det tidigare innehållet utan att objektet förlorar fokus, t.ex. genom att trycka Esc.",
      "instructions": "- Navigera (tabba) genom alla fokuserbara element på sidan med tangentbordet.\n- Zooma in till 200 % och navigera (tabba) åter genom alla fokuserbara element på sidan med tangentbordet.",
      "checks": [
        {
          "id": "1",
          "condition": "Det finns innehåll som visas medan ett element har fokus.",
          "logic": "AND",
          "passCriteria": [
            {
              "id": "1.1",
              "requirement": "Det går att dölja det visade innehållet utan att flytta fokus.",
              "failureStatementTemplate": "Det är svårt eller omöjligt att dölja det visade innehållet utan att flytta fokus. [ange var och hur det brister]"
            },
            {
              "id": "1.2",
              "requirement": "Det nya synliga innehållet förblir synligt tills användaren flyttar fokus, väljer att dölja det nya innehållet, eller tills det nya innehållet inte längre är relevant.",
              "failureStatementTemplate": "Det nya synliga innehållet förblir synligt tills användaren flyttar fokus, väljer att dölja det nya innehållet, eller tills det nya innehållet inte längre är inte relevant. [ange var och hur det brister]"
            }
          ],
          "ifNo": []
        },
        {
          "id": "2",
          "condition": "Zooma till 200 %. Det finns innehåll som visas medan ett element har fokus.",
          "logic": "AND",
          "passCriteria": [
            {
              "id": "2.1",
              "requirement": "Det går att dölja det visade innehållet utan att flytta fokus.",
              "failureStatementTemplate": "Det är svårt eller omöjligt att dölja det visade innehållet utan att flytta fokus. [ange var och hur det brister]"
            },
            {
              "id": "2.2",
              "requirement": "Det nya synliga innehållet förblir synligt tills användaren flyttar fokus, väljer att dölja det nya innehållet, eller tills det nya innehållet inte längre är relevant.",
              "failureStatementTemplate": "Det nya synliga innehållet förblir synligt tills användaren flyttar fokus, väljer att dölja det nya innehållet, eller tills det nya innehållet inte längre är inte relevant. [ange var och hur det brister]"
            }
          ],
          "ifNo": []
        }
      ],
      "contentType": [
        "formular-inmatningsfalt",
        "formular-knappar",
        "interaktiva-komponenter-komplexa-interaktiva-komponenter",
        "mediespelare-mediespelare-for-ljud",
        "mediespelare-mediespelare-for-video",
        "navigering-lankar",
        "navigering-navigeringsmenyer"
      ],
      "classifications": [
        {
          "taxonomyId": "wcag22-pour",
          "conceptId": "perceivable"
        }
      ]
    },
    "krav_innehallets_ordning": {
      "id": "krav_innehallets_ordning",
      "key": "krav_innehallets_ordning",
      "title": "Innehållets ordning",
      "metadata": {
        "mainCategory": {
          "text": "Generella krav",
          "key": "generella-krav"
        },
        "subCategory": "",
        "impact": {
          "isCritical": false,
          "primaryScore": 1,
          "secondaryScore": 2,
          "assumedCompliance": false
        }
      },
      "standardReference": {
        "text": "9.1.3.2 Meaningful Sequence",
        "url": "https://www.w3.org/WAI/WCAG22/quickref/#meaningful-sequence"
      },
      "exceptions": "",
      "examples": "",
      "tips": "",
      "commonErrors": "",
      "expectedObservation": "Innehållet kommer i en begriplig maskinläsbar ordning som överensstämmer med den visuella presentationen.",
      "instructions": "### Metod 1\n\nÖppna sidan i två olika flikar och stäng av sidans CSS i den ena fliken. Jämför de två flikarna för att se om ordningen utan CSS är begriplig.\n\n### Metod 2\n\nAnvänd en skärmläsare och navigera igenom hela innehållet med piltangenter (inte Tabb). Jämför med den visuella ordningen.",
      "checks": [
        {
          "id": "1",
          "condition": "Innehållet på sidan behöver ligga i en viss ordning",
          "logic": "AND",
          "passCriteria": [
            {
              "id": "1.1",
              "requirement": "Innehållet kommer i en begriplig maskinläsbar ordning som överensstämmer med den visuella presentationen.",
              "failureStatementTemplate": "Innehållet kommer i en obegriplig maskinläsbar ordning som avviker från den visuella presentationen. [ange var och hur det brister]"
            }
          ],
          "ifNo": []
        }
      ],
      "contentType": [
        "navigering-navigeringsmenyer",
        "teknisk-grundstruktur-roller-och-egenskaper-i-koden",
        "text-och-struktur-landmarken"
      ],
      "classifications": [
        {
          "taxonomyId": "wcag22-pour",
          "conceptId": "perceivable"
        }
      ]
    },
    "krav_sprak_for_textalternativ": {
      "id": "krav_sprak_for_textalternativ",
      "key": "krav_sprak_for_textalternativ",
      "title": "Språk för textalternativ",
      "metadata": {
        "mainCategory": {
          "text": "Bilder",
          "key": "bilder"
        },
        "subCategory": {
          "text": "Textalternativ",
          "key": "textalternativ"
        },
        "impact": {
          "isCritical": false,
          "primaryScore": 1,
          "secondaryScore": 4,
          "assumedCompliance": false
        }
      },
      "standardReference": {
        "text": "9.3.1.2 Language of Parts",
        "url": "https://www.w3.org/WAI/WCAG22/quickref/#language-of-parts"
      },
      "exceptions": "- egennamn, \n- tekniska termer, \n- ord på obestämt språk, \n- låneord och fraser som tagits upp i den omgivande textens språk",
      "examples": "",
      "tips": "",
      "commonErrors": "",
      "expectedObservation": "Det finns bilder med textalternativ på annat språk än omgivande text på sidan.  \nBildelementet eller omslutande element anger språkändringen.",
      "instructions": "Leta efter bilder med textalternativ som har annat språk än huvudinnehållet på sidan.\nAnvänd bookmarklet/ Web Developer tillägget, och leta efter textalternativ på annat språk. \nInspektera koden för bildelement manuellt och leta efter språkattribut.",
      "checks": [
        {
          "id": "1",
          "condition": "Det finns bilder med textalternativ på annat språk än omgivande text.",
          "logic": "AND",
          "passCriteria": [
            {
              "id": "1.1",
              "requirement": "Bildelementet anger språkändringen.",
              "failureStatementTemplate": "Bildelementet anger språkändringen gäller inte. [ange var och hur det brister]"
            }
          ],
          "ifNo": []
        }
      ],
      "contentType": [
        "bilder-och-ikoner-bilder",
        "bilder-och-ikoner-ikoner",
        "bilder-och-ikoner-kartor-diagram-och-datavisualisering",
        "sprak-sprak-i-delar-av-sidan"
      ],
      "classifications": [
        {
          "taxonomyId": "wcag22-pour",
          "conceptId": "understandable"
        }
      ]
    },
    "krav_flimmer": {
      "id": "krav_flimmer",
      "key": "krav_flimmer",
      "title": "Tre blinkningar eller under tröskelvärdet",
      "metadata": {
        "mainCategory": {
          "text": "Störande",
          "key": "storande"
        },
        "subCategory": "",
        "impact": {
          "isCritical": false,
          "primaryScore": 1,
          "secondaryScore": 0,
          "assumedCompliance": false
        }
      },
      "standardReference": {
        "text": "9.2.3.1 Three Flashes or Below Threshold",
        "url": "https://www.w3.org/WAI/WCAG22/quickref/#three-flashes-or-below-threshold"
      },
      "exceptions": "Innehåll som flimrar på grund av: \n- dålig uppkoppling hos användaren. \n- enhetsdisplayen och inte innehållet i sig.",
      "examples": "Ett videoklipp eller en animerad bild med en serie stroboskopblixtar eller närbilder av snabba explosioner.",
      "tips": "",
      "commonErrors": "",
      "expectedObservation": "Webbsidor innehåller inget som blinkar mer än tre gånger under någon ensekundsperiod. Blinkningen ligger under de allmänna gränsvärdena för blinkningar och röd blinkning. Detta berör sådant flimmer där \"aktören\" påverkar innehållet, inte webbläsaren i sig.",
      "instructions": "- Ladda (om) sidan och titta efter innehåll som flimrar eller blinkar snabbt.\n- Innehåll ska granskas i den största skalan användaren kan se innehållet i.\n- Ladda (om) sidan och titta efter innehåll som flimrar eller blinkar snabbt.\n- Leta efter innehåll som blinkar med rött ljus.",
      "checks": [
        {
          "id": "1",
          "condition": "Det finns innehåll som flimrar mer än 3 gånger under en sekund på en yta som överskrider gränsvärdet.",
          "logic": "AND",
          "passCriteria": [
            {
              "id": "1.1",
              "requirement": "Luminansskillanden är under tröskelvärdet.",
              "failureStatementTemplate": "Luminansskillanden är inte under tröskelvärdet. [ange var och hur det brister]"
            },
            {
              "id": "1.2",
              "requirement": "Inget par av övergångar innehåller mättat röd färg.",
              "failureStatementTemplate": "Ett eller flera par av övergångar innehåller mättat röd färg. [ange var och hur det brister]"
            }
          ],
          "ifNo": []
        },
        {
          "id": "2",
          "condition": "Det finns innehåll som blinkar med röd färg.",
          "logic": "AND",
          "passCriteria": [
            {
              "id": "2.1",
              "requirement": "Det som blinkar med röd färg kan uppfattas som intensivt eller störande.",
              "failureStatementTemplate": "Det som blinkar med röd färg kan inte uppfattas som intensivt eller störande. [ange var och hur det brister]"
            }
          ],
          "ifNo": []
        }
      ],
      "contentType": [
        "dynamiskt-innehall-rorliga-element",
        "dynamiskt-innehall-uppdaterande-innehall"
      ],
      "classifications": [
        {
          "taxonomyId": "wcag22-pour",
          "conceptId": "operable"
        }
      ]
    },
    "krav_hanterbart_med_tangentbord": {
      "id": "krav_hanterbart_med_tangentbord",
      "key": "krav_hanterbart_med_tangentbord",
      "title": "Hantera enbart med tangentbord",
      "metadata": {
        "mainCategory": {
          "text": "Tangentbord",
          "key": "tangentbord"
        },
        "subCategory": {
          "text": "Hanterbart",
          "key": "hanterbart"
        },
        "impact": {
          "isCritical": true,
          "primaryScore": 3,
          "secondaryScore": 1,
          "assumedCompliance": false
        }
      },
      "standardReference": {
        "text": "9.2.1.1 Keyboard",
        "url": "https://www.w3.org/WAI/WCAG22/quickref/#keyboard"
      },
      "exceptions": "Funktioner som kräver fri handrörelse för att utföras på ett meningsfullt sätt, t.ex. frihandsritning eller att signera med en penna, behöver inte vara tillgängliga via tangentbord.",
      "examples": "",
      "tips": "",
      "commonErrors": "Interaktiva element kan inte nås med tangentbord, t.ex. knappar eller länkar som bara fungerar med mus.\n\nFunktion kräver musklick och har inget tangentbordsalternativ, t.ex. anpassade dropdown-menyer som inte går att öppna med tangentbordet.\n\nDet går bara att bifoga filer genom att \"dra-och-släppa\". Det går inte att bifoga en fil enbart genom att använda tangentbordet. \n\nKomplicerade filterfunktioner som bygger på multifiltrering med flera alternativ som aktiveras med mus.",
      "expectedObservation": "Alla funktioner går att nå med tangentbordet.\nAlla funktioner går att aktivera med tangentbordet.\nEn åtgärd kan utföras med en enskild tangenttryckning utan krav på snabbhet.\nEn åtgärd kan utföras utan att en tangent behöver hållas ned under en viss tid.",
      "instructions": "Pröva att använda alla funktioner med tangentbordet.",
      "checks": [
        {
          "id": "1",
          "condition": "Alla funktioner är fullt möjliga att utföra med tangentbordet utan krav på samtidig, snabb eller långvarig tangenttryckning.",
          "logic": "AND",
          "passCriteria": [
            {
              "id": "1.1",
              "requirement": "Alla funktioner går att nå med tangentbordet.",
              "failureStatementTemplate": "Någon eller några funktioner går att nå med tangentbordet.. [ange var och hur det brister]"
            },
            {
              "id": "1.2",
              "requirement": "Alla funktioner går att aktivera med tangentbordet.",
              "failureStatementTemplate": "Någon eller några funktioner går att aktivera med tangentbordet.. [ange var och hur det brister]"
            },
            {
              "id": "1.3",
              "requirement": "En åtgärd kan utföras med en enskild tangenttryckning utan krav på snabbhet.",
              "failureStatementTemplate": "En åtgärd kan inte utföras med en enskild tangenttryckning utan krav på snabbhet. [ange var och hur det brister]"
            },
            {
              "id": "1.4",
              "requirement": "En åtgärd kan utföras utan att en tangent behöver hållas ned under en viss tid.",
              "failureStatementTemplate": "En åtgärd kan inte utföras utan att en tangent behöver hållas ned under en viss tid. [ange var och hur det brister]"
            }
          ],
          "ifNo": []
        }
      ],
      "contentType": [
        "bilder-och-ikoner-bilder",
        "bilder-och-ikoner-ikoner",
        "bilder-och-ikoner-kartor-diagram-och-datavisualisering",
        "formular-inmatningsfalt",
        "formular-knappar",
        "interaktiva-komponenter-komplexa-interaktiva-komponenter",
        "mediespelare-mediespelare-for-ljud",
        "mediespelare-mediespelare-for-video",
        "navigering-lankar",
        "navigering-navigeringsmenyer"
      ],
      "classifications": [
        {
          "taxonomyId": "wcag22-pour",
          "conceptId": "operable"
        }
      ]
    },
    "krav_kontextforandring_vid_inmatning": {
      "id": "krav_kontextforandring_vid_inmatning",
      "key": "krav_kontextforandring_vid_inmatning",
      "title": "Kontextförändring vid inmatning",
      "metadata": {
        "mainCategory": {
          "text": "Användargränssnitt",
          "key": "anvandargranssnitt"
        },
        "subCategory": {
          "text": "Beteende",
          "key": "beteende"
        },
        "impact": {
          "isCritical": false,
          "primaryScore": 4,
          "secondaryScore": 0,
          "assumedCompliance": false
        }
      },
      "standardReference": {
        "text": "9.3.2.2 On Input",
        "url": "https://www.w3.org/WAI/WCAG22/quickref/#on-input"
      },
      "exceptions": "Användaren får information på förhand om kontextförändringar som sker vid inmatning.",
      "examples": "Vid val i en rullgardinslista tillkommer nya fält efter rullgardinslistan, men fokus ligger kvar på komponenten.",
      "tips": "Detta krav handlar om användarens fokus, inte om vad som sker på sidan i övrigt.",
      "commonErrors": "- En ny sida laddas så snart personen väljer ett alternativ i en rullgardinslista.\n- Fokus flyttas till ett nytt fält när personen skrivit in ett visst antal tecken.",
      "expectedObservation": "Ingen kontextförändring sker till följd av att man ändrar värdet i en komponent.\nEn kontextförändring är när ditt fokus flyttas från den ursprungliga positionen.",
      "instructions": "- Hitta alla interaktiva komponenter och inmatningsfält på sidan. \n- Gör ändringar genom att mata in data i inmatningsfält, klicka i checkboxar och radioknappar, gör val i listor osv. \n- Notera om det sker en kontextförändring utan att du informeras om det på förhand.",
      "checks": [
        {
          "id": "1",
          "condition": "Det finns formulärkomponenter på sidan.",
          "logic": "OR",
          "passCriteria": [
            {
              "id": "1.1",
              "requirement": "Ingen kontextförändring sker till följd av att man ändrar värdet i en komponent.",
              "failureStatementTemplate": "En eller flera kontextförändring sker till följd av att man ändrar värdet i en komponent. [ange var och hur det brister]"
            },
            {
              "id": "1.2",
              "requirement": "Användaren får information om kontextförändringen innan den sker.",
              "failureStatementTemplate": "Användaren får inte information om kontextförändringen innan den sker. [ange var och hur det brister]"
            }
          ],
          "ifNo": []
        }
      ],
      "contentType": [
        "formular-inmatningsfalt",
        "navigering-navigeringsmenyer",
        "sarskilda-hinder-captcha"
      ],
      "classifications": [
        {
          "taxonomyId": "wcag22-pour",
          "conceptId": "understandable"
        }
      ]
    },
    "krav_ljudkontroll": {
      "id": "krav_ljudkontroll",
      "key": "krav_ljudkontroll",
      "title": "Ljudkontroll",
      "metadata": {
        "mainCategory": {
          "text": "Störande",
          "key": "storande"
        },
        "subCategory": "",
        "impact": {
          "isCritical": false,
          "primaryScore": 2,
          "secondaryScore": 1,
          "assumedCompliance": false
        }
      },
      "standardReference": {
        "text": "9.1.4.2 Audio Control",
        "url": "https://www.w3.org/WAI/WCAG22/quickref/#audio-control"
      },
      "exceptions": "",
      "examples": "",
      "tips": "",
      "commonErrors": "",
      "expectedObservation": "Om ljud spelas upp automatiskt och om ljudet spelas i mer än tre sekunder så finns det antingen en funktion för att pausa eller stoppa ljudet, eller så går det att reglera volymen för detta specifika ljud utan att övriga ljudkällor påverkas.",
      "instructions": "Ladda (om) sidan och lyssna efter ljud som spelas upp automatiskt och där ljudet hörs i mer än tre sekunder.",
      "checks": [
        {
          "id": "1",
          "condition": "Ljud spelas upp automatiskt när sidan laddas och detta ljud varar i mer än 3 sekunder.",
          "logic": "OR",
          "passCriteria": [
            {
              "id": "1.1",
              "requirement": "Ljudet går att pausa eller stoppa.",
              "failureStatementTemplate": "Ljudet går inte att pausa eller stoppa. [ange var och hur det brister]"
            },
            {
              "id": "1.2",
              "requirement": "Ljudvolymen går att reglera separat från övrigt ljud på enheten.",
              "failureStatementTemplate": "Ljudvolymen går inte att reglera separat från övrigt ljud på enheten. [ange var och hur det brister]"
            }
          ],
          "ifNo": []
        }
      ],
      "contentType": [
        "ljud-och-video-ljudklipp",
        "ljud-och-video-video-eller-filmklipp",
        "mediespelare-mediespelare-for-ljud",
        "mediespelare-mediespelare-for-video"
      ],
      "classifications": [
        {
          "taxonomyId": "wcag22-pour",
          "conceptId": "perceivable"
        }
      ]
    },
    "krav_rorligt_innehall": {
      "id": "krav_rorligt_innehall",
      "key": "krav_rorligt_innehall",
      "title": "Pausa eller stäng av rörelser",
      "metadata": {
        "mainCategory": {
          "text": "Störande",
          "key": "storande"
        },
        "subCategory": "",
        "impact": {
          "isCritical": false,
          "primaryScore": 6,
          "secondaryScore": 0,
          "assumedCompliance": false
        }
      },
      "standardReference": {
        "text": "9.2.2.2 Pause, Stop, Hide",
        "url": "https://www.w3.org/WAI/WCAG22/quickref/#pause-stop-hide"
      },
      "exceptions": "Förloppsindikator, indikator på att sidan fortfarande laddas. (\"spinner\", \"skeleton\")",
      "examples": "Bakgrundsanimeringar och videos som startar automatiskt.",
      "tips": "",
      "commonErrors": "Videobakgrunder som startar automatiskt men inte går att pausa.",
      "expectedObservation": "Det ska gå att pausa, stoppa eller dölja allt rörligt, blinkande eller skrollande innehåll som varar längre än 5 sekunder.",
      "instructions": "Leta efter innehåll som rör sig, blinkar, skrollar eller som uppdateras automatiskt. Leta efter en metod/funktion för att pausa, stoppa eller dölja detta.",
      "checks": [
        {
          "id": "1",
          "condition": "Det finns innehåll som rör sig under mer än 5 sekunder.",
          "logic": "AND",
          "passCriteria": [
            {
              "id": "1.1",
              "requirement": "Det går att pausa, stoppa eller dölja rörelsen.",
              "failureStatementTemplate": "Det är svårt eller omöjligt att pausa, stoppa eller dölja rörelsen. [ange var och hur det brister]"
            }
          ],
          "ifNo": []
        },
        {
          "id": "2",
          "condition": "Det finns innehåll som blinkar under mer än 5 sekunder.",
          "logic": "AND",
          "passCriteria": [
            {
              "id": "2.1",
              "requirement": "Det går att pausa, stoppa eller dölja blinkningarna.",
              "failureStatementTemplate": "Det är svårt eller omöjligt att pausa, stoppa eller dölja blinkningarna. [ange var och hur det brister]"
            }
          ],
          "ifNo": []
        },
        {
          "id": "3",
          "condition": "Det finns innehåll som skrollar automatiskt under mer än 5 sekunder.",
          "logic": "AND",
          "passCriteria": [
            {
              "id": "3.1",
              "requirement": "Det går att pausa, stoppa eller dölja skrollningen.",
              "failureStatementTemplate": "Det är svårt eller omöjligt att pausa, stoppa eller dölja skrollningen. [ange var och hur det brister]"
            }
          ],
          "ifNo": []
        },
        {
          "id": "4",
          "condition": "Det finns innehåll som uppdateras automatiskt.",
          "logic": "AND",
          "passCriteria": [
            {
              "id": "4.1",
              "requirement": "Det går att pausa, stoppa eller dölja uppdateringarna.",
              "failureStatementTemplate": "Det är svårt eller omöjligt att pausa, stoppa eller dölja uppdateringarna. [ange var och hur det brister]"
            }
          ],
          "ifNo": []
        }
      ],
      "contentType": [
        "dynamiskt-innehall-rorliga-element",
        "dynamiskt-innehall-uppdaterande-innehall",
        "ljud-och-video-animeringar-utan-ljud",
        "ljud-och-video-video-eller-filmklipp"
      ],
      "classifications": [
        {
          "taxonomyId": "wcag22-pour",
          "conceptId": "operable"
        }
      ]
    },
    "krav_sidans_sprak": {
      "id": "krav_sidans_sprak",
      "key": "krav_sidans_sprak",
      "title": "Sidans språk",
      "metadata": {
        "mainCategory": {
          "text": "Innehåll",
          "key": "innehall"
        },
        "subCategory": "",
        "impact": {
          "isCritical": false,
          "primaryScore": 1,
          "secondaryScore": 4,
          "assumedCompliance": false
        }
      },
      "standardReference": {
        "text": "9.3.1.1 Language of Page",
        "url": "https://www.w3.org/WAI/WCAG22/quickref/#language-of-page"
      },
      "exceptions": "",
      "examples": "I källkoden finns en <html>-tagg med attributet lang=\"sv\" om sidan är på svenska.",
      "tips": "",
      "commonErrors": "Språket för sidan är inte angiven i koden.\nSidan kan ställas om till flera språk, men språket för sidan ändras inte i koden.",
      "expectedObservation": "Sidans huvudsakliga språk är maskinläsbart. Språkkoden är giltig och matchar sidinnehållets språk.",
      "instructions": "Kontrollera i källkoden att standarspråket finns angivet. I <html>-taggen för sidan (hittas högst upp i källkoden) ska språket vara angivet med attributet lang.",
      "checks": [
        {
          "id": "1",
          "condition": "Sidan är byggd med HTML.",
          "logic": "AND",
          "passCriteria": [
            {
              "id": "1.1",
              "requirement": "Sidans huvudsakliga språk är maskinläsbart.",
              "failureStatementTemplate": "Sidans huvudsakliga språk är inte maskinläsbart. [ange var och hur det brister]"
            },
            {
              "id": "1.2",
              "requirement": "Språkkoden är giltig och matchar sidinnehållets språk.",
              "failureStatementTemplate": "Språkkoden är inte giltig och matchar sidinnehållets språk. [ange var och hur det brister]"
            }
          ],
          "ifNo": []
        }
      ],
      "contentType": [
        "teknisk-grundstruktur-sidans-sprak"
      ],
      "classifications": [
        {
          "taxonomyId": "wcag22-pour",
          "conceptId": "understandable"
        }
      ]
    },
    "krav_sidtitel": {
      "id": "krav_sidtitel",
      "key": "krav_sidtitel",
      "title": "Sidans titel",
      "metadata": {
        "mainCategory": {
          "text": "Innehåll",
          "key": "innehall"
        },
        "subCategory": "",
        "impact": {
          "isCritical": false,
          "primaryScore": 4,
          "secondaryScore": 0,
          "assumedCompliance": false
        }
      },
      "standardReference": {
        "text": "9.2.4.2 Page Titled",
        "url": "https://www.w3.org/WAI/WCAG22/quickref/#page-titled"
      },
      "exceptions": "",
      "examples": "",
      "tips": "",
      "commonErrors": "Sidan saknar en title-text.\nSidans title-text stämmer inte överens med sidans innehåll.\nNär sidans innehåll uppdateras utan att sidan laddas om (\"single page application\") så förblir sidans title den samma.",
      "expectedObservation": "Sidan har en title som beskriver sidans ämne eller syfte.\nOm sidan är en ”single-page application” så uppdateras sidans titeln dynamiskt så att den reflekterar innehållet.",
      "instructions": "Titta på sidans källkod. Leta efter texten som ligger i <head>, mellan <title> och </title>. Denna text utgör sidans titel.",
      "checks": [
        {
          "id": "1",
          "condition": "Sidan har ett innehåll.",
          "logic": "AND",
          "passCriteria": [
            {
              "id": "1.1",
              "requirement": "Sidan har ett <title>-element som är placerat i sidans <head>-elementet.",
              "failureStatementTemplate": "Sidan har ett <title>-element som är inte placerat i sidans <head>-elementet. [ange var och hur det brister]"
            },
            {
              "id": "1.2",
              "requirement": "Title-texten beskriver sidans innehåll.",
              "failureStatementTemplate": "Title-texten beskriver sidans innehåll gäller inte. [ange var och hur det brister]"
            }
          ],
          "ifNo": []
        },
        {
          "id": "2",
          "condition": "Sidan är en ”single-page application”.",
          "logic": "AND",
          "passCriteria": [
            {
              "id": "2.1",
              "requirement": "När sidans huvudsakliga innehåll uppdateras, motsvarande ett sidbyte, så stämmer title-texten överens med det nya aktuella innehållet",
              "failureStatementTemplate": "När sidans huvudsakliga innehåll uppdateras, motsvarande ett sidbyte, så stämmer title-texten överens med det nya aktuella innehållet gäller inte. [ange var och hur det brister]"
            }
          ],
          "ifNo": []
        }
      ],
      "contentType": [
        "teknisk-grundstruktur-sidtitel"
      ],
      "classifications": [
        {
          "taxonomyId": "wcag22-pour",
          "conceptId": "operable"
        }
      ]
    },
    "krav_textalternativ_for_bilder": {
      "id": "krav_textalternativ_for_bilder",
      "key": "krav_textalternativ_for_bilder",
      "title": "Icke-textinnehåll (bilder)",
      "metadata": {
        "mainCategory": {
          "text": "Bilder",
          "key": "bilder"
        },
        "subCategory": "",
        "impact": {
          "isCritical": true,
          "primaryScore": 3,
          "secondaryScore": 3,
          "assumedCompliance": false
        }
      },
      "standardReference": {
        "text": "9.1.1.1 Non-text Content",
        "url": "https://www.w3.org/WAI/WCAG22/quickref/#non-text-content"
      },
      "exceptions": "Bilder som är rent dekorativa och inte tillför någon informations- eller funktionalitet till sidan.\n\nBilder som är en del av en annan WCAG-relevant komponent där textalternativ tillhandahålls på annat sätt.\n\nBilder där textalternativ inte är möjliga, men då ska det finnas annat tillgängligt format för informationen.",
      "examples": "En bild som visar en varningssymbol har alt-texten \"Varning: Hög spänning\".\n\nEn bild som bara är till för dekoration (en dekorativ bild) har ett tomt alt-attribut (alt=\"\") och är markerad med aria-hidden=\"true\".",
      "tips": "Använd verktyg som Web Developer eller PTS bookmarklet för att snabbt hitta bilder utan alt-text.\n\nTänk på att alt-text ska vara kortfattad men informativ och passa in i sammanhanget.\n\nVar noga med att dekorativa bilder inte ska störa skärmläsaranvändare.",
      "commonErrors": "Bilder saknar alt-attribut helt eller har beskrivande text som inte motsvarar bildens funktion.\n\nDekorativa bilder har alt-text som läses upp av skärmläsare och skapar onödigt brus.\n\nBilder med text saknar korrekt alt-text som återger texten eller funktionen.",
      "expectedObservation": "Alla bilder på sidan har korrekta textalternativ. Meningsbärande bilder har beskrivande alt-attribut, och dekorativa bilder har tomma alt-attribut eller är undantagna för hjälpmedel.\n\nMer konkret:\nMeningsbärande bilder (bilder som förmedlar information): Har ett beskrivande alt-attribut (alt) som förklarar bildens innehåll eller syfte.\n\nDekorativa bilder (bilder som inte förmedlar information): Har ett tomt alt-attribut (alt=\"\") eller är helt dolda för hjälpmedel (t.ex. med aria-hidden=\"true\"), så att de ignoreras av skärmläsare.\n\nBild med text (till exempel en knapp med bild): Bilden har ett alt-attribut som återger den text eller funktion som bilden representerar.",
      "instructions": "Kontrollera textalternativen för alla förgrundsbilder på sidan, till exempel alt-attributet för <img>-element. SVG-bilder har inget alt-attribut.\n\nOm bilden laddas med en img-tagg, kontrollera att det finns ett alt-attribut i img-taggen. Använd Web Developer eller PTS bookmarklet för att gå igenom bildernas alt-texter.\n\nOm bilden laddas med en svg-tagg, kontrollera att det finns en maskinläsbar text, t.ex. aria-label, aria-labelledby osv. Använd PTS bookmarklet för att gå igenom bildernas maskinläsbara texter.",
      "checks": [
        {
          "id": "1",
          "condition": "Det finns meningsbärande bilder på sidan, dvs bilder som framför information till användaren.",
          "logic": "AND",
          "passCriteria": [
            {
              "id": "1.1",
              "requirement": "Informationsbärande bilder är förgrundsbilder, dvs bilden ligger i HTML-koden, inte i CSS-koden.",
              "failureStatementTemplate": "Informationsbärande bilder är inte förgrundsbilder, dvs bilden ligger i HTML-koden, inte i CSS-koden. [ange var och hur det brister]"
            },
            {
              "id": "1.2",
              "requirement": "Informationsbärande bilder har textalternativ. För img-taggar används alt-texter, för svg-taggar används aria-label eller motsvarande attribut.",
              "failureStatementTemplate": "Informationsbärande bilder saknar textalternativ. För img-taggar används alt-texter, för svg-taggar används aria-label eller motsvarande attribut. [ange var och hur det brister]"
            },
            {
              "id": "1.3",
              "requirement": "Informationsbärande bilders textalternativ förmedlar samma information som bilden i det aktuella sammanhanget.",
              "failureStatementTemplate": "Informationsbärande bilders textalternativ förmedlar samma information som bilden i det aktuella sammanhanget gäller inte. [ange var och hur det brister]"
            },
            {
              "id": "1.4",
              "requirement": "Bilder som förmedlar abstrakta begrepp har textalternativ som förmedlar begreppet, inte beskriver motivet.",
              "failureStatementTemplate": "Bilder som förmedlar abstrakta begrepp saknar textalternativ som förmedlar begreppet, inte beskriver motivet. [ange var och hur det brister]"
            },
            {
              "id": "1.5",
              "requirement": "Förgrundsbilder som inte förmedlar relevant information har tomma textalternativ eller döljs för hjälpmedel.",
              "failureStatementTemplate": "Förgrundsbilder som inte förmedlar relevant information saknar tomma textalternativ eller döljs för hjälpmedel. [ange var och hur det brister]"
            }
          ],
          "ifNo": []
        }
      ],
      "contentType": [
        "bilder-och-ikoner-bilder",
        "bilder-och-ikoner-ikoner",
        "bilder-och-ikoner-kartor-diagram-och-datavisualisering"
      ],
      "classifications": [
        {
          "taxonomyId": "wcag22-pour",
          "conceptId": "perceivable"
        }
      ]
    },
    "krav_uppdykande_innehall_vid_hovring": {
      "id": "krav_uppdykande_innehall_vid_hovring",
      "key": "krav_uppdykande_innehall_vid_hovring",
      "title": "Uppdykande innehåll vid hovring",
      "metadata": {
        "mainCategory": {
          "text": "Användargränssnitt",
          "key": "anvandargranssnitt"
        },
        "subCategory": {
          "text": "Beteende",
          "key": "beteende"
        },
        "impact": {
          "isCritical": false,
          "primaryScore": 2,
          "secondaryScore": 0,
          "assumedCompliance": false
        }
      },
      "standardReference": {
        "text": "9.1.4.13 Content on Hover or Focus",
        "url": "https://www.w3.org/WAI/WCAG22/quickref/#content-on-hover-or-focus"
      },
      "exceptions": "Innehåll som visas helt under webbläsarens kontroll, till exempel*tooltips*via HTML-attributet title.",
      "examples": "Ett info-\"i\" som fäller ut innehåll när du pekar på i:et.\nEn produktbild som ändras när man pekar på bilden.",
      "tips": "Man kan t.ex, men inte endast, dölja det nya innehållet genom att trycka Esc.",
      "commonErrors": "När du hovrar över ett element visas en tooltip, men dess innehåll sträcker sig utanför viewporten. När du försöker flytta muspekaren till den delen utanför försvinner tooltipen eftersom hovringen avbryts.",
      "expectedObservation": "Det finns innehåll som bara visas när pekaren befinner sig över ett element.\nDet går att dölja innehåll som visas vid hovring, utan att flytta pekaren.\nDet går att föra pekaren över innehåll som visas vid hovring, utan att det försvinner.\nInnehåll som visas vid hovring förblir synligt till dess användaren flyttar pekaren,*väljer*att dölja det, eller tills den visade informationen inte längre är relevant.",
      "instructions": "### Metod 1\n\n- Identifiera alla element på sidan som har innehåll som dyker upp vid hover, dvs när du pekar på elementet.\n- Du kan t.ex. använda PTS bookmarklet för att hitta dessa element. \n- Använd muspekaren för att identifiera de element som visar nytt innehåll vid hoover.\n- Identifiera de element som inte kan få fokus, men som potentiellt kan visa innehåll vid hover. Hovra över dessa för att se om nytt innehåll visas.\n\n### Metod 2\n\n- Zooma till 200 %.\n- Identifiera alla element på sidan som har innehåll som dyker upp vid hover, dvs när du pekar på elementet.\n- Du kan t.ex. använda PTS bookmarklet för att hitta dessa element. \n- Använd muspekaren för att identifiera de element som visar nytt innehåll vid hoover.\n- Identifiera de element som inte kan få fokus, men som potentiellt kan visa innehåll vid hover. Hovra över dessa för att se om nytt innehåll visas.",
      "checks": [
        {
          "id": "1",
          "condition": "Det finns innehåll som bara visas när pekaren befinner sig över ett element (hover).",
          "logic": "AND",
          "passCriteria": [
            {
              "id": "1.1",
              "requirement": "Det går att dölja innehåll som visas vid hovring, utan att flytta pekaren.",
              "failureStatementTemplate": "Det är svårt eller omöjligt att dölja innehåll som visas vid hovring, utan att flytta pekaren. [ange var och hur det brister]"
            },
            {
              "id": "1.2",
              "requirement": "Det går att föra pekaren över det nya innehållet som visas vid hovring, utan att det nya innehållet försvinner.",
              "failureStatementTemplate": "Det är svårt eller omöjligt att föra pekaren över det nya innehållet som visas vid hovring, utan att det nya innehållet försvinner. [ange var och hur det brister]"
            },
            {
              "id": "1.3",
              "requirement": "Innehåll som visas vid hovring förblir synligt till dess användaren flyttar pekaren,*väljer*att dölja det, eller tills den visade informationen inte längre är relevant.",
              "failureStatementTemplate": "Innehåll som visas vid hovring förblir synligt till dess användaren flyttar pekaren,*väljer*att dölja det, eller tills den visade informationen inte längre är inte relevant. [ange var och hur det brister]"
            }
          ],
          "ifNo": []
        },
        {
          "id": "2",
          "condition": "Zooma till 200 %. Det finns innehåll som bara visas när pekaren befinner sig över ett element (hover).",
          "logic": "AND",
          "passCriteria": [
            {
              "id": "2.1",
              "requirement": "Det går att dölja innehåll som visas vid hovring, utan att flytta pekaren.",
              "failureStatementTemplate": "Det är svårt eller omöjligt att dölja innehåll som visas vid hovring, utan att flytta pekaren. [ange var och hur det brister]"
            },
            {
              "id": "2.2",
              "requirement": "Det går att föra pekaren över det nya innehållet som visas vid hovring, utan att det nya innehållet försvinner.",
              "failureStatementTemplate": "Det är svårt eller omöjligt att föra pekaren över det nya innehållet som visas vid hovring, utan att det nya innehållet försvinner. [ange var och hur det brister]"
            },
            {
              "id": "2.3",
              "requirement": "Innehåll som visas vid hovring förblir synligt till dess användaren flyttar pekaren,*väljer*att dölja det, eller tills den visade informationen inte längre är relevant.",
              "failureStatementTemplate": "Innehåll som visas vid hovring förblir synligt till dess användaren flyttar pekaren,*väljer*att dölja det, eller tills den visade informationen inte längre är inte relevant. [ange var och hur det brister]"
            }
          ],
          "ifNo": []
        }
      ],
      "contentType": [
        "bilder-och-ikoner-bilder",
        "bilder-och-ikoner-ikoner",
        "bilder-och-ikoner-kartor-diagram-och-datavisualisering",
        "formular-inmatningsfalt",
        "formular-knappar",
        "interaktiva-komponenter-komplexa-interaktiva-komponenter",
        "mediespelare-mediespelare-for-ljud",
        "mediespelare-mediespelare-for-video",
        "navigering-lankar",
        "navigering-navigeringsmenyer",
        "teknisk-grundstruktur-roller-och-egenskaper-i-koden",
        "text-och-struktur-landmarken",
        "text-och-struktur-listor",
        "text-och-struktur-rubriker",
        "text-och-struktur-tabeller",
        "text-och-struktur-text"
      ],
      "classifications": [
        {
          "taxonomyId": "wcag22-pour",
          "conceptId": "perceivable"
        }
      ]
    },
    "krav_ingen_tangentbordsfalla": {
      "id": "krav_ingen_tangentbordsfalla",
      "key": "krav_ingen_tangentbordsfalla",
      "title": "Ingen tangentbordsfälla",
      "metadata": {
        "mainCategory": {
          "text": "Tangentbord",
          "key": "tangentbord"
        },
        "subCategory": {
          "text": "Hanterbart",
          "key": "hanterbart"
        },
        "impact": {
          "isCritical": true,
          "primaryScore": 3,
          "secondaryScore": 1,
          "assumedCompliance": false
        }
      },
      "standardReference": {
        "text": "9.2.1.2 No Keyboard Trap",
        "url": "https://www.w3.org/WAI/WCAG22/quickref/#no-keyboard-trap"
      },
      "exceptions": "",
      "examples": "",
      "tips": "",
      "commonErrors": "- Du kan tabba till, men aldrig ifrån, ett objekt eller grupp av objekt på sidan. T.ex. kan du öppna och komma in i en meny (dvs en grupp av element), men du kan aldrig lämna menyn enbart med tangentbordet. \n- Du tabbar dig till en punkt i gränssnittet, men kan inte ta dig vidare utan att genomföra en viss åtgärd. Du får inte heller någon information om vad du behöver göra för att kunna ta dig vidare till nästa fokuserbara objekt på sidan.\n- Du hamnar i en modal som du bara kan stänga med hjälp av musen.",
      "expectedObservation": "Det går att navigera till men även ifrån varje fokuserbart element/elementgrupper med tangentbordet.\nOm det krävs något annat än tabb/piltangent för att navigera ifrån vissa element så finns det information om hur man navigerar ifrån dessa element.\nPrincipen är att du aldrig ska fastna på någon komponent eller i något kontext utan möjlighet att komma vidare med endast tangentbordet.",
      "instructions": "Navigera genom alla fokuserbara element på sidan med tangentbordet. \nAktivera alla funktioner som visar/döljer innehåll etc.",
      "checks": [
        {
          "id": "1",
          "condition": "Sidan innehåller interaktiva objekt du kan nå med tangentbordet.",
          "logic": "AND",
          "passCriteria": [
            {
              "id": "1.1",
              "requirement": "Det går att navigera ifrån varje interaktivt objekt med tangentbordet.",
              "failureStatementTemplate": "Det är svårt eller omöjligt att navigera ifrån varje interaktivt objekt med tangentbordet. [ange var och hur det brister]"
            },
            {
              "id": "1.2",
              "requirement": "Det går att navigera ifrån varje fokuserbar grupp av interaktiva element (t.ex. en meny eller radioknappar) med tangentbordet.",
              "failureStatementTemplate": "Det är svårt eller omöjligt att navigera ifrån varje fokuserbar grupp av interaktiva objekt (t.ex. en meny eller radioknappar) med tangentbordet. [ange var och hur det brister]"
            }
          ],
          "ifNo": []
        },
        {
          "id": "2",
          "condition": "Det krävs något annat än tabb/piltangent för att navigera ifrån vissa interaktiva objekt.",
          "logic": "AND",
          "passCriteria": [
            {
              "id": "2.1",
              "requirement": "Det finns information om hur man navigerar ifrån dessa interaktiva objekt.",
              "failureStatementTemplate": "Information om hur man navigerar ifrån dessa interaktiva objekt saknas. [ange var och hur det brister]"
            }
          ],
          "ifNo": []
        }
      ],
      "contentType": [
        "formular-inmatningsfalt",
        "formular-knappar",
        "interaktiva-komponenter-komplexa-interaktiva-komponenter",
        "mediespelare-mediespelare-for-ljud",
        "mediespelare-mediespelare-for-video",
        "navigering-lankar"
      ],
      "classifications": [
        {
          "taxonomyId": "wcag22-pour",
          "conceptId": "operable"
        }
      ]
    },
    "krav_felmeddelanden": {
      "id": "krav_felmeddelanden",
      "key": "krav_felmeddelanden",
      "title": "Felidentifiering",
      "metadata": {
        "mainCategory": {
          "text": "Användargränssnitt",
          "key": "anvandargranssnitt"
        },
        "subCategory": {
          "text": "Felmeddelanden",
          "key": "felmeddelanden"
        },
        "impact": {
          "isCritical": false,
          "primaryScore": 4,
          "secondaryScore": 0,
          "assumedCompliance": false
        }
      },
      "standardReference": {
        "text": "9.3.3.1 Error Identification",
        "url": "https://www.w3.org/WAI/WCAG22/quickref/#error-identification"
      },
      "exceptions": "",
      "examples": "",
      "tips": "",
      "commonErrors": "Ett textfält innehåller fel, men detta är bara förmedlat genom en röd ram på fältet och en ikon, och inte i text.",
      "expectedObservation": "Om det finns fält med valideringsfel finns det felmeddelanden som beskriver felen i text.\n\nSäkerställ också att minst ett av följande gäller för felidentifiering: \n- Det framgår i text vilket eller vilka fält som är felande.\n- Alla felande fält har aria-invalid=\"true\".\n- Felmeddelandena är maskinläsbart kopplade till de felande fälten.",
      "instructions": "1. Lämna obligatoriska fält tomma.\n2. Fyll i fler eller färre tecken än tillåtet i fält med sådana begränsningar.\n3. Fyll i bokstäver i numeriska fält.\n4. Fyll i en formellt oriktig e-postadress (utan ”@”).\n5. Fyll i för låga eller för höga värden i numeriska fält.\n6. Fyll i datum på ogiltigt format.\n7. Fyll i ogiltiga datum (till exempel 31 april eller månad 13).\n8. Fyll i ogiltiga värden i fält som kräver vissa värden eller format.",
      "checks": [
        {
          "id": "1",
          "condition": "Det finns formulärelement med valideringsfel (minst ett av svarsalternativen behöver vara godkända).",
          "logic": "AND",
          "passCriteria": [
            {
              "id": "1.1",
              "requirement": "Felmeddelanden visas med text.",
              "failureStatementTemplate": "Felmeddelanden visas med text gäller inte. [ange var och hur det brister]"
            }
          ],
          "ifNo": []
        },
        {
          "id": "2",
          "condition": "Minst ett av följande gäller för felidentifiering:",
          "logic": "OR",
          "passCriteria": [
            {
              "id": "2.1",
              "requirement": "Det framgår i text vilket fält som är felande.",
              "failureStatementTemplate": "Det är otydligt i text vilket fält som är felande. [ange var och hur det brister]"
            },
            {
              "id": "2.2",
              "requirement": "Alla felande fält har aria-invalid=\"true\".",
              "failureStatementTemplate": "Någon eller några felande fält har inte aria-invalid=\"true\".. [ange var och hur det brister]"
            },
            {
              "id": "2.3",
              "requirement": "Felmeddelandena är maskinläsbart kopplade till de felande fälten.",
              "failureStatementTemplate": "Felmeddelandena är inte maskinläsbart kopplade till de felande fälten. [ange var och hur det brister]"
            }
          ],
          "ifNo": []
        }
      ],
      "contentType": [
        "formular-inmatningsfalt",
        "interaktiva-komponenter-komplexa-interaktiva-komponenter",
        "text-och-struktur-text"
      ],
      "classifications": [
        {
          "taxonomyId": "wcag22-pour",
          "conceptId": "understandable"
        }
      ]
    },
    "krav_korrigeringsforslag": {
      "id": "krav_korrigeringsforslag",
      "key": "krav_korrigeringsforslag",
      "title": "Korrigeringsförslag",
      "metadata": {
        "mainCategory": {
          "text": "Användargränssnitt",
          "key": "anvandargranssnitt"
        },
        "subCategory": {
          "text": "Felmeddelanden",
          "key": "felmeddelanden"
        },
        "impact": {
          "isCritical": false,
          "primaryScore": 3,
          "secondaryScore": 2,
          "assumedCompliance": false
        }
      },
      "standardReference": {
        "text": "9.3.3.3 Error Suggestion",
        "url": "https://www.w3.org/WAI/WCAG22/quickref/#error-suggestion"
      },
      "exceptions": "Om korrigeringsförslag skulle göra syftet med fältet meningslöst. Exempelvis där inmatningen från användaren ska vara unik, som ett nytt lösenord.",
      "examples": "Exempel på typer av inmatningsfält där det går att ge förslag på hur felet ska rättas till: \n- Ogiltigt postnummer\n- Tomt obligatoriskt fält\n- Fel format på datum eller e-postadress \n- Ogiltigt telefonnummer",
      "tips": "- Fel kan till exempel uppstå vid inmatning (direktvalidering), när man lämnar fältet (onBlur) eller när användaren skickar in ett formulär (submit). Felmeddelanden kan även uppstå i andra sammanhang.",
      "commonErrors": "Ett felmeddelande pekar bara på att en inmatning är fel, inte hur användaren kan rätta till det.",
      "expectedObservation": "När ett fel uppstår vid inmatning ges tydliga och konkreta förslag på hur felet kan rättas till.",
      "instructions": "1. Leta efter inmatningsfält på sidan. \n2. Gör felaktiga inmatningar och se om det uppstår korrigeringsförslag där det är möjligt.\n3. Kontrollera att korrigeringsförslagen är tydliga och hjälper användaren att göra rätt.",
      "checks": [
        {
          "id": "1",
          "condition": "Det finns inmatningsfält på sidan som kan visa felmeddelanden vid felaktig inmatning.",
          "logic": "AND",
          "passCriteria": [
            {
              "id": "1.1",
              "requirement": "Felmeddelanden innehåller förslag eller instruktioner om hur felet ska rättas till.",
              "failureStatementTemplate": "De felmeddelanden som visas saknar förslag eller instruktioner om hur felet ska rättas till. [ange var och hur det brister]"
            },
            {
              "id": "1.2",
              "requirement": "Felmeddelanden innehåller förslag på korrigeringar som är tillräckligt beskrivande för att användaren ska kunna rätta felet.",
              "failureStatementTemplate": "Felmeddelanden innehåller förslag på korrigeringar som**inte är tillräckligt beskrivande**för att användaren ska kunna rätta felet. [ange var och hur det brister]"
            },
            {
              "id": "1.3",
              "requirement": "Inmatningsfältet är av sådan karaktär att användaren kan eller bör lämnas utan korrigeringsförslag.",
              "failureStatementTemplate": "Inmatningsfältet är inte av sådan karaktär att användaren kan eller bör lämnas utan korrigeringsförslag. [ange var och hur det brister]"
            }
          ],
          "ifNo": []
        }
      ],
      "contentType": [
        "formular-inmatningsfalt",
        "interaktiva-komponenter-komplexa-interaktiva-komponenter",
        "sarskilda-hinder-captcha"
      ],
      "classifications": [
        {
          "taxonomyId": "wcag22-pour",
          "conceptId": "understandable"
        }
      ]
    },
    "krav_etiketter_i_namn": {
      "id": "krav_etiketter_i_namn",
      "key": "krav_etiketter_i_namn",
      "title": "Etiketter i namn",
      "metadata": {
        "mainCategory": {
          "text": "Användargränssnitt",
          "key": "anvandargranssnitt"
        },
        "subCategory": {
          "text": "Interaktiva komponenter",
          "key": "interaktiva-komponenter"
        },
        "impact": {
          "isCritical": false,
          "primaryScore": 2,
          "secondaryScore": 1,
          "assumedCompliance": false
        }
      },
      "standardReference": {
        "text": "9.2.5.3 Label in Name",
        "url": "https://www.w3.org/WAI/WCAG22/quickref/#label-in-name"
      },
      "exceptions": "Tecken som används symboliskt och inte bokstavligt, till exempel ett ”X” för ”stäng” eller ”ta bort”.",
      "examples": "En knapp med texten \"Lägg i varukorgen\" har ett maskinläsbart namn som innehåller samma text.",
      "tips": "Komponenter som inte har en synlig text behandlas i andra krav.",
      "commonErrors": "En knapp med den visuella etiketten \"Lägg i varukorg\" har det maskinläsbara namnet \"Köp\".",
      "expectedObservation": "För komponenter som har synliga etiketter (label) med text, ska det maskinläsbara namnet innehålla den synliga texten. Detta gäller även etiketter med bilder av text.",
      "instructions": "1. Leta efter komponenter som har en etikett med synlig text. Även bilder av text gäller här.\n2. Använd skärmläsare eller högerklicka och inspektera i koden. \n3. Komponenten ska ha ett maskinläsbart namn som innehåller den synliga etiketten.",
      "checks": [
        {
          "id": "1",
          "condition": "Det finns interaktiva komponenter med synliga etiketter på sidan.",
          "logic": "AND",
          "passCriteria": [
            {
              "id": "1.1",
              "requirement": "Komponentens maskinläsbara namn innehåller texten i den synliga etiketten.",
              "failureStatementTemplate": "Komponentens maskinläsbara namn innehåller inte texten i den synliga etiketten. [ange var och hur det brister]"
            }
          ],
          "ifNo": []
        }
      ],
      "contentType": [
        "formular-inmatningsfalt",
        "formular-knappar",
        "interaktiva-komponenter-komplexa-interaktiva-komponenter",
        "mediespelare-mediespelare-for-ljud",
        "mediespelare-mediespelare-for-video",
        "navigering-lankar",
        "navigering-navigeringsmenyer",
        "sarskilda-hinder-captcha",
        "text-och-struktur-tabeller"
      ],
      "classifications": [
        {
          "taxonomyId": "wcag22-pour",
          "conceptId": "operable"
        }
      ]
    },
    "krav_kontrast_for_komponenter": {
      "id": "krav_kontrast_for_komponenter",
      "key": "krav_kontrast_for_komponenter",
      "title": "Kontrast för interaktiva komponenter",
      "metadata": {
        "mainCategory": {
          "text": "Användargränssnitt",
          "key": "anvandargranssnitt"
        },
        "subCategory": {
          "text": "Interaktiva komponenter",
          "key": "interaktiva-komponenter"
        },
        "impact": {
          "isCritical": false,
          "primaryScore": 2,
          "secondaryScore": 1,
          "assumedCompliance": false
        }
      },
      "standardReference": {
        "text": "9.1.4.11 Non-text Contrast",
        "url": "https://www.w3.org/WAI/WCAG22/quickref/#non-text-contrast"
      },
      "exceptions": "Undantag är inaktiva (\"disabled\") komponenter vars funktion är tillfälligt avstängd.",
      "examples": "Grafiska element är t.ex. symboler, ikoner, tecken, bocken i en kryssruta med mera.\nExempel omfattar även kantlinjer i ett inmatningsfält i ett formulär.",
      "tips": "Visuell indikering som är nödvändig för förståelsen: Någonting som gör det möjligt att känna igen eller förstå en komponent, även om den saknar textinnehåll, till exempel kantlinje eller bakgrundsfärg på ett inmatningsfält utan platshållare eller en indikering av om en komponent är vald eller inte.\n\nIntilliggande färger: Färgerna som omger själva komponenten eller indikatorn. För ett inmatningsfält med kantlinje är den intilliggande färgen bakgrundsfärgen på elementet som innehåller fältet. För en bockmarkering i en kryssruta kan det vara bakgrundsfärgen i rutan.",
      "commonErrors": "",
      "expectedObservation": "Grafiska element i komponenterna har ett kontrastförhållande på minst 3:1 mot intilliggande färger.\nOm det finns kantlinjer på inmatningsfält har även dessa en kontrast på min 3:1 mot intilliggande färger.",
      "instructions": "Leta efter interaktiva komponenter med informationsbärande grafiska element.\nAnvänd TPGi Color Contrast Analyzer för att kontrollera att de grafiska elementen i själva komponenten har en kontrast på minst 3:1 mot intilliggande färger.",
      "checks": [
        {
          "id": "1",
          "condition": "Det finns interaktiva komponenter som förmedlar information genom grafiska element.",
          "logic": "AND",
          "passCriteria": [
            {
              "id": "1.1",
              "requirement": "Interaktiva komponenter har ett kontrastförhållande på minst 3:1 mot intilliggande färger.",
              "failureStatementTemplate": "Interaktiva komponenter saknar ett kontrastförhållande på minst 3:1 mot intilliggande färger. [ange var och hur det brister]"
            }
          ],
          "ifNo": []
        }
      ],
      "contentType": [
        "bilder-och-ikoner-bilder",
        "bilder-och-ikoner-ikoner",
        "bilder-och-ikoner-kartor-diagram-och-datavisualisering",
        "formular-inmatningsfalt",
        "formular-knappar",
        "interaktiva-komponenter-komplexa-interaktiva-komponenter",
        "mediespelare-mediespelare-for-ljud",
        "mediespelare-mediespelare-for-video",
        "navigering-lankar",
        "navigering-navigeringsmenyer"
      ],
      "classifications": [
        {
          "taxonomyId": "wcag22-pour",
          "conceptId": "perceivable"
        }
      ]
    },
    "krav_skipplankar": {
      "id": "krav_skipplankar",
      "key": "krav_skipplankar",
      "title": "Hoppa förbi återkommande innehåll",
      "metadata": {
        "mainCategory": {
          "text": "Tangentbord",
          "key": "tangentbord"
        },
        "subCategory": {
          "text": "Hanterbart",
          "key": "hanterbart"
        },
        "impact": {
          "isCritical": false,
          "primaryScore": 4,
          "secondaryScore": 1,
          "assumedCompliance": false
        }
      },
      "standardReference": {
        "text": "9.2.4.1 Bypass Blocks",
        "url": "https://www.w3.org/WAI/WCAG22/quickref/#bypass-blocks"
      },
      "exceptions": "När det första elementet på sidan är information om kakor (\"cookies\") så skall denna information ligga före skipplänken. Användaren ska alltid få information om kakor innan man använder webbplatsen. GDPR-information trumfar kravet på en skipplänk.",
      "examples": "Återkommande innehåll kan vara:\n- Ett sidhuvud med menyaltetnativ, sökfunktion osv.\n- Sidomenyer som visas på flera sidor.\n- Återkommande Innehåll som uppenbart inte utgör en del av sidans huvudsakliga innehåll.",
      "tips": "",
      "commonErrors": "Skipplänk saknas helt.\nSkipplänken finns fungerar inte alls, dvs den tar*inte*användaren förbi det återkommande innehållet och vidare till sidans huvudsakliga innehåll. \nSkipplänken leder till annat återkommande interhall.",
      "expectedObservation": "Det finns återkommande innehåll före huvudinnehållet på flera sidor, exempelvis ett sidhuvud med innehåll. Ett av de första interaktiva elementen på sidan är därför en skipplänk till huvudinnehållet.\n\nDet ska finnas mekanismer för att hoppa över grupper av innehåll som återkommer på flera webbsidor inom en webbplats.",
      "instructions": "1. Ta först reda på om sidan innehåller återkommande innehåll. Om så är fallet, leta då efter en sk \"skipplänk\" som låter användaren hoppa över detta återkommande innehåll.\n2. Ta reda på om sidan, förutom återkommande innehåll i början av sidan, även innehåller block av återkommande innehåll som ligger \"inbäddat\" i sidans övriga innehåll. Om så är fallet, leta då efter en sk \"skipplänk\" som låter användaren hoppa över detta återkommande innehåll.",
      "checks": [
        {
          "id": "1",
          "condition": "Det finns innehåll som återkommer på flera sidor.",
          "logic": "AND",
          "passCriteria": [
            {
              "id": "1.1",
              "requirement": "Det finns en mekanism för att hoppa förbi det återkommande innehållet.",
              "failureStatementTemplate": "En mekanism för att hoppa förbi det återkommande innehållet saknas. [ange var och hur det brister]"
            }
          ],
          "ifNo": []
        }
      ],
      "contentType": [
        "navigering-lankar"
      ],
      "classifications": [
        {
          "taxonomyId": "wcag22-pour",
          "conceptId": "operable"
        }
      ]
    },
    "krav_fokusordning": {
      "id": "krav_fokusordning",
      "key": "krav_fokusordning",
      "title": "Meningsfull fokusordning",
      "metadata": {
        "mainCategory": {
          "text": "Tangentbord",
          "key": "tangentbord"
        },
        "subCategory": {
          "text": "Fokus",
          "key": "fokus"
        },
        "impact": {
          "isCritical": false,
          "primaryScore": 4,
          "secondaryScore": 0,
          "assumedCompliance": false
        }
      },
      "standardReference": {
        "text": "9.2.4.3 Focus Order",
        "url": "https://www.w3.org/WAI/WCAG22/quickref/#focus-order"
      },
      "exceptions": "",
      "examples": "- En dialogruta/modal som öppnas i form av ett nytt lager på sidan får fokus när detta lager öppnas.\n- En hamburgermeny som öppnas i ett nytt lager får fokus när detta lager öppnas.\n- En accordion som öppnas/stängs behåller fokus på det aktiverande elementet.\n- En knapp laddar in ytterligare träffar i en lista, och fokus sätts på det första nya tillagda elementet i listan.",
      "tips": "",
      "commonErrors": "En modal öppnas på sidan, men fokus förblir bakom modalen.",
      "expectedObservation": "- Fokusordningen avviker inte från den visuella ordningen på ett sätt som gör innehållet svårt att förstå eller använda.\n- Om det finns element som öppnar en popup-meny, dialogruta (modal) eller liknande, sätts fokus automatiskt till det öppnade elementet när det visas. När det visade elementet stängs sätts fokus åter till det aktiverande elementet.",
      "instructions": "Använd tillägget Taba11y (som automatiskt genererar tabbordningen) för att få en snabb översikt på om det finns udda tabbhopp på sidan.\n\nAnvänd tillägget Accessibility Insights för att ta reda på tabb-ordningen på sidan.\n\nNavigera genom alla fokuserbara element på sidan med tangentbordet. Aktivera eventuella funktioner som öppnar en meny, dialogruta eller liknande.\n\nStäng av sidans CSS (stilmall) för att se om dokumentstrukturen motsvarar den visuella ordningen.\n\nLadda om sidan för att få tillbaka sidans ursprungliga utseende. Gör  därefter webbfönstret så smalt som det går, kontrollera att ordningen på innehållet överensstämmer med fokusordningen, vanligtvis uppifrån och ner.",
      "checks": [
        {
          "id": "1",
          "condition": "Det finns fokuserbara element på sidan.",
          "logic": "AND",
          "passCriteria": [
            {
              "id": "1.1",
              "requirement": "Fokusordningen följer den visuella ordningen på sidan utan att göra avsteg som påverkar användarens upplevelse.",
              "failureStatementTemplate": "Fokusordningen följer inte den visuella ordningen på sidan och gör avsteg som påverkar användarens upplevelse negativt. [ange var och hur det brister]"
            }
          ],
          "ifNo": []
        },
        {
          "id": "2",
          "condition": "Det finns element som öppnar en popup-meny, dialogruta (modal) eller liknande.",
          "logic": "AND",
          "passCriteria": [
            {
              "id": "2.1",
              "requirement": "Fokus sätts automatiskt till det öppnade elementet när det visas.",
              "failureStatementTemplate": "Fokus sätts inte automatiskt till det öppnade elementet när det visas. [ange var och hur det brister]"
            },
            {
              "id": "2.2",
              "requirement": "När det visade elementet stängs sätts fokus åter till det aktiverande elementet.",
              "failureStatementTemplate": "När det visade elementet stängs sätts fokus åter till det aktiverande elementet gäller inte. [ange var och hur det brister]"
            }
          ],
          "ifNo": []
        },
        {
          "id": "3",
          "condition": "Det finns innehåll som fälls ut eller läggs till på sidan vid interaktion med ett element.",
          "logic": "OR",
          "passCriteria": [
            {
              "id": "3.1",
              "requirement": "Det nya innehållet kommer direkt efter det aktiverande elementet i fokusordningen.",
              "failureStatementTemplate": "Det öppnade elementet kommer inte direkt efter det aktiverande elementet i fokusordningen. [ange var och hur det brister]"
            }
          ],
          "ifNo": []
        }
      ],
      "contentType": [
        "formular-inmatningsfalt",
        "formular-knappar",
        "interaktiva-komponenter-komplexa-interaktiva-komponenter",
        "mediespelare-mediespelare-for-ljud",
        "mediespelare-mediespelare-for-video",
        "navigering-lankar",
        "navigering-navigeringsmenyer",
        "sarskilda-hinder-captcha",
        "text-och-struktur-tabeller"
      ],
      "classifications": [
        {
          "taxonomyId": "wcag22-pour",
          "conceptId": "operable"
        }
      ]
    },
    "krav_ledtexter_instruktioner": {
      "id": "krav_ledtexter_instruktioner",
      "key": "krav_ledtexter_instruktioner",
      "title": "Ledtexter, instruktioner",
      "metadata": {
        "mainCategory": {
          "text": "Användargränssnitt",
          "key": "anvandargranssnitt"
        },
        "subCategory": {
          "text": "Ledtexter",
          "key": "ledtexter"
        },
        "impact": {
          "isCritical": false,
          "primaryScore": 3,
          "secondaryScore": 2,
          "assumedCompliance": false
        }
      },
      "standardReference": {
        "text": "9.3.3.2 Labels or Instructions",
        "url": "https://www.w3.org/WAI/WCAG22/quickref/#labels-or-instructions"
      },
      "exceptions": "Om syftet med fältet är uppenbart för seende krävs ingen synlig ledtext, exempelvis för ett ensamt sökfält med en beskrivande knapp. Fältet behöver dock en dold ledtext eller ett maskinläsbart namn för att förmedla information till hjälpmedel, det täcks in av krav 9.4.1.2.",
      "examples": "",
      "tips": "",
      "commonErrors": "Det framgår inte om ett fält är obligatoriskt eller inte. \nInstruktioner eller ledtexter är otydliga. \nNär specifika format efterfrågas, finns det inte utskrivet i ledtext eller instruktion.",
      "expectedObservation": "När användaren ska fylla i data, finns tydliga ledtexter eller instruktioner. \nAnvändaren ska få tillräckligt med information för att kunna slutföra uppgiften. \nFormulär, radioknappar, kryssrutor, kombinationsrutor och sådana valkontroller ska ha en tydlig ledtext. \nInstruktioner och ledtexter ska ange vilket format som inmatning ska ha, när en specifik typ av inmatning krävs.\nDet framgår av ledtexter eller instruktioner vilka fält som är obligatoriska och/eller frivilliga.",
      "instructions": "Leta efter formulär, radioknappar, kryssrutor, kombinationsrutor och liknande valkontroller. Se över om dessa har en tydlig ledtext, så att användaren vet vad hen ska välja. Instruktioner eller ledtexter ska också ange vilket format som inmatning ska ha. Särskilt viktigt om formatet är ovanligt eller det finns specifika regler för vad som är rätt. Om ett formulärfält eller en valkontroll är obligatorisk, ska det framgå i ledtext eller instruktion.",
      "checks": [
        {
          "id": "1",
          "condition": "Det finns formulärfält och valkontroller på sidan",
          "logic": "AND",
          "passCriteria": [
            {
              "id": "1.1",
              "requirement": "Det finns synliga ledtexter eller instruktioner för ifyllnad för alla inmatningsfält eller interaktiva komponenter.",
              "failureStatementTemplate": "Ledtexter eller instruktioner för ifyllnad saknas för något eller några inmatningsfält eller interaktiva komponenter. [ange var och hur det brister]"
            },
            {
              "id": "1.2",
              "requirement": "Det framgår av ledtexter eller instruktioner vilka fält som är obligatoriska och/eller frivilliga.",
              "failureStatementTemplate": "Det är otydligt av ledtexter eller instruktioner vilka fält som är obligatoriska och/eller frivilliga. [ange var och hur det brister]"
            },
            {
              "id": "1.3",
              "requirement": "Specifika format som efterfrågas i inmatningsfält, är utskrivna i ledtext eller instruktion.",
              "failureStatementTemplate": "Specifika format som efterfrågas i inmatningsfält, är utskrivna i ledtext eller instruktion gäller inte. [ange var och hur det brister]"
            }
          ],
          "ifNo": []
        }
      ],
      "contentType": [
        "formular-inmatningsfalt",
        "interaktiva-komponenter-komplexa-interaktiva-komponenter"
      ],
      "classifications": [
        {
          "taxonomyId": "wcag22-pour",
          "conceptId": "understandable"
        }
      ]
    },
    "krav_farganvandning_for_felmeddelanden": {
      "id": "krav_farganvandning_for_felmeddelanden",
      "key": "krav_farganvandning_for_felmeddelanden",
      "title": "Färganvändning för felmeddelanden",
      "metadata": {
        "mainCategory": {
          "text": "Användargränssnitt",
          "key": "anvandargranssnitt"
        },
        "subCategory": {
          "text": "Felmeddelanden",
          "key": "felmeddelanden"
        },
        "impact": {
          "isCritical": false,
          "primaryScore": 3,
          "secondaryScore": 1,
          "assumedCompliance": false
        }
      },
      "standardReference": {
        "text": "9.1.4.1 Use of Color",
        "url": "https://www.w3.org/WAI/WCAG22/quickref/#use-of-color"
      },
      "exceptions": "",
      "examples": "",
      "tips": "",
      "commonErrors": "",
      "expectedObservation": "Formuläret innehåller felmeddelanden.\nFärg används inte som det enda visuella sättet att urskilja felmeddelanden.",
      "instructions": "Leta upp inmatningsfält på sidan. Framkalla ett valideringsfel och kontrollera att någon visuell indikering utöver färg skiljer felmeddelandet från omgivande text.",
      "checks": [
        {
          "id": "1",
          "condition": "Sidan innehåller formulär med felmeddelanden.",
          "logic": "AND",
          "passCriteria": [
            {
              "id": "1.1",
              "requirement": "Färg används inte som det enda visuella sättet att urskilja felmeddelanden.",
              "failureStatementTemplate": "Färg används som det enda visuella sättet att urskilja felmeddelanden. [ange var och hur det brister]"
            }
          ],
          "ifNo": []
        }
      ],
      "contentType": [
        "formular-inmatningsfalt"
      ],
      "classifications": [
        {
          "taxonomyId": "wcag22-pour",
          "conceptId": "perceivable"
        }
      ]
    },
    "krav_textalternativ_for_tidsberoende_medier": {
      "id": "krav_textalternativ_for_tidsberoende_medier",
      "key": "krav_textalternativ_for_tidsberoende_medier",
      "title": "Icke-textinnehåll (ljud och video)",
      "metadata": {
        "mainCategory": {
          "text": "Ljud och video",
          "key": "ljud-och-video"
        },
        "subCategory": "",
        "impact": {
          "isCritical": true,
          "primaryScore": 3,
          "secondaryScore": 3,
          "assumedCompliance": false
        }
      },
      "standardReference": {
        "text": "9.1.1.1 Non-text Content",
        "url": "https://www.w3.org/WAI/WCAG22/quickref/#non-text-content"
      },
      "exceptions": "Ljudklipp eller videor som är en del av en annan WCAG-relevant komponent där textalternativ tillhandahålls på annat sätt.",
      "examples": "- Ett ljudklipp på sidan har en tillhörande transkription med text som återger vad som sägs i ljudklippet.\n- En video utan ljud har ett textalternativ som beskriver vad som händer i filmen.",
      "tips": "Kontrollera att det finns ett textalternativ eller transkription för varje ljudklipp och att det finns en beskrivning för varje video utan ljud.",
      "commonErrors": "Ljudklipp saknar transkription eller textalternativ som återger innehållet.\n\nVideor utan ljud saknar beskrivande textalternativ.",
      "expectedObservation": "- Alla ljudklipp och videor på webbsidan har ett textalternativ som identifierar eller beskriver innehållet och syftet.\n- Det finns textalternativ som beskriver vad som visas i videon\n- Det finns ett textalternativ som identifierar innehållet.",
      "instructions": "- Identifiera alla ljud- och videoelement samt länkar/knappar som startar media på sidan.\n- För varje media: kontrollera att det finns synlig text nära elementet som beskriver syfte/innehåll (t.ex. titel, figurtext, rubrik eller beskrivande länktext).\n- Om synlig text saknas: verifiera att mediet har ett maskinläsbart namn, t.ex. via aria-label eller aria-labelledby (programmatisk koppling till synlig text).",
      "checks": [
        {
          "id": "1",
          "condition": "Det finns ljudklipp (t.ex. enbart ljud, ingen video).",
          "logic": "OR",
          "passCriteria": [
            {
              "id": "1.1",
              "requirement": "Det finns ett textalternativ som sammanfattar eller återger innehållet i ljudklippet.",
              "failureStatementTemplate": "Ett textalternativ som sammanfattar eller återger innehållet i ljudklippet saknas. [ange var och hur det brister]"
            },
            {
              "id": "1.2",
              "requirement": "Det finns en utskriven text (transkription) av vad som sägs.",
              "failureStatementTemplate": "En utskriven text (transkription) av vad som sägs saknas. [ange var och hur det brister]"
            }
          ],
          "ifNo": []
        },
        {
          "id": "2",
          "condition": "Det finns video utan ljud.",
          "logic": "AND",
          "passCriteria": [
            {
              "id": "2.1",
              "requirement": "Det finns textalternativ som beskriver vad som visas i videon",
              "failureStatementTemplate": "Textalternativ som beskriver vad som visas i videon saknas. [ange var och hur det brister]"
            }
          ],
          "ifNo": []
        },
        {
          "id": "3",
          "condition": "Det finns video med ljud, t.ex. en vanlig film.",
          "logic": "AND",
          "passCriteria": [
            {
              "id": "3.1",
              "requirement": "Det finns ett textalternativ som identifierar innehållet.",
              "failureStatementTemplate": "Ett textalternativ som identifierar innehållet saknas. [ange var och hur det brister]"
            }
          ],
          "ifNo": []
        }
      ],
      "contentType": [
        "ljud-och-video-ljudklipp",
        "ljud-och-video-video-eller-filmklipp",
        "mediespelare-mediespelare-for-ljud",
        "mediespelare-mediespelare-for-video"
      ],
      "classifications": [
        {
          "taxonomyId": "wcag22-pour",
          "conceptId": "perceivable"
        }
      ]
    },
    "krav_alternativ_for_ljudklipp": {
      "id": "krav_alternativ_for_ljudklipp",
      "key": "krav_alternativ_for_ljudklipp",
      "title": "Textalternativ för förinspelat ljud",
      "metadata": {
        "mainCategory": {
          "text": "Ljud och video",
          "key": "ljud-och-video"
        },
        "subCategory": "",
        "impact": {
          "isCritical": false,
          "primaryScore": 4,
          "secondaryScore": 1,
          "assumedCompliance": false
        }
      },
      "standardReference": {
        "text": "9.1.2.1 Audio-only and Video-only (Prerecorded)",
        "url": "https://www.w3.org/WAI/WCAG22/quickref/#audio-only-and-video-only-prerecorded"
      },
      "exceptions": "",
      "examples": "",
      "tips": "",
      "commonErrors": "",
      "expectedObservation": "Det finns förinspelade ljudklipp. Varje ljudklipp har ett textalternativ, till exempel en transkription.; Textalternativet förmedlar samma information i samma ordning som ljudklippet.",
      "instructions": "Lyssna på ljudklippet och läs samtidigt transkriptionen, och kontrollera att de stämmer överens. Om det hörs flera röster, kontrollera att det framgår vem som säger vad.",
      "checks": [
        {
          "id": "1",
          "condition": "Det finns förinspelade ljudklipp.",
          "logic": "AND",
          "passCriteria": [
            {
              "id": "1.1",
              "requirement": "Varje ljudklipp har ett textalternativ, till exempel en transkription.",
              "failureStatementTemplate": "Någon eller några ljudklipp har inte ett textalternativ, till exempel en transkription.. [ange var och hur det brister]"
            },
            {
              "id": "1.2",
              "requirement": "Textalternativet förmedlar samma information i samma ordning som ljudklippet.",
              "failureStatementTemplate": "Textalternativet förmedlar samma information i samma ordning som ljudklippet gäller inte. [ange var och hur det brister]"
            }
          ],
          "ifNo": []
        }
      ],
      "contentType": [
        "ljud-och-video-ljudklipp",
        "mediespelare-mediespelare-for-ljud",
        "mediespelare-mediespelare-for-video"
      ],
      "classifications": [
        {
          "taxonomyId": "wcag22-pour",
          "conceptId": "perceivable"
        }
      ]
    },
    "krav_alternativ_for_animeringar_och_filmer": {
      "id": "krav_alternativ_for_animeringar_och_filmer",
      "key": "krav_alternativ_for_animeringar_och_filmer",
      "title": "Textalternativ för förinspelad video utan talat ljud",
      "metadata": {
        "mainCategory": {
          "text": "Ljud och video",
          "key": "ljud-och-video"
        },
        "subCategory": "",
        "impact": {
          "isCritical": false,
          "primaryScore": 4,
          "secondaryScore": 1,
          "assumedCompliance": false
        }
      },
      "standardReference": {
        "text": "9.1.2.1 Audio-only and Video-only (Prerecorded)",
        "url": "https://www.w3.org/WAI/WCAG22/quickref/#audio-only-and-video-only-prerecorded"
      },
      "exceptions": "",
      "examples": "",
      "tips": "",
      "commonErrors": "",
      "expectedObservation": "Det finns förinspelad video utan ljud. Filmen har ett textalternativ, till exempel en transkription. Filmen har ett separat ljudspår som beskriver handlingen i filmen. Alternativ (text eller ljudspår) finns för video utan ljud. Transkriptionen/ljudspåret förmedlar samma information i samma ordning som filmen.",
      "instructions": "Spela upp filmen och titta på filmen i sin helhet. \nLyssna efter någon som pratar och beskriver innehållet i filmen. \nDetta är inte kontroll av syntolkning, här ska vi se om informationen i filmen endast framgår visuellt.",
      "checks": [
        {
          "id": "1",
          "condition": "Det finns förinspelad video utan ljud.",
          "logic": "OR",
          "passCriteria": [
            {
              "id": "1.1",
              "requirement": "Filmen har ett textalternativ, till exempel en transkription.",
              "failureStatementTemplate": "Filmen saknar ett textalternativ, till exempel en transkription. [ange var och hur det brister]"
            },
            {
              "id": "1.2",
              "requirement": "Filmen har ett ljudspår som beskriver handlingen i filmen.",
              "failureStatementTemplate": "Filmen saknar ett ljudspår som beskriver handlingen i filmen. [ange var och hur det brister]"
            }
          ],
          "ifNo": []
        },
        {
          "id": "2",
          "condition": "Det finns video utan ljud och det finns även ett separat ljudspår som beskriver innehållet i filmen.",
          "logic": "AND",
          "passCriteria": [
            {
              "id": "2.1",
              "requirement": "Ljudspåret förmedlar samma information som filmen.",
              "failureStatementTemplate": "Ljudspåret förmedlar samma information som filmen gäller inte. [ange var och hur det brister]"
            },
            {
              "id": "2.2",
              "requirement": "Ljudspåret förmedlar samma informationen i samma ordning som i filmen.",
              "failureStatementTemplate": "Ljudspåret förmedlar samma informationen i samma ordning som i filmen gäller inte. [ange var och hur det brister]"
            }
          ],
          "ifNo": []
        }
      ],
      "contentType": [
        "ljud-och-video-video-eller-filmklipp",
        "mediespelare-mediespelare-for-ljud",
        "mediespelare-mediespelare-for-video"
      ],
      "classifications": [
        {
          "taxonomyId": "wcag22-pour",
          "conceptId": "perceivable"
        }
      ]
    },
    "krav_undertexter_krav": {
      "id": "krav_undertexter_krav",
      "key": "krav_undertexter_krav",
      "title": "Undertexter vid förinspelad video",
      "metadata": {
        "mainCategory": {
          "text": "Ljud och video",
          "key": "ljud-och-video"
        },
        "subCategory": {
          "text": "Undertexter",
          "key": "undertexter"
        },
        "impact": {
          "isCritical": false,
          "primaryScore": 2,
          "secondaryScore": 1,
          "assumedCompliance": false
        }
      },
      "standardReference": {
        "text": "9.1.2.2 Captions (Prerecorded)",
        "url": "https://www.w3.org/WAI/WCAG22/quickref/#captions-prerecorded"
      },
      "exceptions": "",
      "examples": "",
      "tips": "",
      "commonErrors": "",
      "expectedObservation": "Det finns film med relevant ljud. \nAlla filmer med relevant ljud har undertexter. \nUndertexterna förmedlar allt relevant ljudinnehåll i filmen.",
      "instructions": "Kontrollera om det finns en film på sidan. Är filmen, inte texten intill, den huvudsakliga informationsbäraren. \nSpela filmen med undertexterna synliga och kontrollera att allt relevant ljud återges i undertexterna, eller som synlig text i själva filmen.",
      "checks": [
        {
          "id": "1",
          "condition": "Det finns film med relevant ljud.",
          "logic": "AND",
          "passCriteria": [
            {
              "id": "1.1",
              "requirement": "Alla filmer med relevant ljud har undertexter.",
              "failureStatementTemplate": "Någon eller några filmer med relevant ljud har inte undertexter.. [ange var och hur det brister]"
            },
            {
              "id": "1.2",
              "requirement": "Undertexterna förmedlar allt relevant ljudinnehåll i filmen.",
              "failureStatementTemplate": "Undertexterna förmedlar allt relevant ljudinnehåll i filmen gäller inte. [ange var och hur det brister]"
            }
          ],
          "ifNo": []
        }
      ],
      "contentType": [
        "ljud-och-video-video-eller-filmklipp",
        "mediespelare-mediespelare-for-ljud",
        "mediespelare-mediespelare-for-video"
      ],
      "classifications": [
        {
          "taxonomyId": "wcag22-pour",
          "conceptId": "perceivable"
        }
      ]
    },
    "krav_syntolkning_eller_transkription": {
      "id": "krav_syntolkning_eller_transkription",
      "key": "krav_syntolkning_eller_transkription",
      "title": "Syntolkning eller mediaalternativ vid förinspelad video",
      "metadata": {
        "mainCategory": {
          "text": "Ljud och video",
          "key": "ljud-och-video"
        },
        "subCategory": {
          "text": "Syntolkning",
          "key": "syntolkning"
        },
        "impact": {
          "isCritical": false,
          "primaryScore": 1,
          "secondaryScore": 2,
          "assumedCompliance": false
        }
      },
      "standardReference": {
        "text": "9.1.2.3 Audio Description or Media Alternative (Prerecorded)",
        "url": "https://www.w3.org/WAI/WCAG22/quickref/#audio-description-or-media-alternative-prerecorded"
      },
      "exceptions": "",
      "examples": "",
      "tips": "",
      "commonErrors": "",
      "expectedObservation": "Kontroll av syntolkning – Filmen har syntolkning (ljudbeskrivning) som förmedlar samma information genom tal. \nFilmen saknar syntolkning (ljudbeskrivning) och det finns ett alternativ i maskinläsbar textform som förmedlar samma information som filmen, både visuell och audiell, och i samma ordning.",
      "instructions": "- Kontrollera att filmen har syntolkning och att syntolkningen följer händelseförloppet i filmen. Du ska kunna följa vad som händer i filmen även om du blundar.\n\nOm den dold, använd skärmläsare för att komma åt syntolkningen.\n- Om filmen behöver syntolkning men saknar det, kontrollera om motsvarande information finns i anslutning i filmen. Denna information ska du kunna markera och kopiera, eller så den kunna bli uppläst med skärmläsare. Texten kan tex finnas som vanlig text eller dokument.",
      "checks": [
        {
          "id": "1",
          "condition": "Filmen har syntolkning.",
          "logic": "AND",
          "passCriteria": [
            {
              "id": "1.1",
              "requirement": "Filmen har syntolkning (ljudbeskrivning) som förmedlar samma information genom tal.",
              "failureStatementTemplate": "Filmen saknar syntolkning (ljudbeskrivning) som förmedlar samma information genom tal. [ange var och hur det brister]"
            }
          ],
          "ifNo": []
        },
        {
          "id": "2",
          "condition": "Filmen saknar syntolkning (ljudbeskrivning).",
          "logic": "AND",
          "passCriteria": [
            {
              "id": "2.1",
              "requirement": "Det finns ett alternativ i maskinläsbar textform som förmedlar samma information som filmen, både visuell och audiell, och i samma ordning.",
              "failureStatementTemplate": "Ett alternativ i maskinläsbar textform som förmedlar samma information som filmen, både visuell och audiell, och i samma ordning saknas. [ange var och hur det brister]"
            }
          ],
          "ifNo": []
        }
      ],
      "contentType": [
        "ljud-och-video-video-eller-filmklipp",
        "mediespelare-mediespelare-for-ljud",
        "mediespelare-mediespelare-for-video"
      ],
      "classifications": [
        {
          "taxonomyId": "wcag22-pour",
          "conceptId": "perceivable"
        }
      ]
    },
    "krav_syntolkning_krav": {
      "id": "krav_syntolkning_krav",
      "key": "krav_syntolkning_krav",
      "title": "Syntolkning i förinspelad video",
      "metadata": {
        "mainCategory": {
          "text": "Ljud och video",
          "key": "ljud-och-video"
        },
        "subCategory": {
          "text": "Syntolkning",
          "key": "syntolkning"
        },
        "impact": {
          "isCritical": false,
          "primaryScore": 1,
          "secondaryScore": 2,
          "assumedCompliance": false
        }
      },
      "standardReference": {
        "text": "9.1.2.5 Audio Description (Prerecorded)",
        "url": "https://www.w3.org/WAI/WCAG22/quickref/#audio-description-prerecorded"
      },
      "exceptions": "",
      "examples": "",
      "tips": "",
      "commonErrors": "",
      "expectedObservation": "Filmen har syntolkning som berättar vad som händer i bild, så att man får samma information genom ljud.\nOm filmen har en tillräckligt bra verbalisering, så behövs ingen syntolkning.",
      "instructions": "Spela filmen och kontrollera att allt relevant visuellt innehåll förmedlas genom syntolkning.",
      "checks": [
        {
          "id": "1",
          "condition": "Det finns minst en film på webbplatsen.",
          "logic": "OR",
          "passCriteria": [
            {
              "id": "1.1",
              "requirement": "Filmen har syntolkning som berättar med ord vad som händer i bilden.",
              "failureStatementTemplate": "Filmen saknar syntolkning som berättar med ord vad som händer i bilden. [ange var och hur det brister]"
            },
            {
              "id": "1.2",
              "requirement": "Filmen har en verbalisering som gör att syntolkning inte behövs.",
              "failureStatementTemplate": "Filmen saknar en verbalisering som gör att syntolkning inte behövs. [ange var och hur det brister]"
            }
          ],
          "ifNo": []
        }
      ],
      "contentType": [
        "ljud-och-video-video-eller-filmklipp",
        "mediespelare-mediespelare-for-ljud",
        "mediespelare-mediespelare-for-video"
      ],
      "classifications": [
        {
          "taxonomyId": "wcag22-pour",
          "conceptId": "perceivable"
        }
      ]
    },
    "krav_listor": {
      "id": "krav_listor",
      "key": "krav_listor",
      "title": "Information och relationer för listor",
      "metadata": {
        "mainCategory": {
          "text": "Innehåll",
          "key": "innehall"
        },
        "subCategory": {
          "text": "Semantik",
          "key": "semantik"
        },
        "impact": {
          "isCritical": true,
          "primaryScore": 1,
          "secondaryScore": 2,
          "assumedCompliance": false
        }
      },
      "standardReference": {
        "text": "9.1.3.1 Info and Relationships",
        "url": "https://www.w3.org/WAI/WCAG22/quickref/#info-and-relationships"
      },
      "exceptions": "",
      "examples": "En punktlista med <ul> och <li>, eller en ordnad lista med <ol> och <li>.",
      "tips": "Om du är osäker, kontrollera i koden om listan är markerad med <ul>, <ol>, eller <dl>.",
      "commonErrors": "Innehåll som ser ut som en lista är inte uppmärkt som lista i koden.",
      "expectedObservation": "Listor där elementens ordning påverkar listans betydelse är uppmärkta med <ol> och elementen med <li>. \nListor där elementens ordning inte påverkar listans betydelse är uppmärkta med <ul> och elementen med <li>. \nParvisa listor är uppmärkta med <dl>. Det finns parvis listinformation (nyckel/värde eller term/beskrivning).  \nVarje element i en parvis lista innehåller minst ett <dt>-element. Varje element i en parvis lista innehåller minst ett <dd>-element.",
      "instructions": "Leta efter innehåll som borde vara uppmärkt som listor och efter innehåll som är uppmärkt som listor.",
      "checks": [
        {
          "id": "1",
          "condition": "Det finns information som behöver grupperas, där informationens ordning har betydelse.",
          "logic": "AND",
          "passCriteria": [
            {
              "id": "1.1",
              "requirement": "Listor där elementens ordning påverkar listans betydelse är uppmärkta med <ol> och elementen med <li>.",
              "failureStatementTemplate": "Listor där elementens ordning påverkar listans betydelse är inte uppmärkta med <ol> och elementen med <li>. [ange var och hur det brister]"
            }
          ],
          "ifNo": []
        },
        {
          "id": "2",
          "condition": "Det finns information som behöver grupperas, där informationens ordning saknar betydelse.",
          "logic": "AND",
          "passCriteria": [
            {
              "id": "2.1",
              "requirement": "Listor där elementens ordning inte påverkar listans betydelse är uppmärkta med <ul> och elementen med <li>.",
              "failureStatementTemplate": "Listor där elementens ordning inte påverkar listans betydelse är inte uppmärkta med <ul> och elementen med <li>. [ange var och hur det brister]"
            }
          ],
          "ifNo": []
        },
        {
          "id": "3",
          "condition": "Det finns parvis listinformation (nyckel/värde eller term/beskrivning).",
          "logic": "AND",
          "passCriteria": [
            {
              "id": "3.1",
              "requirement": "Parvisa listor är uppmärkta med <dl>.",
              "failureStatementTemplate": "Parvisa listor är inte uppmärkta med <dl>. [ange var och hur det brister]"
            },
            {
              "id": "3.2",
              "requirement": "Varje element i en parvis lista innehåller minst ett <dt>-element.",
              "failureStatementTemplate": "Någon eller några element i en parvis lista innehåller minst ett <dt>-element.. [ange var och hur det brister]"
            },
            {
              "id": "3.3",
              "requirement": "Varje element i en parvis lista innehåller minst ett <dd>-element.",
              "failureStatementTemplate": "Någon eller några element i en parvis lista innehåller minst ett <dd>-element.. [ange var och hur det brister]"
            }
          ],
          "ifNo": []
        },
        {
          "id": "4",
          "condition": "Alla listor har korrekt kod i HTML.",
          "logic": "AND",
          "passCriteria": [
            {
              "id": "4.1",
              "requirement": "Allt som är uppmärkt som listor är listinformation.",
              "failureStatementTemplate": "Allt som är inte uppmärkt som listor är listinformation. [ange var och hur det brister]"
            }
          ],
          "ifNo": []
        }
      ],
      "contentType": [
        "navigering-navigeringsmenyer",
        "teknisk-grundstruktur-roller-och-egenskaper-i-koden",
        "text-och-struktur-landmarken",
        "text-och-struktur-listor"
      ],
      "classifications": [
        {
          "taxonomyId": "wcag22-pour",
          "conceptId": "perceivable"
        }
      ]
    },
    "krav_aaa8ac25_2416_4315_a90e_fdd5b4cc99d7": {
      "id": "krav_aaa8ac25_2416_4315_a90e_fdd5b4cc99d7",
      "key": "krav_aaa8ac25_2416_4315_a90e_fdd5b4cc99d7",
      "title": "Undertexter vid direktsändning",
      "metadata": {
        "mainCategory": {
          "text": "Ljud och video",
          "key": "ljud-och-video"
        },
        "subCategory": {
          "text": "Undertexter",
          "key": "undertexter"
        },
        "impact": {
          "isCritical": false,
          "primaryScore": 2,
          "secondaryScore": 1,
          "assumedCompliance": false
        }
      },
      "standardReference": {
        "text": "9.1.2.4 Captions (Live)",
        "url": "https://www.w3.org/WAI/WCAG22/quickref/?currentsidebar=%23col_overview&showtechniques=111%2C121%2C122%2C123%2C124%2C125%2C131#captions-live"
      },
      "exceptions": "",
      "examples": "",
      "tips": "",
      "commonErrors": "",
      "expectedObservation": "Direktsänd video har undertexter som är synkroniserade med det talade innehållet. Undertexterna kan vara öppna eller stängda (open caption vs closed caption).",
      "instructions": "OBS: Avvakta med att granska denna - godkänn direkt.\nDetta krav finns inte med i EN 301 549 version 3.2.1 även då kravet ligger på AA-nivå WCAG 2.2.\n\nLeta upp en direktsändning. Det ska vara en videoström.\nKontrollera att det finns undertexter så man kan ta del av det som sägs utan att behöva lyssna på ljudet. Du kan t.ex. stänga av ljudet och se om du kan ta del av det talade innehållet.",
      "checks": [
        {
          "id": "1",
          "condition": "Det finns minst en pågående direktsändning på den granskade webbplatsen.",
          "logic": "AND",
          "passCriteria": [
            {
              "id": "1.1",
              "requirement": "Det finns undertexter i den direktsändning du tittar på.",
              "failureStatementTemplate": "Undertexter i den direktsändning du tittar på saknas. [ange var och hur det brister]"
            },
            {
              "id": "1.2",
              "requirement": "Undertexterna ligger någolunda i synk med det talade innehållet.",
              "failureStatementTemplate": "Undertexterna ligger någolunda i synk med det talade innehållet gäller inte. [ange var och hur det brister]"
            }
          ],
          "ifNo": []
        }
      ],
      "contentType": [
        "ljud-och-video-video-eller-filmklipp",
        "mediespelare-mediespelare-for-ljud",
        "mediespelare-mediespelare-for-video",
        "enhetsspecifikt-och-avancerat-rost-och-videokommunikation"
      ],
      "classifications": [
        {
          "taxonomyId": "wcag22-pour",
          "conceptId": "perceivable"
        }
      ]
    },
    "krav_41e927b2_0da7_422c_b210_210c1f1cf14a": {
      "id": "krav_41e927b2_0da7_422c_b210_210c1f1cf14a",
      "key": "krav_41e927b2_0da7_422c_b210_210c1f1cf14a",
      "title": "Information och relationer för landmärken",
      "metadata": {
        "mainCategory": {
          "text": "Innehåll",
          "key": "innehall"
        },
        "subCategory": {
          "text": "Semantik",
          "key": "semantik"
        },
        "impact": {
          "isCritical": true,
          "primaryScore": 1,
          "secondaryScore": 2,
          "assumedCompliance": false
        }
      },
      "standardReference": {
        "text": "9.1.3.1 Info and Relationships",
        "url": "https://www.w3.org/WAI/WCAG22/quickref/#info-and-relationships"
      },
      "exceptions": "",
      "examples": "",
      "tips": "",
      "commonErrors": "",
      "expectedObservation": "Sidans struktur framgår maskinläsbart med landmärken använda på ett korrekt sätt.\nEndast strukturbärande innehåll ska vara uppmärkt med relevant landmärke.\nSidans huvudsakliga innehåll ska alltid vara markerat som <main> eller med attributet role=\"main\".",
      "instructions": "Använd tillägget \"Landmarks\" i webbläsaren för att kontrollera hur landmärken används på sidan.\nTillägget WAVE kan också kontrollera landmärken.\nPTS bookmarklet \"Landmärken\" ger också värdefull information",
      "checks": [
        {
          "id": "1",
          "condition": "Sidan har innehåll som ska vara uppmärkt som landmärken.",
          "logic": "AND",
          "passCriteria": [
            {
              "id": "1.1",
              "requirement": "Samtliga landmärken på sidan är korrekt använda utifrån deras respektive funktion.",
              "failureStatementTemplate": "Ett eller flera landmärken på sidan är felaktigt använda utifrån deras respektive funktion. [ange var och hur det brister]"
            }
          ],
          "ifNo": []
        },
        {
          "id": "2",
          "condition": "Sidan har en del där det viktigaste innehållet finns.",
          "logic": "AND",
          "passCriteria": [
            {
              "id": "2.1",
              "requirement": "Sidans huvudsakliga innehåll ligger i ett main-element, antingen <main> eller med attributet role=\"main\".",
              "failureStatementTemplate": "Sidans huvudsakliga innehåll ligger inte i något <main>-element. [ange var och hur det brister]"
            },
            {
              "id": "2.2",
              "requirement": "Sidan innehåller endast ett visuellt synligt landmärke av typen main",
              "failureStatementTemplate": "Sidan innehåller fler än ett visuellt synligt landmärke av typen`main`. [ange var och hur det brister]"
            },
            {
              "id": "2.3",
              "requirement": "Om sidan innehåller flera landmärken av typen main så är alla utom ett av dessa landmärken maskinläsbart dolda.",
              "failureStatementTemplate": "Sidan innehåller flera landmärken av typen main och fler än ett av dessa landmärken är maskinläsbart dolda. [ange var och hur det brister]"
            }
          ],
          "ifNo": []
        }
      ],
      "contentType": [
        "teknisk-grundstruktur-roller-och-egenskaper-i-koden",
        "text-och-struktur-landmarken"
      ],
      "classifications": [
        {
          "taxonomyId": "wcag22-pour",
          "conceptId": "perceivable"
        }
      ]
    },
    "krav_8639b1f4_b775_4075_b3f9_bc723f5d2806": {
      "id": "krav_8639b1f4_b775_4075_b3f9_bc723f5d2806",
      "key": "krav_8639b1f4_b775_4075_b3f9_bc723f5d2806",
      "title": "Fokus inte dolt",
      "metadata": {
        "mainCategory": {
          "text": "Generella krav",
          "key": "generella-krav"
        },
        "subCategory": {
          "text": "Fokus",
          "key": "fokus"
        },
        "impact": {
          "isCritical": false,
          "primaryScore": 0,
          "secondaryScore": 0,
          "assumedCompliance": false
        }
      },
      "standardReference": {
        "text": "9.2.4.11 Focus Not Obscured (Minimum) - WCAG 2.2",
        "url": "https://www.w3.org/WAI/WCAG22/quickref/?currentsidebar=%23col_overview&showtechniques=121%2C131%2C132%2C133%2C134%2C135%2C141%2C142%2C2411%2C257%2C332%2C144&versions=2.2#focus-not-obscured-minimum"
      },
      "exceptions": "Kravet är uppfyllt om fokusmarkeringen syns delvis. Så länge fokuset syns på något sätt, är det godkänt.",
      "examples": "",
      "tips": "",
      "commonErrors": "\"Sticky\" sidhuvud och sidfot. Sådant innehåll som \"följer med\" när en användare scrollar en sida lägger sig över fokusmarkeringen.\nEn utfälld meny förblir öppen när användare navigerar ifrån den. Fokus hamnar på element som ligger bakom det utfällda innehållet och syns därmed inte.",
      "expectedObservation": "När ett interaktivt element får tangentbordsfokus, är inte fokusmarkeringen helt dold på grund av utvecklarskapat innehåll. \nAnvändare som navigerar med tangentbordet alltid ska kunna se vilket element som är i fokus.",
      "instructions": "Navigera genom sidan med tangentbordet. När ett fokuserbart element får fokus, ska fokusmarkeringen inte helt döljas av annat innehåll på sidan.",
      "checks": [
        {
          "id": "1",
          "condition": "Det finns fokuserbara element på sidan.",
          "logic": "AND",
          "passCriteria": [
            {
              "id": "1.1",
              "requirement": "Fokusmarkeringen syns helt eller delvis när elementen har tangentbordsfokus.",
              "failureStatementTemplate": "Fokusmarkeringen syns helt eller delvis när elementen saknar tangentbordsfokus. [ange var och hur det brister]"
            }
          ],
          "ifNo": []
        },
        {
          "id": "2",
          "condition": "Fokuset är dolt av annat innehåll",
          "logic": "AND",
          "passCriteria": [
            {
              "id": "2.1",
              "requirement": "Det går att flytta på det element som döljer det element som är i fokus.",
              "failureStatementTemplate": "Det är svårt eller omöjligt att flytta på det element som döljer det element som är i fokus. [ange var och hur det brister]"
            },
            {
              "id": "2.2",
              "requirement": "Det element som är i fokus går att visa igen utan att flytta fokus med tangentbordet.",
              "failureStatementTemplate": "Det element som är inte i fokus går att visa igen utan att flytta fokus med tangentbordet. [ange var och hur det brister]"
            }
          ],
          "ifNo": []
        }
      ],
      "contentType": [
        "formular-inmatningsfalt",
        "formular-knappar",
        "interaktiva-komponenter-komplexa-interaktiva-komponenter",
        "mediespelare-mediespelare-for-ljud",
        "mediespelare-mediespelare-for-video",
        "navigering-lankar",
        "navigering-navigeringsmenyer",
        "sarskilda-hinder-captcha",
        "text-och-struktur-tabeller"
      ],
      "classifications": [
        {
          "taxonomyId": "wcag22-pour",
          "conceptId": "operable"
        }
      ]
    },
    "krav_4ab35a0d_95ba_47bc_b3b7_7685711b6b86": {
      "id": "krav_4ab35a0d_95ba_47bc_b3b7_7685711b6b86",
      "key": "krav_4ab35a0d_95ba_47bc_b3b7_7685711b6b86",
      "title": "Dragrörelser",
      "metadata": {
        "mainCategory": {
          "text": "Touchskärmar, mobila enheter och pekare",
          "key": "touchskarmar-mobila-enheter-och-pekare"
        },
        "subCategory": "",
        "impact": {
          "isCritical": false,
          "primaryScore": 0,
          "secondaryScore": 0,
          "assumedCompliance": false
        }
      },
      "standardReference": {
        "text": "9.2.5.7 Dragging Movements (Wcag 2.2)",
        "url": "https://www.w3.org/WAI/WCAG22/quickref/?currentsidebar=%23col_overview&showtechniques=121%2C131%2C132%2C133%2C134%2C135%2C141%2C142%2C2411%2C257%2C332%2C144&versions=2.2#dragging-movements"
      },
      "exceptions": "Om dragfunktionen är absolut nödvändig för att uppnå syftet.",
      "examples": "Dra-och-släpp-funktioner för att ladda upp filer.\nDra-och-släpp-funktioner för att sortera listor eller tabeller.",
      "tips": "",
      "commonErrors": "En filuppladdning som endast kan användas med dra-och-släpp-funktionalitet.",
      "expectedObservation": "All funktionalitet som använder drag-rörelser ska gå att utföra på ett alternativt sätt som inte kräver drag-rörelse. \nExempel på sådana är att klicka, trycka eller använda tangentbordet.",
      "instructions": "Kontrollera om det finns drag-funktion på sidan. Det ska då finnas ett alternativ som inte kräver drag-rörelse av användaren.",
      "checks": [
        {
          "id": "1",
          "condition": "Det finns en drag-funktion på sidan.",
          "logic": "OR",
          "passCriteria": [
            {
              "id": "1.1",
              "requirement": "Syftet med drag-funktionen går att uppnå på ett alternativt sätt som inte är beroende av drag-rörelser.",
              "failureStatementTemplate": "Syftet med drag-funktionen går inte att uppnå på ett alternativt sätt som inte är beroende av drag-rörelser. [ange var och hur det brister]"
            },
            {
              "id": "1.2",
              "requirement": "Drag-funktionen är nödvändig för att uppnå syftet.",
              "failureStatementTemplate": "Drag-funktionen kan uppnås utan denna funktion. [ange var och hur det brister]"
            }
          ],
          "ifNo": []
        }
      ],
      "contentType": [
        "enhetsspecifikt-och-avancerat-touchfunktioner",
        "formular-inmatningsfalt",
        "interaktiva-komponenter-komplexa-interaktiva-komponenter",
        "sarskilda-hinder-captcha",
        "text-och-struktur-tabeller"
      ],
      "classifications": [
        {
          "taxonomyId": "wcag22-pour",
          "conceptId": "operable"
        }
      ]
    },
    "krav_a3e6542f_ad46_4b6e_84df_9da322b3dd53": {
      "id": "krav_a3e6542f_ad46_4b6e_84df_9da322b3dd53",
      "key": "krav_a3e6542f_ad46_4b6e_84df_9da322b3dd53",
      "title": "Klickyta",
      "metadata": {
        "mainCategory": {
          "text": "Generella krav",
          "key": "generella-krav"
        },
        "subCategory": "",
        "impact": {
          "isCritical": false,
          "primaryScore": 0,
          "secondaryScore": 0,
          "assumedCompliance": false
        }
      },
      "standardReference": {
        "text": "9.2.5.8 Target Size (WCAG 2.2)",
        "url": "https://www.w3.org/WAI/WCAG22/quickref/?currentsidebar=%23col_overview&showtechniques=121%2C131%2C132%2C133%2C134%2C135%2C141%2C142%2C2411%2C257%2C332%2C144&versions=2.2#target-size-minimum"
      },
      "exceptions": "Om den lilla klickytan har ett alternativ med större mål någon annanstans på sidan. \nOm det är ett standardelement i operativsystemet/webbläsaren, som utvecklaren inte kan ändra på.\nOm visningen styrs av användaren, t.ex. med egna inställningar. \nOm det inte är tekniskt möjligt att göra målet större.",
      "examples": "En liten ikon eller symbol inuti en knapp behöver tillräckligt mycket ytan runtomkring sig så att knappen totala klickyta är minst 24 x 24 pixlar.",
      "tips": "",
      "commonErrors": "Skräddarsydda element där man inte har angett tillräckligt stor klickyta.\nKnappar med endast ikoner och för liten klickyta.",
      "expectedObservation": "Klickbara objekt (som knappar, länkar, ikoner) ska vara tillräckligt stora – minst 24x24 CSS-pixlar – så att de är lätta att träffa med fingret eller muspekaren.",
      "instructions": "Hitta klickbara objekten på sidan.\nFör att kontrollera den klickbara ytans storlek: Högerklicka på det klickbara objektet och välj \"Inspektera\" för att se koden. I inspektorläget är nu det valda elementet markerat och du kan se elementets klickyta och måtten på den i CSS-pixlar.",
      "checks": [
        {
          "id": "1",
          "condition": "Det finns klickbara objekt på sidan",
          "logic": "AND",
          "passCriteria": [
            {
              "id": "1.1",
              "requirement": "Klickytan är minst 24 x 24 pixlar",
              "failureStatementTemplate": "Klickytan är lägre än 24 x 24 pixlar. [ange var och hur det brister]"
            },
            {
              "id": "1.2",
              "requirement": "Det finns ett annat klickbart objekt med större yta (minst 24 x 24 pixlar) och samma funktionalitet på sidan.",
              "failureStatementTemplate": "Ett annat klickbart objekt med större yta (minst 24 x 24 pixlar) och samma funktionalitet på sidan saknas. [ange var och hur det brister]"
            },
            {
              "id": "1.3",
              "requirement": "Användaren har själv ändrat layouten så det blivit mindre.",
              "failureStatementTemplate": "Användaren saknar själv ändrat layouten så det blivit mindre. [ange var och hur det brister]"
            }
          ],
          "ifNo": []
        }
      ],
      "contentType": [
        "formular-inmatningsfalt",
        "formular-knappar",
        "interaktiva-komponenter-komplexa-interaktiva-komponenter",
        "mediespelare-mediespelare-for-ljud",
        "mediespelare-mediespelare-for-video",
        "navigering-lankar",
        "navigering-navigeringsmenyer",
        "sarskilda-hinder-captcha",
        "text-och-struktur-tabeller"
      ],
      "classifications": [
        {
          "taxonomyId": "wcag22-pour",
          "conceptId": "operable"
        }
      ]
    },
    "krav_79482664_de10_4f48_aecf_445acc884f4f": {
      "id": "krav_79482664_de10_4f48_aecf_445acc884f4f",
      "key": "krav_79482664_de10_4f48_aecf_445acc884f4f",
      "title": "Konsekvent hjälp",
      "metadata": {
        "mainCategory": {
          "text": "Användargränssnitt",
          "key": "anvandargranssnitt"
        },
        "subCategory": {
          "text": "Supporttjänster",
          "key": "supporttjanster"
        },
        "impact": {
          "isCritical": false,
          "primaryScore": 0,
          "secondaryScore": 0,
          "assumedCompliance": false
        }
      },
      "standardReference": {
        "text": "9.3.2.6 Consistent Help (WCAG 2.2)",
        "url": "https://www.w3.org/WAI/WCAG22/quickref/?currentsidebar=%23col_overview&showtechniques=121%2C131%2C132%2C133%2C134%2C135%2C141%2C142%2C144%2C242%2C2411%2C257%2C311%2C332%2C322&versions=2.2only&levels=aaa#consistent-help"
      },
      "exceptions": "Om användaren själv gör en ändring, exempelvis zoomar eller ändrar orientering.",
      "examples": "Exempel på hjälpfunktioner: \n- Kontaktlänkar\n- Chattfunktion\n- Hjälpavsnitt, FAQ-länkar\n- Automatiserad kontaktfunktion (chattbot exempelvis)",
      "tips": "",
      "commonErrors": "",
      "expectedObservation": "Om en webbsida innehåller hjälpfunktioner, och de funktionerna upprepas på flera webbsidor inom webbplatsen, ska de ligga på samma platser. \nDe ska även ha samma namn och utseende på alla sidor, och fungera på liknande sätt varje gång.\nMålet är att det ska vara lätt att hitta hjälpfunktionerna när du behöver dem.",
      "instructions": "Leta efter hjälpfunktioner på sidan. \nKontrollera om de ligger på samma plats, heter samma sak och ser likadana ut på de andra sidorna som ska granskas.",
      "checks": [
        {
          "id": "1",
          "condition": "Hjälpfunktioner finns på flera sidor.",
          "logic": "AND",
          "passCriteria": [
            {
              "id": "1.1",
              "requirement": "Hjälpfunktionerna är konsekvent placerade.",
              "failureStatementTemplate": "Hjälpfunktionerna är inte konsekvent placerade. [ange var och hur det brister]"
            },
            {
              "id": "1.2",
              "requirement": "Hjälpfunktionerna har samma namn och utseende.",
              "failureStatementTemplate": "Hjälpfunktionerna saknar samma namn och utseende. [ange var och hur det brister]"
            },
            {
              "id": "1.3",
              "requirement": "Hjälpfunktionerna fungerar på liknande sätt varje gång.",
              "failureStatementTemplate": "Hjälpfunktionerna fungerar på liknande sätt varje gång gäller inte. [ange var och hur det brister]"
            }
          ],
          "ifNo": []
        }
      ],
      "contentType": [
        "formular-inmatningsfalt",
        "formular-knappar",
        "interaktiva-komponenter-komplexa-interaktiva-komponenter",
        "navigering-lankar",
        "navigering-navigeringsmenyer"
      ],
      "classifications": [
        {
          "taxonomyId": "wcag22-pour",
          "conceptId": "understandable"
        }
      ]
    },
    "krav_55703d23_8ce5_474b_875e_a3d3b3c37f1c": {
      "id": "krav_55703d23_8ce5_474b_875e_a3d3b3c37f1c",
      "key": "krav_55703d23_8ce5_474b_875e_a3d3b3c37f1c",
      "title": "Upprepad inmatning",
      "metadata": {
        "mainCategory": {
          "text": "Användargränssnitt",
          "key": "anvandargranssnitt"
        },
        "subCategory": {
          "text": "Interaktiva komponenter",
          "key": "interaktiva-komponenter"
        },
        "impact": {
          "isCritical": false,
          "primaryScore": 0,
          "secondaryScore": 0,
          "assumedCompliance": false
        }
      },
      "standardReference": {
        "text": "9.3.3.7 Redundant Entry (Wcag 2.2)",
        "url": "https://www.w3.org/WAI/WCAG22/quickref/?currentsidebar=%23col_overview&showtechniques=121%2C131%2C132%2C133%2C134%2C135%2C141%2C142%2C144%2C242%2C2411%2C257%2C311%2C332%2C322&versions=2.2only&levels=aaa#redundant-entry"
      },
      "exceptions": "När upprepad inmatning är viktig, exempelvis för att göra ett nytt lösenord.\nInformationen behövs för att upprätthålla innehållets säkerhet, exempelvis när en användare ska logga in.\nTidigare inmatad data är inte längre giltig.",
      "examples": "Exempel på flöden: Registrering, Beställning/köp, Boka tid i en e-tjänst, Fyller i formulär i flera steg.\n\nExempel på situation: \nVid en bokning med flera personer - första personens adress fylls i och den dyker sedan upp som ett alternativ för varje återstående person.",
      "tips": "",
      "commonErrors": "Tidigare ifylld information efterfrågas flera gånger, och användaren kan inte återanvända den.\n\nEn användare fyller i sitt namn och adress i steg 1 av ett kassaflöde.\nI steg 3 ombeds användaren igen skriva in namn och adress manuellt – trots att webbplatsen redan har informationen från tidigare steg.",
      "expectedObservation": "Användaren ska inte behöva skriva in samma information mer än en gång i ett flöde.",
      "instructions": "Hitta ett flöde där användaren förväntas mata in information. \nMata in den begärda informationen i första steget, och gå vidare. \nKontrollera om du behöver skriva in samma information igen senare. \nKontrollera om alternativ finns, exempelvis funktioner som förifyllt fält, kryssruta \"Använd tidigare uppgifter\" eller låter användaren välja från en sparad profil eller adressbok.",
      "checks": [
        {
          "id": "1",
          "condition": "Det finns ett flöde på sidan där användaren ska fylla i information",
          "logic": "OR",
          "passCriteria": [
            {
              "id": "1.1",
              "requirement": "Användaren behöver inte skriva in samma information fler gånger än en.",
              "failureStatementTemplate": "Användaren behöver inte skriva in samma information fler gånger än en gäller inte. [ange var och hur det brister]"
            },
            {
              "id": "1.2",
              "requirement": "Upprepningen är viktig för säkerheten.",
              "failureStatementTemplate": "Upprepningen är inte viktig för säkerheten. [ange var och hur det brister]"
            },
            {
              "id": "1.3",
              "requirement": "Tidigare inmatad data är inte längre giltig.",
              "failureStatementTemplate": "Tidigare inmatad data är inte inte längre giltig. [ange var och hur det brister]"
            }
          ],
          "ifNo": []
        }
      ],
      "contentType": [
        "formular-inmatningsfalt",
        "formular-knappar",
        "interaktiva-komponenter-komplexa-interaktiva-komponenter"
      ],
      "classifications": [
        {
          "taxonomyId": "wcag22-pour",
          "conceptId": "understandable"
        }
      ]
    },
    "krav_045ebfdc_732b_48a0_aba3_51c81b77bbfd": {
      "id": "krav_045ebfdc_732b_48a0_aba3_51c81b77bbfd",
      "key": "krav_045ebfdc_732b_48a0_aba3_51c81b77bbfd",
      "title": "Tillgänglig autentisering",
      "metadata": {
        "mainCategory": {
          "text": "Användargränssnitt",
          "key": "anvandargranssnitt"
        },
        "subCategory": "",
        "impact": {
          "isCritical": false,
          "primaryScore": 0,
          "secondaryScore": 0,
          "assumedCompliance": false
        }
      },
      "standardReference": {
        "text": "9.3.3.8 Accessible Authentication (Minimum) (Wcag 2.2)",
        "url": "https://www.w3.org/WAI/WCAG22/quickref/?currentsidebar=%23col_overview&showtechniques=121%2C131%2C132%2C133%2C134%2C135%2C141%2C142%2C144%2C242%2C2411%2C257%2C311%2C332%2C322&versions=2.2only&levels=aaa#accessible-authentication-minimum"
      },
      "exceptions": "- Bilder och objekt som användare själva tillhandahållit webbplatsen kan klassas som kognitivt funktionstest men är undantag i detta kriterie.\n- Autentiseringen är nödvändig för säkerheten, och det finns inte något tekniskt alternativ som inte kräver kognitiv testning.",
      "examples": "Exempel på uppgifter som uppfyller kraven: \n- Engångslänk \"Logga in med e-postlänk\"\n- Kopiera och klistra in en kod\n- Biometrisk inloggning (exempelvis fingeravtryck, Face ID osv)\n- Autofyll av lösenord.",
      "tips": "",
      "commonErrors": "- Komma ihåg ett lösenord.\n- Lösa ett bildpussel.\n- Identifiera bilder med t.ex. bilar eller trafikljus i.",
      "expectedObservation": "Autentiseringar som bygger på test av kognitiv förmåga får användas om minst ett av följande stämmer: \n- Det finns en annan autentiseringsmetod som inte bygger på test av kognitiv förmåga.\n- Det finns en mekanism som hjälper användaren att slutföra autentiseringen.\n- Testet av kognitiv förmåga består av icke-textuellt innehåll som användaren själv har tillhandahållit webbplatsen.",
      "instructions": "- Hitta funktioner på webbplatsen som kräver autentisering av något slag. \n- Leta efter funktioner som innehåller test av kognitiv förmåga.\n\nKognitiv förmåga kan t.ex. handla om att känna igen objekt i bilder, komma ihåg lösenord, räkna ett mattetal med mera.",
      "checks": [
        {
          "id": "1",
          "condition": "Det finns en autentisering som innehåller ett test av kognitiv förmåga.",
          "logic": "OR",
          "passCriteria": [
            {
              "id": "1.1",
              "requirement": "Det finns en autentiseringsmetod som inte bygger på kognitiva testet.",
              "failureStatementTemplate": "En autentiseringsmetod som inte bygger på kognitiva testet saknas. [ange var och hur det brister]"
            },
            {
              "id": "1.2",
              "requirement": "Det finns en mekanism som hjälper användaren att slutföra autentiseringen.",
              "failureStatementTemplate": "En mekanism som hjälper användaren att slutföra autentiseringen saknas. [ange var och hur det brister]"
            },
            {
              "id": "1.3",
              "requirement": "Testet av kognitiv förmåga består av igenkänning av objekt (bilder, grafik etc.) som användaren själv har tillhandahållit webbplatsen.",
              "failureStatementTemplate": "Testet av kognitiv förmåga består av igenkänning av objekt (bilder, grafik etc.) som användaren själv saknar tillhandahållit webbplatsen. [ange var och hur det brister]"
            },
            {
              "id": "1.4",
              "requirement": "Autentiseringen med ett test av kognitiv förmåga är nödvändig för säkerheten.",
              "failureStatementTemplate": "Autentiseringen med ett test av kognitiv förmåga är inte nödvändig för säkerheten. [ange var och hur det brister]"
            }
          ],
          "ifNo": []
        }
      ],
      "contentType": [
        "bilder-och-ikoner-bilder",
        "bilder-och-ikoner-ikoner",
        "bilder-och-ikoner-kartor-diagram-och-datavisualisering",
        "enhetsspecifikt-och-avancerat-biometri",
        "formular-inmatningsfalt",
        "formular-knappar",
        "interaktiva-komponenter-komplexa-interaktiva-komponenter",
        "ljud-och-video-animeringar-utan-ljud",
        "ljud-och-video-ljudklipp",
        "sarskilda-hinder-captcha"
      ],
      "classifications": [
        {
          "taxonomyId": "wcag22-pour",
          "conceptId": "understandable"
        }
      ]
    }
  }
}